#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_ActionWorkPOI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_ActionWorkPOI.A_ActionWorkPOI_C
// 0x0068 (0x03A0 - 0x0338)
class AA_ActionWorkPOI_C final : public AActionWorkPOI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0338(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextRenderComponent*                   KeyError;                                          // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   KeyError2;                                         // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   KeyError3;                                         // 0x0350(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   POIError;                                          // 0x0358(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ValueError;                                        // 0x0360(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ValueError2;                                       // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ValueError3;                                       // 0x0370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ManagerError;                                      // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplineToAction;                                    // 0x0380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ProfActiv;                                         // 0x0388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EHumanPOIState State)> StateChanged;                               // 0x0390(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ActionWorkState(EHumanPOIState State);
	void DebugInfo(bool ShowInfo);
	void ExecuteUbergraph_A_ActionWorkPOI(int32 EntryPoint);
	void GetActionWorkData(class UMatrixProfDataAsset** ActionData_0);
	void GetHumanPOI(class AHumanPOI** HumanPOI);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_ActionWorkPOI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_ActionWorkPOI_C")
	}
	static class AA_ActionWorkPOI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_ActionWorkPOI_C>();
	}
};
DUMPER7_ASSERTS_AA_ActionWorkPOI_C;

}

