#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_ActionHumanPOI

#include "Basic.hpp"

#include "Smuta_structs.hpp"


namespace SDK::Params
{

// Function A_ActionHumanPOI.A_ActionHumanPOI_C.ActionStatePOIChanged
// 0x0001 (0x0001 - 0x0000)
struct A_ActionHumanPOI_C_ActionStatePOIChanged final
{
public:
	EHumanPOIState                                State;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_A_ActionHumanPOI_C_ActionStatePOIChanged;

// Function A_ActionHumanPOI.A_ActionHumanPOI_C.ExecuteUbergraph_A_ActionHumanPOI
// 0x0008 (0x0008 - 0x0000)
struct A_ActionHumanPOI_C_ExecuteUbergraph_A_ActionHumanPOI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHumanPOIState                                K2Node_CustomEvent_State;                          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_A_ActionHumanPOI_C_ExecuteUbergraph_A_ActionHumanPOI;

// Function A_ActionHumanPOI.A_ActionHumanPOI_C.GetHumanPOI
// 0x0008 (0x0008 - 0x0000)
struct A_ActionHumanPOI_C_GetHumanPOI final
{
public:
	class AHumanPOI*                              HumanPOI;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_A_ActionHumanPOI_C_GetHumanPOI;

// Function A_ActionHumanPOI.A_ActionHumanPOI_C.UserConstructionScript
// 0x0030 (0x0030 - 0x0000)
struct A_ActionHumanPOI_C_UserConstructionScript final
{
public:
	EDayNightState                                Temp_byte_Variable;                                // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default;                             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_A_ActionHumanPOI_C_UserConstructionScript;

}

