#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_DialogueSystemHelper

#include "Basic.hpp"

#include "STR_ActorRotation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "S_DayLightSetup_structs.hpp"
#include "S_ParticipoantVisuals_structs.hpp"
#include "S_NightLightSetup_structs.hpp"
#include "S_ParticipantLocation_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "EDialogueSystemEmotion_structs.hpp"
#include "E_DialogueCameraPosition_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_DialogueSystemHelper.A_DialogueSystemHelper_C
// 0x03E0 (0x06D0 - 0x02F0)
class AA_DialogueSystemHelper_C final : public ADialogueSystemHelper
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URectLightComponent*                    RectLight;                                         // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    BackLight;                                         // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    FrontLight;                                        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCineCameraComponent*                   CineCamera;                                        // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Head;                                              // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 NoBlend_Skeletal;                                  // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CamSocket;                                         // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Target;                                            // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Center;                                            // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x0340(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Shield_Left;                                       // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Shield_Front;                                      // 0x0350(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Shield_Right;                                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                    FaceLight;                                         // 0x0360(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0368(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Linked_Emotion_NPc_Alpha_9AA62245400FA56F57D9B99E4DE5B526; // 0x0370(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Blend_Linked_Emotion_NPc__Direction_9AA62245400FA56F57D9B99E4DE5B526; // 0x0374(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_375[0x3];                                      // 0x0375(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Blend_Linked_Emotion_NPc;                          // 0x0378(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Linked_Emotion_Milos_Alpha_3C1652B7403438B5A91C27B90F1FB407; // 0x0380(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Blend_Linked_Emotion_Milos__Direction_3C1652B7403438B5A91C27B90F1FB407; // 0x0384(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_385[0x3];                                      // 0x0385(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Blend_Linked_Emotion_Milos;                        // 0x0388(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsWithCorrectPassport;                         // 0x0390(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class AActor*                                 Speaker;                                           // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ActorsInRadiusCollision;                           // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAC_DialogueSystem_C*                   AC_DialogueSystem;                                 // 0x03B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UAudioComponent*                        Sound2D;                                           // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   LevelSequence;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         HiddenCharacters;                                  // 0x03D0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UCameraShakeBase*                       CinematicCameraShake;                              // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class AActor*, struct FTransform>        DefaultLocations;                                  // 0x03E8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class FString, struct FS_ParticipoantVisuals> CurrentVisuals;                               // 0x0438(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class USkeletalMeshComponent*, struct FSingleAnimationPlayData> ReplacingAnims;             // 0x0488(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class AActor*>                         Speakers;                                          // 0x04D8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class FString>                         Levels;                                            // 0x04E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_DayLightSetup>               Day_Light;                                         // 0x04F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FS_NightLightSetup>             Night_Light;                                       // 0x0508(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDialogueAnimationsData*                PlayerIdleData;                                    // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDialogueAnimationsData*                ManIdleData;                                       // 0x0520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDialogueAnimationsData*                WomanIdleData;                                     // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Camera_Position_Index;                             // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_534[0x4];                                      // 0x0534(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Current_Focal_Length;                              // 0x0538(0x0010)(Edit, BlueprintVisible)
	struct FVector                                Array_Element_Participant_Location;                // 0x0548(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance_Cache;                                    // 0x0560(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector4>                       Array_Camera_Positions;                            // 0x0568(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         DistanceDuringDialogue;                            // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        ParticipantTargets;                                // 0x0580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           AutoSkipTimerHandle;                               // 0x0590(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Auto_Rotations_Set;                                // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Auto_Rotations_Distance_Set;                       // 0x0599(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A[0x6];                                      // 0x059A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_ParticipantLocation>         Locations;                                         // 0x05A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Rotations_Valid;                                   // 0x05B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Positions_Valid;                                   // 0x05B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstNode;                                         // 0x05B2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B3[0x5];                                      // 0x05B3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<float>                                 Camera_Rotation_Offset;                            // 0x05B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Changed_Spring_Arm;                                // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Previous_Focused_Participant;                      // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, Interp, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               Previous_Focused_Participant_Rotation;             // 0x05D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	TArray<class AHuman_CH_C*>                    Sorted_Active_Participants;                        // 0x05F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class FName                                   Previous_Focused_Participant_Name;                 // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Target_For_Player;                                 // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Last_Focused_Participant;                          // 0x0610(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Current_Focused_Participant;                       // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_DialoguePositionsHelper_C*          Position_Helper;                                   // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Rotations_from_Dialogue;                           // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x7];                                      // 0x0629(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FSTR_ActorRotation>             ActorsToRotate;                                    // 0x0630(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FRotator                               ActorRotation;                                     // 0x0640(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               Current_Focused_Participant_Rotation;              // 0x0658(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           BlendTimer;                                        // 0x0670(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CameraTimer;                                       // 0x0678(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PositionTimer;                                     // 0x0680(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           PostSetupTimer;                                    // 0x0688(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NPC_No_Dialogue;                                   // 0x0690(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_691[0x7];                                      // 0x0691(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_NoDialogue_Subtitles_C*             NoDialogue_Subtitle;                               // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class APlayer_CH_NewBattle_C*                 Player_Character;                                  // 0x06A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              Camera_Ready;                                      // 0x06A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ULevelSequencePlayer*                   Target_0;                                          // 0x06B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   Sequence_Player;                                   // 0x06C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class ALevelSequenceActor*                    Out_Actor;                                         // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Activate_Movement(bool Activate);
	void AsyncLoadLipsyncForCurrentDialogueStep();
	void Blend_Face_Emotion_Milos(class UAnimInstance* Anim_Instance, bool Linked);
	void Blend_Face_Emotion_NPC(class UAnimInstance* Anim_Instance, bool Linked);
	void Blend_Linked_Emotion_Milos__FinishedFunc();
	void Blend_Linked_Emotion_Milos__UpdateFunc();
	void Blend_Linked_Emotion_NPc__FinishedFunc();
	void Blend_Linked_Emotion_NPc__UpdateFunc();
	void Blocking_Characters_Set_Hidden(bool Hidden);
	double Calculate_CamSocket_Offset();
	void Calculate_Rotations_of_Participants();
	void CalculateCameraLocationOnTarget(const struct FVector& Offset, struct FVector* CameraLocation);
	struct FRotator CalculateCameraRotation(const struct FRotator& AdditionalRotation);
	void CalculateOffsetAndRotationToSelf(const struct FVector& Offset, struct FVector* Location);
	struct FVector CalculatePlayerShoulderOffset(double BehindDistance, double RightOffset, double ZOffset);
	struct FVector CalculateSideCameraPosition(double DistanceFromCenter, double ZOffset, float SideOffset);
	void Call_for_Close_Dialogue();
	double Camera_Rotation_Multiplier(double Camera_Angle);
	void ClearTimer(struct FTimerHandle& Handle);
	void CreateArrayActorsWishCorrectPassport();
	void D_CloseDialogue_Event();
	void DisableTorchOnPlayer();
	void DisablingLipsyncOnAll();
	void Dynamic_Body_Montage(class UObject* Object, TSoftObjectPtr<class UObject> Animation, class UAnimMontage** Montage_to_Play, class AHuman_CH_C** Character);
	void EQTEEmotionToAnimation(EQTE_Emotion Emotion, TSoftClassPtr<class UClass>* EmotionAnimation);
	void ExecuteUbergraph_A_DialogueSystemHelper(int32 EntryPoint);
	void FilteringIdleAnim(class UDialogueAnimationsData* Data, class USkeletalMeshComponent* SkelMesh, TSoftObjectPtr<class UAnimSequence>* IdleAnim);
	void FOVandAngle();
	void Get_ConfigData(bool* RotationOnPlayer, bool* UseCameraOnliForOwner);
	void Get_Keep_Previous_View(bool* KeepCurrentView);
	int32 Get_ParticipantsAmount();
	void Get_WB_Dialogue_System_Screean(class UWB_Menu_Dialogue_C** WB_Dialogue_System_Screean);
	void GetActiveParticipants(TArray<class FString>* ActiveParticipants);
	void GetAnimations(TMap<class FString, struct FS_ParticipoantVisuals>* Visuals);
	void GetAutoSkipSettings(bool* IsAutoSkip, double* AutoSkipTime);
	void GetCameraPresetType(E_DialogueCameraPosition* CameraPosition);
	void GetCurrentTargetEyes(class UObject* ParticipantActor, class AActor** CurrentTarget);
	class AActor* GetFocusedParticipant();
	struct FVector GetHeadSocketLocation(class ACharacter* Character);
	void GetLightSequence(class ULevelSequence** Light_Sequence);
	struct FVector GetNeckSocketLocation(class ACharacter* Character);
	void GetOverrideFocusParticipantName(class FString* OverrideFocusByParticipantName);
	void GetParticipantByName(const class FString& Name_0, class AActor** Actor);
	void GetParticipantsMidPoint(struct FVector* Midpoint);
	void GetParticipantsRotations(TMap<class FString, class FString>* ParticipantsRotations);
	class ABP_DialoguePositionsHelper_C* GetPositionHelper();
	void GetRandomParticipantButThis(class AActor* ExeptThis, class AActor** Participant);
	void GetSequence(class ULevelSequence** Sequence);
	void GetShoulderViewOwnerAndTarget(class AActor** Owner_0, class AActor** Target_0);
	void GetShoulderViewParams(class FString* ShoulderViewOwner);
	void GetSideViewParams(double* SideViewDistance, double* SideViewHeight);
	void GetSound(class USoundWave** Sound);
	void GoNextNode();
	void HandleBodyAnimation(class UObject* Object, TSoftObjectPtr<class UAnimSequence> InputPin, bool l_linc);
	void HandleLipsyncLoaded(const TArray<class UAnimSequenceBase*>& LipsyncAnim, class USoundBase* Sound);
	void Init_HelperFor_Current_Data();
	void Init_HelperFor_Current_Data_NoDialogue();
	bool IsPlayerInFocus();
	void Light_Setup(class ULightComponent* Light, float NewIntensity, float NewTemperature);
	void LinkAnimLayer(class USkeletalMeshComponent* SMesh, TSubclassOf<class UAnimInstance> AnimInstance, bool l_linc);
	void OnAudioEnd();
	void PlaySound();
	void Post_Light_Focus_Camera_Setup();
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void Refresh();
	void ResetBodyAnimations();
	void Rotate_Participants();
	void RotateAllParticipantsToPlayer();
	void Set_Face_Anim_Class_Layer(bool Link, class UObject* Participant, TSoftObjectPtr<class UAnimSequenceBase> LipSync, TSoftClassPtr<class UClass> EmotionAnimation);
	void SetCameraTransform();
	void SetCurrentFocusedParticipantRotation(class UObject* Actor, const struct FRotator& Current_Focused_Participant_Rotation_0);
	void SetParticipantFocus();
	void SetSortedActiveParticipants();
	void SetTargetsForEyes();
	void Setup_Default_Participants_Face_Visual();
	void Setup_Participants_Body_Visuals(bool Link);
	void Setup_Participants_Face_Visuals(bool Link);
	void SetupCameraPosition();
	void SetupPatricipantsTransform();
	bool ShouldHideOtherCharacters();
	void StartDialogueCameraShake();
	void Stop_Dynamic_Body_Montage();
	void StopFaceMontagesRefresh();
	void Teleport_Participants();
	void TimeFixHidenChar(bool hiddenAll);
	void WaitForBlendToFinish();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_DialogueSystemHelper_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_DialogueSystemHelper_C")
	}
	static class AA_DialogueSystemHelper_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_DialogueSystemHelper_C>();
	}
};
DUMPER7_ASSERTS_AA_DialogueSystemHelper_C;

}

