#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_HumanMatrixSpawner

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_HumanMatrixSpawner.A_HumanMatrixSpawner_C
// 0x00A8 (0x0498 - 0x03F0)
class AA_HumanMatrixSpawner_C final : public AHumanMatrixSpawner
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard1;                                        // 0x03F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          Is_Day;                                            // 0x0400(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACH_MatrixHuman_C*                      NPC;                                               // 0x0408(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   Text;                                              // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Show_Info;                                         // 0x0418(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextRenderComponent*                   EmptyError;                                        // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   EmptyError2;                                       // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   EmptyError3;                                       // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ManagerError;                                      // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplineToManager;                                   // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   POIError;                                          // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ProfError;                                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkelMesh;                                          // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(EHumanPOIState State)> StateChanged;                               // 0x0460(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UMatrixDataAsset*                       CurrentSpawnData;                                  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UMatrixDataAsset*>               CurrentDatasets;                                   // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AA_ActionWorkPOI_C*                     ActionWorkPOI;                                     // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLandLoaded;                                      // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x3];                                      // 0x0491(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SpawnInc;                                          // 0x0494(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActionStateChanged(EHumanPOIState State);
	void BindSpeakerOnAction();
	void BindStateWork(EHumanPOIState State);
	void BndEvt__A_HumanMatrixSpawner_SpawnOptimizationComponent_K2Node_ComponentBoundEvent_0_OnCharacterShouldDestroyDelegate__DelegateSignature();
	void BndEvt__A_HumanMatrixSpawner_SpawnOptimizationComponent_K2Node_ComponentBoundEvent_1_OnCharacterShouldRespawnDelegate__DelegateSignature();
	double Custom_Rand_Float();
	void DayNightChanged(bool IsDay);
	void DebugInfo(bool ShowInfo);
	void Destroying();
	void ExecuteUbergraph_A_HumanMatrixSpawner(int32 EntryPoint);
	void Get_Matrix_Char(class ACH_ForestAnimal_C** ForestAnimal, class ACH_VillageAnimal_C** VillageAnimal, class ACH_MatrixHuman_C** Human);
	void GetDesired(struct FVector* Desired);
	void GetHumanSpawner(class AA_HumanMatrixSpawner_C** Spawner);
	void GetPOI(class AA_VillagePOI_C** EatPOI);
	void Init_Day_Night_Controller(bool* Day);
	void InitPoints();
	void LocomotionSettings(class UMatrixDataAsset* SpawnData_0);
	void ReceiveBeginPlay();
	void SetBillboard();
	void SpawnHuman();
	void SpawnWorkStateChanged(EHumanPOIState State);
	void StateSpeakPOI(EHumanPOIState State);
	void StateWorkPOI(EHumanPOIState State);
	void TraceBeforeSpawn(class AActor* Spawner, struct FVector* SpawnLocation);
	void UserConstructionScript();
	void UsingActionPoint(class AA_ActionHumanPOI_C* POI, EHumanPOIState State);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_HumanMatrixSpawner_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_HumanMatrixSpawner_C")
	}
	static class AA_HumanMatrixSpawner_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_HumanMatrixSpawner_C>();
	}
};
DUMPER7_ASSERTS_AA_HumanMatrixSpawner_C;

}

