#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_RangeWeaponProjectile_Knife

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "A_RangeWeaponProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_RangeWeaponProjectile_Knife.A_RangeWeaponProjectile_Knife_C
// 0x0080 (0x04B8 - 0x0438)
class AA_RangeWeaponProjectile_Knife_C final : public AA_RangeWeaponProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_A_RangeWeaponProjectile_Knife_C;    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UInteractionWidgetComponent*            InteractionWidget;                                 // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractionLookOn;                                 // 0x0448(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractionOverlap;                                // 0x0450(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  Interaction;                                       // 0x0458(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RotationSpeed;                                     // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NewEventDispatcher;                                // 0x0468(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShouldRotate;                                      // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_CH_NewBattle_C*                 PlayerRef;                                         // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BloodSplash;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        DamageToActivatedActors;                           // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         PickUpVFX;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraSystem*                         TrailVFX;                                          // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      trail;                                             // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                             DataTableSound;                                    // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__A_RangeWeaponProjectile_Knife_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature(class AActor* InteractedActor);
	void CalculateZVelocity();
	void ChangeToPickUpItem();
	void CheckArmorHit(const struct FHitResult& Hit, bool* Result);
	void ExecuteUbergraph_A_RangeWeaponProjectile_Knife(int32 EntryPoint);
	void GetAngle(const struct FHitResult& Hit, double* Angle);
	void ManageBloodSplash(class AActor* HitActor);
	void ManageProjectilePhysics(class AActor* HitActor);
	void OnActorOverlap(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnProjectileHit(class AActor* Actor, const struct FHitResult& Hit);
	void PlaySoundThrowble(const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void RestoreAmmo(class AActor* Actor);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_RangeWeaponProjectile_Knife_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_RangeWeaponProjectile_Knife_C")
	}
	static class AA_RangeWeaponProjectile_Knife_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_RangeWeaponProjectile_Knife_C>();
	}
};
DUMPER7_ASSERTS_AA_RangeWeaponProjectile_Knife_C;

}

