#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_RangeWeaponProjectile_Axe

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "A_RangeWeaponProjectile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_RangeWeaponProjectile_Axe.A_RangeWeaponProjectile_Axe_C
// 0x0038 (0x0470 - 0x0438)
class AA_RangeWeaponProjectile_Axe_C final : public AA_RangeWeaponProjectile_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_A_RangeWeaponProjectile_Axe_C;      // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	double                                        RotationSpeed;                                     // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              NewEventDispatcher;                                // 0x0448(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          ShouldRotate;                                      // 0x0458(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayer_CH_NewBattle_C*                 PlayerRef;                                         // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BloodSplash;                                       // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_A_RangeWeaponProjectile_Axe(int32 EntryPoint);
	void ManageBloodSplash(class AActor* HitActor);
	void ManageProjectilePhysics(class AActor* HitActor);
	void OnActorOverlap(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void OnProjectileHit(class AActor* Actor, const struct FHitResult& Hit);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_RangeWeaponProjectile_Axe_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_RangeWeaponProjectile_Axe_C")
	}
	static class AA_RangeWeaponProjectile_Axe_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_RangeWeaponProjectile_Axe_C>();
	}
};
DUMPER7_ASSERTS_AA_RangeWeaponProjectile_Axe_C;

}

