#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_SnowAttaching

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "BP_NinjaLive_Snow_FluidSim_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_SnowAttaching.A_SnowAttaching_C
// 0x0028 (0x05A8 - 0x0580)
class AA_SnowAttaching_C final : public ABP_NinjaLive_Snow_FluidSim_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_A_SnowAttaching_C;                  // 0x0580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNiagaraComponent*                      SnowNiagaraEffect;                                 // 0x0588(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBaseAbilitiesComponent*                Abilities_Component;                               // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_IsCold;                                         // 0x0598(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          VisualsEnabled;                                    // 0x05A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCold;                                            // 0x05A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActorLoaded();
	void ActorPreSave();
	void ActorSaved();
	void ComponentsToSave(TArray<class UActorComponent*>* Components);
	void ExecuteUbergraph_A_SnowAttaching(int32 EntryPoint);
	void OnTagChanged_Event(const struct FGameplayTag& UpdatedTag, bool Exists);
	void ReceiveBeginPlay();
	void SetVisualsEnabled(bool NewIsEnabled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_SnowAttaching_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_SnowAttaching_C")
	}
	static class AA_SnowAttaching_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_SnowAttaching_C>();
	}
};
DUMPER7_ASSERTS_AA_SnowAttaching_C;

}

