#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_SphereAmbientSound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_SphereAmbientSound.A_SphereAmbientSound_C
// 0x0050 (0x02E8 - 0x0298)
class AA_SphereAmbientSound_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAudioComponent*                        Audio;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    SoundBillbord;                                     // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundWave>              Sound;                                             // 0x02B8(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                          bPlaying;                                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActorLoaded();
	void ActorPreSave();
	void ActorSaved();
	void ChangeStatus(bool bNewStatus);
	void ComponentsToSave(TArray<class UActorComponent*>* Components);
	void ExecuteUbergraph_A_SphereAmbientSound(int32 EntryPoint);
	void OnLoaded_5BC050974BD4F3FB760B2BAB0F243899(class UObject* Loaded);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_SphereAmbientSound_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_SphereAmbientSound_C")
	}
	static class AA_SphereAmbientSound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_SphereAmbientSound_C>();
	}
};
DUMPER7_ASSERTS_AA_SphereAmbientSound_C;

}

