#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_Stone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "A_Selectable_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_Stone.A_Stone_C
// 0x0050 (0x0300 - 0x02B0)
class AA_Stone_C final : public AA_Selectable_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_A_Stone_C;                          // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Moving_Alpha_F5863B6D419813A0AB3ECD90BED97E2B;     // 0x02C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Moving__Direction_F5863B6D419813A0AB3ECD90BED97E2B; // 0x02C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C5[0x3];                                      // 0x02C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Moving;                                            // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StartPoint;                                        // 0x02D0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                EndPoint;                                          // 0x02E8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_A_Stone(int32 EntryPoint);
	void GetMesh(class UStaticMeshComponent** Mesh);
	void MoveTo(const struct FVector& Target, bool DestroyAtTarget);
	void Moving__FinishedFunc();
	void Moving__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_Stone_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_Stone_C")
	}
	static class AA_Stone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_Stone_C>();
	}
};
DUMPER7_ASSERTS_AA_Stone_C;

}

