#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_ThrowableStone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_ThrowableStone.A_ThrowableStone_C
// 0x0030 (0x02C8 - 0x0298)
class AA_ThrowableStone_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAIPerceptionStimuliSourceComponent*    AIPerceptionStimuliSource;                         // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UProjectileMovementComponent*           ProjectileMovement;                                // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   StoneType;                                         // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_A_ThrowableStone(int32 EntryPoint);
	void GetHitParticles(class UPhysicalMaterial* PhysMat, bool HitCharacter, class UNiagaraSystem** NewParam);
	void PlayHitSound(class UPhysicalMaterial* PhysMat, bool HitCharacter, double HitIntensity);
	void ReceiveBeginPlay();
	void ReceiveHit(class UPrimitiveComponent* MyComp, class AActor* Other, class UPrimitiveComponent* OtherComp, bool bSelfMoved, const struct FVector& HitLocation, const struct FVector& HitNormal, const struct FVector& NormalImpulse, const struct FHitResult& Hit);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_ThrowableStone_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_ThrowableStone_C")
	}
	static class AA_ThrowableStone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_ThrowableStone_C>();
	}
};
DUMPER7_ASSERTS_AA_ThrowableStone_C;

}

