#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_WorkHumanPOI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_WorkHumanPOI.A_WorkHumanPOI_C
// 0x0198 (0x0498 - 0x0300)
class AA_WorkHumanPOI_C final : public AWorkHumanPOI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMulticastInlineDelegate<void(EHumanPOIState State)> StateChanged;                               // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class UMatrixDialogue*>                Bezdelnik;                                         // 0x0318(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Prodavets;                                         // 0x0328(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Povar;                                             // 0x0338(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Sborshchik_Sena;                                   // 0x0348(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Loshadnik;                                         // 0x0358(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Kurnik;                                            // 0x0368(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Plotnik;                                           // 0x0378(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Pryalka;                                           // 0x0388(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Gorshevnica;                                       // 0x0398(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Sobiratel;                                         // 0x03A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Shkuroder;                                         // 0x03B8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Kuznec;                                            // 0x03C8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Prachka;                                           // 0x03D8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Ozhidayushchiy;                                    // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Doyarka;                                           // 0x03F8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Svyashchennik;                                     // 0x0408(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Pyanitsa;                                          // 0x0418(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UMatrixDialogue*>                Dozorniy;                                          // 0x0428(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         CurrentIndexPOI;                                   // 0x0438(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActionWorkPOI*                         CurrentActionWorkPOI;                              // 0x0440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ManagerError;                                      // 0x0448(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   ProfError;                                         // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplineToSpeaker;                                   // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   POIError;                                          // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class USplineComponent*>               SplineToActions;                                   // 0x0468(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UTextRenderComponent*                   EmptyError;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   EmptyError2;                                       // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                   EmptyError3;                                       // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       SplineToAction;                                    // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void DebugInfo(bool ShowInfo);
	void ExecuteUbergraph_A_WorkHumanPOI(int32 EntryPoint);
	void GetActionWorkPOI(class AActionWorkPOI** Array_Element);
	void GetHumanPOI(class AHumanPOI** HumanPOI);
	void UserConstructionScript();
	void WorkStatePOIChanged(EHumanPOIState State);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_WorkHumanPOI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_WorkHumanPOI_C")
	}
	static class AA_WorkHumanPOI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_WorkHumanPOI_C>();
	}
};
DUMPER7_ASSERTS_AA_WorkHumanPOI_C;

}

