#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_ZastavaFlag

#include "Basic.hpp"


namespace SDK::Params
{

// Function A_ZastavaFlag.A_ZastavaFlag_C.BndEvt__A_ZastavaFlag_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct A_ZastavaFlag_C_BndEvt__A_ZastavaFlag_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_A_ZastavaFlag_C_BndEvt__A_ZastavaFlag_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature;

// Function A_ZastavaFlag.A_ZastavaFlag_C.ExecuteUbergraph_A_ZastavaFlag
// 0x0020 (0x0020 - 0x0000)
struct A_ZastavaFlag_C_ExecuteUbergraph_A_ZastavaFlag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedActor;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AA_Zastava_C*                           K2Node_DynamicCast_AsA_Zastava;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_A_ZastavaFlag_C_ExecuteUbergraph_A_ZastavaFlag;

}

