#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: A_ZastavaFlag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass A_ZastavaFlag.A_ZastavaFlag_C
// 0x0038 (0x0330 - 0x02F8)
class AA_ZastavaFlag_C final : public AZastavaFlag
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Rope1;                                             // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Rope;                                              // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_StandWeapons_001;                               // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_QuestMarker_C*                      AC_QuestMarker;                                    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  Interaction;                                       // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Interaction_Sphere;                                // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__A_ZastavaFlag_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature(class AActor* InteractedActor);
	void ExecuteUbergraph_A_ZastavaFlag(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("A_ZastavaFlag_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"A_ZastavaFlag_C")
	}
	static class AA_ZastavaFlag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AA_ZastavaFlag_C>();
	}
};
DUMPER7_ASSERTS_AA_ZastavaFlag_C;

}

