#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_WomanDialogueLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_WomanDialogueLayer_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_WomanDialogueLayer.ABP_WomanDialogueLayer_C
// 0x0320 (0x0670 - 0x0350)
class UABP_WomanDialogueLayer_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_WomanDialogueLayer::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;       // 0x0358(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0370(0x0048)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03B8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0470(0x0020)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0490(0x00D0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0560(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x05A8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0618(0x0020)()
	class UAnimSequenceBase*                      Animation;                                         // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          idle;                                              // 0x0640(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_641[0x7];                                      // 0x0641(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      IdleAnimation;                                     // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UDialogueAnimationsData*                IdleData;                                          // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           BlendTimerHandle;                                  // 0x0658(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         vert;                                              // 0x0660(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Time;                                        // 0x0664(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CastToOwner(class UObject* Object);
	void CustomEvent();
	void ExecuteUbergraph_ABP_WomanDialogueLayer(int32 EntryPoint);
	void OnBlendOut_7057AF50495AB4D1687F788383A4C5BD(class FName NotifyName);
	void OnCompleted_7057AF50495AB4D1687F788383A4C5BD(class FName NotifyName);
	void OnInterrupted_7057AF50495AB4D1687F788383A4C5BD(class FName NotifyName);
	void OnLoaded_631DE0C34B877D046A9CE3BCC2291222(class UObject* Loaded);
	void OnLoaded_80F68C6B4EC5A401BB42FEA06FEC26B6(class UObject* Loaded);
	void OnNotifyBegin_7057AF50495AB4D1687F788383A4C5BD(class FName NotifyName);
	void OnNotifyEnd_7057AF50495AB4D1687F788383A4C5BD(class FName NotifyName);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);
	void Play_Dialogue_Montage(class USkeletalMeshComponent* InSkeletalMeshComponent, class UAnimMontage* MontageToPlay, class AHuman_CH_C* Character);
	void SetDialogueAnimation(TSoftObjectPtr<class UAnimSequence> Input);
	void Stop_Montage(bool Entered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_WomanDialogueLayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_WomanDialogueLayer_C")
	}
	static class UABP_WomanDialogueLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_WomanDialogueLayer_C>();
	}
};
DUMPER7_ASSERTS_UABP_WomanDialogueLayer_C;

}

