#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Sub_Peaceful_Search_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ABP_Sub_Peaceful_Search_Template_structs.hpp"
#include "CommandExtention_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Sub_Peaceful_Search_Template.ABP_Sub_Peaceful_Search_Template_C
// 0x0A30 (0x0EF0 - 0x04C0)
class UABP_Sub_Peaceful_Search_Template_C : public UNPCSubAnimInstance_Peaceful_SearchBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Sub_Peaceful_Search_Template::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x04C8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x04D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04D8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04E0(0x0008)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x04E8(0x0080)()
	struct FAnimNode_RandomPlayerExt              AnimGraphNode_RandomPlayerExt;                     // 0x0568(0x00F0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0658(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0710(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0758(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x07A0(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x07E8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x08D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0900(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0928(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x09A8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x09D0(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x09F8(0x00D0)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x0AC8(0x0110)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0BD8(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0C48(0x0020)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0C68(0x0110)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0D78(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0D98(0x00C8)()
	class UAnimInstance*                          K2Node_PropertyAccess_7;                           // 0x0E60(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 K2Node_PropertyAccess_6;                           // 0x0E68(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_PropertyAccess_4;                           // 0x0E70(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_PropertyAccess_3;                           // 0x0E88(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         AimOffsetDir;                                      // 0x0EA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         UseRightArmAdditive;                               // 0x0EA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseLeftArmAdditive;                                // 0x0EA8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFootPlacementPlantSettings            Plant_Settings;                                    // 0x0EAC(0x0034)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          HeadOrientationEnabled;                            // 0x0EE0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void CustomUpdateAnimation(float DeltaSeconds);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Peaceful_Search_Template_AnimGraphNode_BlendListByBool_01141D084FA454A0046170BE82D64D57();
	void ExecuteUbergraph_ABP_Sub_Peaceful_Search_Template(int32 EntryPoint);
	class UABP_MasterTemplate_C* GetMasterABP();
	class USmutaNPCMovementComponent* GetMovementComp();
	void On_Update_State_Machine(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void PeacefulSearchLocomotion(struct FPoseLink* PeacefulSearchLocomotion_0);
	void SetupBasicSettings();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Sub_Peaceful_Search_Template_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Sub_Peaceful_Search_Template_C")
	}
	static class UABP_Sub_Peaceful_Search_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Sub_Peaceful_Search_Template_C>();
	}
};
DUMPER7_ASSERTS_UABP_Sub_Peaceful_Search_Template_C;

}

