#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPCStrelecFace

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "ABP_NPCStrelecFace_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "LiveLinkAnimationCore_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Enum_VoiceTacticalType_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPCStrelecFace.ABP_NPCStrelecFace_C
// 0x2250 (0x25A0 - 0x0350)
class UABP_NPCStrelecFace_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_NPCStrelecFace::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x0358(0x0003)(HasGetValueTypeHash)
	uint8                                         Pad_35B[0x5];                                      // 0x035B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_PoseBlendNode                AnimGraphNode_PoseBlendNode;                       // 0x0370(0x00D0)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_3;                       // 0x0440(0x0120)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh;                    // 0x0560(0x0158)(ContainsInstancedReference)
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x06B8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0700(0x0048)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_2;                       // 0x0748(0x0120)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve_1;                       // 0x0868(0x0120)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0988(0x00B8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0A40(0x0128)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0B68(0x0120)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0C88(0x0048)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0CD0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0DF8(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0F20(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x1048(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x1170(0x0128)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1298(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x12B8(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1380(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x13A0(0x0128)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x14C8(0x0128)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x15F0(0x0110)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x1700(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x17C8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x1810(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x18D8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1920(0x0048)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose;                        // 0x1968(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x19B0(0x0080)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1A30(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1A50(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1B08(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1B88(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1BB0(0x0028)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1BD8(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1CA0(0x0020)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x1CC0(0x0460)()
	struct FVector                                __CustomProperty_TargetLocation_A849E953485935EDF647D38DBF66F0CD; // 0x2120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_HasTargetActor_A849E953485935EDF647D38DBF66F0CD; // 0x2138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2139[0x3];                                     // 0x2139(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLiveLinkSubjectName                   LLink_Face_Subj;                                   // 0x213C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2144[0x4];                                     // 0x2144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ARKit_HeadRotation;                                // 0x2148(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                        JawOpenAlpha;                                      // 0x2160(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TeethShowAlpha;                                    // 0x2168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LLink_Face_Head;                                   // 0x2170(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2171[0x7];                                     // 0x2171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, double>                     CustomControlValues;                               // 0x2178(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x21C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FTransform                             neck1;                                             // 0x21D0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             neck2;                                             // 0x2230(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Head;                                              // 0x2290(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             spine3;                                            // 0x22F0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             spine2;                                            // 0x2350(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             shoulder_L1;                                       // 0x23B0(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             shoulder_R1;                                       // 0x2410(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      CurrentLipsync;                                    // 0x2470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          ActiveDialogue;                                    // 0x2478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMaleSkeleton;                                    // 0x2479(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_247A[0x6];                                     // 0x247A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 TargetForNPC;                                      // 0x2480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasTarget;                                         // 0x2488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2489[0x7];                                     // 0x2489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CTRL_C_Eye;                                        // 0x2490(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            TargetActor;                                       // 0x24A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            OwnerActor;                                        // 0x24A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Impact_Point;                                      // 0x24B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetActorLocation;                               // 0x24C8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SmallImpactPoint;                                  // 0x24E0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        EyesUpOffset;                                      // 0x24F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vertical;                                          // 0x2500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Has_Target_Actor;                                  // 0x2508(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2509[0x7];                                     // 0x2509(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Target_Location;                                   // 0x2510(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherTarget;                                       // 0x2528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UAnimMontage>>    LightAttack_0;                                     // 0x2530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UAnimMontage>>    Bull_0;                                            // 0x2540(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UAnimMontage>>    HitLight_0;                                        // 0x2550(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UAnimMontage>>    HeavyAttack_0;                                     // 0x2560(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UAnimMontage>>    Death_0;                                           // 0x2570(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UAnimMontage>>    HitHard_0;                                         // 0x2580(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Alpha_Linked_Layer;                                // 0x2590(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseInputPose;                                      // 0x2594(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          SocketEnable;                                      // 0x2595(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void AudioConnectToFace(Enum_VoiceTacticalType Type);
	void BlueprintBeginPlay();
	void BlueprintInitializeAnimation();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void Dialogue_End_Stop_Montage(bool Entered);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyBone_0B883DEC4CF14F6BD5090DA84622EC8C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyBone_4DD273484C577CCCA3743C998BB768EC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyBone_94E5788B41F12DA85AAC5697DC1013D4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyBone_98F302D94BFA39F1EB307F8E884C57B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyBone_B7BE099C4C236EDC991D75AF9284758E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyBone_BE2E03DE4EB093AE24613988873490BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyBone_EA8E51F64B9C714B861ED69B5FC95DE4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCStrelecFace_AnimGraphNode_ModifyCurve_97EB94D446DAB85E8E4E6E8517841FBC();
	void ExecuteUbergraph_ABP_NPCStrelecFace(int32 EntryPoint);
	void GetCustomControls(TMap<class FName, double>* Curves);
	void GetVerticalHeadOffset(double HeadOffset);
	void InitializeSkelMesh(class UObject* Object);
	void OnBlendOut_41B309E84FBE572748EA20990F275A33(class FName NotifyName);
	void OnCompleted_41B309E84FBE572748EA20990F275A33(class FName NotifyName);
	void OnInterrupted_41B309E84FBE572748EA20990F275A33(class FName NotifyName);
	void OnLoaded_67B52CE546BF6779F2A99FA55810A03E(class UObject* Loaded);
	void OnNotifyBegin_41B309E84FBE572748EA20990F275A33(class FName NotifyName);
	void OnNotifyEnd_41B309E84FBE572748EA20990F275A33(class FName NotifyName);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);
	void Play_Dialogue_Montage(class USkeletalMeshComponent* InSkeletalMeshComponent, class UAnimMontage* MontageToPlay, class AHuman_CH_C* Character);
	void Refresh_Stop_Montage();
	void ResetControls();
	void Set_Control(class FName ControlName, double Value, bool* bControlAdded);
	void TransformBone(class USceneComponent* Mesh_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_NPCStrelecFace_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_NPCStrelecFace_C")
	}
	static class UABP_NPCStrelecFace_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NPCStrelecFace_C>();
	}
};
DUMPER7_ASSERTS_UABP_NPCStrelecFace_C;

}

