#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Sub_Peaceful_Flee_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_AnimGraph;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.BlueprintThreadSafeUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_BlueprintThreadSafeUpdateAnimation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_BlueprintThreadSafeUpdateAnimation;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.CustomUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_CustomUpdateAnimation final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_CustomUpdateAnimation;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.ExecuteUbergraph_ABP_Sub_Peaceful_Flee_Template
// 0x0070 (0x0070 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_ExecuteUbergraph_ABP_Sub_Peaceful_Flee_Template final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_MasterTemplate_C*                  CallFunc_GetMasterABP_ReturnValue;                 // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAnimNodeReference                     CallFunc_GetAnimNodeReference_ReturnValue;         // 0x0010(0x0010)(NoDestructor)
	class UABP_MasterTemplate_C*                  CallFunc_GetMasterABP_ReturnValue_1;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EAnimNodeReferenceConversionResult            CallFunc_ConvertToLinkedAnimGraph_Result;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinkedAnimGraphReference              CallFunc_ConvertToLinkedAnimGraph_ReturnValue;     // 0x0030(0x0010)(NoDestructor)
	class UAnimInstance*                          CallFunc_GetLinkedAnimInstance_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_PeacefulStateMachine_C*            K2Node_DynamicCast_AsABP_Peaceful_State_Machine;   // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSlotActive_ReturnValue;                 // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B[0x1];                                       // 0x005B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UABP_MasterTemplate_C*                  CallFunc_GetMasterABP_ReturnValue_2;               // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_ExecuteUbergraph_ABP_Sub_Peaceful_Flee_Template;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.GetMasterABP
// 0x0018 (0x0018 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_GetMasterABP final
{
public:
	class UABP_MasterTemplate_C*                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash)
	class UABP_MasterTemplate_C*                  K2Node_DynamicCast_AsABP_Master_Template;          // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_GetMasterABP;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.GetMovementComp
// 0x0018 (0x0018 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_GetMovementComp final
{
public:
	class USmutaNPCMovementComponent*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USmutaNPCMovementComponent*             K2Node_DynamicCast_AsSmuta_NPCMovement_Component;  // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_GetMovementComp;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.On Update State Machine
// 0x0058 (0x0058 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_On_Update_State_Machine final
{
public:
	struct FAnimUpdateContext                     Context;                                           // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	struct FAnimNodeReference                     Node;                                              // 0x0010(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
	EAnimNodeReferenceConversionResult            CallFunc_ConvertToLinkedAnimGraph_Result;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinkedAnimGraphReference              CallFunc_ConvertToLinkedAnimGraph_ReturnValue;     // 0x0028(0x0010)(NoDestructor)
	class UAnimInstance*                          CallFunc_GetLinkedAnimInstance_ReturnValue;        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_PeacefulStateMachine_C*            K2Node_DynamicCast_AsABP_Peaceful_State_Machine;   // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_On_Update_State_Machine;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.PeacefulFleeLocomotion
// 0x0010 (0x0010 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_PeacefulFleeLocomotion final
{
public:
	struct FPoseLink                              PeacefulFleeLocomotion_0;                          // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_PeacefulFleeLocomotion;

// Function ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C.SetupBasicSettings
// 0x0050 (0x0050 - 0x0000)
struct ABP_Sub_Peaceful_Flee_Template_C_SetupBasicSettings final
{
public:
	struct FRotator                               CallFunc_NormalizedDeltaRotator_ReturnValue;       // 0x0000(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UABP_MasterTemplate_C*                  CallFunc_GetMasterABP_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_FClamp_Value_ImplicitCast;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_AimOffsetDir_ImplicitCast;      // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_Sub_Peaceful_Flee_Template_C_SetupBasicSettings;

}

