#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Sub_Peaceful_Flee_Template

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "ABP_Sub_Peaceful_Flee_Template_structs.hpp"
#include "CommandExtention_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Sub_Peaceful_Flee_Template.ABP_Sub_Peaceful_Flee_Template_C
// 0x0920 (0x0DE0 - 0x04C0)
class UABP_Sub_Peaceful_Flee_Template_C final : public UNPCSubAnimInstance_Peaceful_Flee
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Sub_Peaceful_Flee_Template::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x04C8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x04D8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04E0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04E8(0x0008)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x04F0(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x05C0(0x0070)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0630(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0740(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x07C0(0x0028)()
	struct FAnimNode_RandomPlayerExt              AnimGraphNode_RandomPlayerExt;                     // 0x07E8(0x00F0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x08D8(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x0990(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x09D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0A20(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0A68(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0B58(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0B80(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0BA8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0C28(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0C50(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0C70(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0C90(0x00C8)()
	class UAnimInstance*                          K2Node_PropertyAccess_7;                           // 0x0D58(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 K2Node_PropertyAccess_6;                           // 0x0D60(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_PropertyAccess_4;                           // 0x0D68(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_PropertyAccess_3;                           // 0x0D80(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         AimOffsetDir;                                      // 0x0D98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	float                                         UseRightArmAdditive;                               // 0x0D9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UseLeftArmAdditive;                                // 0x0DA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFootPlacementPlantSettings            Plant_Settings;                                    // 0x0DA4(0x0034)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          HeadOrientationEnabled;                            // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void CustomUpdateAnimation(float DeltaSeconds);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Peaceful_Flee_Template_AnimGraphNode_BlendListByBool_AF416D9F43CD9020632A6880ACE5E9D4();
	void ExecuteUbergraph_ABP_Sub_Peaceful_Flee_Template(int32 EntryPoint);
	class UABP_MasterTemplate_C* GetMasterABP();
	class USmutaNPCMovementComponent* GetMovementComp();
	void On_Update_State_Machine(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void PeacefulFleeLocomotion(struct FPoseLink* PeacefulFleeLocomotion_0);
	void SetupBasicSettings();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Sub_Peaceful_Flee_Template_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Sub_Peaceful_Flee_Template_C")
	}
	static class UABP_Sub_Peaceful_Flee_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Sub_Peaceful_Flee_Template_C>();
	}
};
DUMPER7_ASSERTS_UABP_Sub_Peaceful_Flee_Template_C;

}

