#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MilosSK_NPC_Master

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "ABP_MilosSK_NPC_Master_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "InventorySystemModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MilosSK_NPC_Master.ABP_MilosSK_NPC_Master_C
// 0x1620 (0x1A10 - 0x03F0)
class UABP_MilosSK_NPC_Master_C final : public UFirstPersonAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_MilosSK_NPC_Master::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;       // 0x03F8(0x004C)(HasGetValueTypeHash)
	uint8                                         Pad_444[0x4];                                      // 0x0444(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0448(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0450(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0458(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0478(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0530(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0550(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0618(0x0110)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0728(0x0048)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_1;               // 0x0770(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x07E8(0x00C8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x08B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x08D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0928(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x0950(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x09C0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x09E0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x0A50(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x0AC0(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0B30(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x0B78(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0BC0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x0BE0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0CA8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0CC8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0D10(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0D30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0D58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0D80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0DA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0DD0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0DF8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0E40(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0E60(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0ED0(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0F18(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0FE0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1000(0x0070)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1070(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x10B8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1100(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1120(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1168(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1188(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1250(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1270(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1338(0x00C8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0x1400(0x0078)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x1478(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x1568(0x0040)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x15A8(0x00F0)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x1698(0x0040)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x16D8(0x0080)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1758(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1848(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1890(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x18B8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x18E0(0x0070)()
	bool                                          InBattle;                                          // 0x1950(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRunning;                                         // 0x1951(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1952[0x6];                                     // 0x1952(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ForwardMovement;                                   // 0x1958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightMovement;                                     // 0x1960(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMovement;                                        // 0x1968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          isBlocking;                                        // 0x1969(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_196A[0x6];                                     // 0x196A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BatteMoveSpeed;                                    // 0x1970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BattleMoveDirection;                               // 0x1978(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_197C[0x4];                                     // 0x197C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HeadAngleRotation;                                 // 0x1980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ADefaultCharacter*                      PawnRef;                                           // 0x1988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      BattleRun;                                         // 0x1990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      BattleIdle;                                        // 0x1998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequenceBase*                      BattleIdleToBlock;                                 // 0x19A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UBlendSpace*                            BlockBlend;                                        // 0x19A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      BattleBlock;                                       // 0x19B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          RangeAttack;                                       // 0x19B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          move;                                              // 0x19B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19BA[0x6];                                     // 0x19BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEnemyAggroController*                  PawnAgroComponent;                                 // 0x19C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsFinisher;                                        // 0x19C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHit;                                             // 0x19C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentType                                WeaponType;                                        // 0x19CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRotate;                                          // 0x19CB(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationZ;                                         // 0x19CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalMovementVector;                               // 0x19D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            MovementBlendSpace;                                // 0x19E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<class FName>                           BoneNames;                                         // 0x19E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Right_Angle;                                       // 0x19F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Forward_Angle;                                     // 0x19FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InWarning;                                         // 0x1A00(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CheckMusketandHit(bool* IsMusketAndHit);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_ApplyAdditive_54BDCC9141A390CDEED63E8607D5B093();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_BlendListByBool_6C4DDABF494FC67FB1C6059CE8FEE960();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_BlendListByBool_A3A44B22493EE20A88BFBF881F8F6E8F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_LayeredBoneBlend_2F7571724797016C2214E582E1DB53D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_LayeredBoneBlend_585C02D443BCA4E26015A3AAEE1BA981();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_TransitionResult_0E2018AD48C178D58A55568311FEDACF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_TransitionResult_6396046044F70EE8F8C6FDBB359C3E23();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_TransitionResult_772F520C4D9434FA6F446BAA0BEAA1CA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_TransitionResult_A17786B5471DBFF7C366F9AAA7F90969();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MilosSK_NPC_Master_AnimGraphNode_TransitionResult_A457B3BF4B58261880DC139213B36991();
	void ExecuteUbergraph_ABP_MilosSK_NPC_Master(int32 EntryPoint);
	EEquipmentType GetWeaponType();
	void OnTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);
	void Stop_Montage_on_Refresh();
	void UpdateHeadAngle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_MilosSK_NPC_Master_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_MilosSK_NPC_Master_C")
	}
	static class UABP_MilosSK_NPC_Master_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MilosSK_NPC_Master_C>();
	}
};
DUMPER7_ASSERTS_UABP_MilosSK_NPC_Master_C;

}

