#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerDialogueLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"


namespace SDK::Params
{

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_PlayerDialogueLayer_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_AnimGraph;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_PlayerDialogueLayer_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_BlueprintUpdateAnimation;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.CastToOwner
// 0x0040 (0x0040 - 0x0000)
struct ABP_PlayerDialogueLayer_C_CastToOwner final
{
public:
	class UObject*                                Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            K2Node_DynamicCast_AsHuman_CH;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFirstPersonAnimInstance*               K2Node_DynamicCast_AsFirst_Person_Anim_Instance;   // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UABP_BasicMilosNPC_C*                   K2Node_DynamicCast_AsABP_Basic_Milos_NPC;          // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_vert_ImplicitCast;              // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_CastToOwner;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.ExecuteUbergraph_ABP_PlayerDialogueLayer
// 0x0290 (0x0290 - 0x0000)
struct ABP_PlayerDialogueLayer_C_ExecuteUbergraph_ABP_PlayerDialogueLayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Temp_object_Variable_1;                            // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_DynamicCast_AsAnim_Sequence_1;              // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           K2Node_CustomEvent_Input;                          // 0x0078(0x0028)(HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x00A4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool Entered)>                 K2Node_CreateDelegate_OutputDelegate_2;            // 0x00B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x00C4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMeshComponent*                 K2Node_CustomEvent_InSkeletalMeshComponent;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_MontageToPlay;                  // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            K2Node_CustomEvent_Character;                      // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Entered;                        // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0101(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0102(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_103[0x5];                                      // 0x0103(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_1;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            K2Node_DynamicCast_AsHuman_CH;                     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_4;            // 0x011C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x012C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0134(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          K2Node_CustomEvent_Idle;                           // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          K2Node_CustomEvent_NewParam;                       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 K2Node_CustomEvent_Str;                            // 0x0150(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_TimeSecondsToString_ReturnValue;          // 0x0170(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0180(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0190(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x01A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_6;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x01C8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UAnimSequence>>   CallFunc_Map_Values_Values;                        // 0x01D8(0x0010)(ReferenceParm)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue_2;            // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1F4[0x4];                                      // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHuman_CH_C*                            K2Node_DynamicCast_AsHuman_CH_1;                   // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0x3];                                      // 0x0201(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0204(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           CallFunc_Array_Get_Item;                           // 0x0208(0x0028)(HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USkeletalMesh>           CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0238(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimSequence>           CallFunc_Map_Find_Value;                           // 0x0260(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0288(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_289[0x3];                                      // 0x0289(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_TimeSecondsToString_InSeconds_ImplicitCast; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_ExecuteUbergraph_ABP_PlayerDialogueLayer;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.Log
// 0x0010 (0x0010 - 0x0000)
struct ABP_PlayerDialogueLayer_C_Log final
{
public:
	class FString                                 Str;                                               // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_Log;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OnBlendOut_C03AE08B40E18BDC3A09C2B9BA2BD7CC
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OnBlendOut_C03AE08B40E18BDC3A09C2B9BA2BD7CC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OnBlendOut_C03AE08B40E18BDC3A09C2B9BA2BD7CC;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OnCompleted_C03AE08B40E18BDC3A09C2B9BA2BD7CC
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OnCompleted_C03AE08B40E18BDC3A09C2B9BA2BD7CC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OnCompleted_C03AE08B40E18BDC3A09C2B9BA2BD7CC;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OnInterrupted_C03AE08B40E18BDC3A09C2B9BA2BD7CC
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OnInterrupted_C03AE08B40E18BDC3A09C2B9BA2BD7CC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OnInterrupted_C03AE08B40E18BDC3A09C2B9BA2BD7CC;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OnLoaded_1DA97F66497F181D09DB678D3270236D
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OnLoaded_1DA97F66497F181D09DB678D3270236D final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OnLoaded_1DA97F66497F181D09DB678D3270236D;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OnLoaded_BC512E354C9FFC08C78EECAF28587A3C
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OnLoaded_BC512E354C9FFC08C78EECAF28587A3C final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OnLoaded_BC512E354C9FFC08C78EECAF28587A3C;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OnNotifyBegin_C03AE08B40E18BDC3A09C2B9BA2BD7CC
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OnNotifyBegin_C03AE08B40E18BDC3A09C2B9BA2BD7CC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OnNotifyBegin_C03AE08B40E18BDC3A09C2B9BA2BD7CC;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OnNotifyEnd_C03AE08B40E18BDC3A09C2B9BA2BD7CC
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OnNotifyEnd_C03AE08B40E18BDC3A09C2B9BA2BD7CC final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OnNotifyEnd_C03AE08B40E18BDC3A09C2B9BA2BD7CC;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.OverwritingLayer
// 0x0020 (0x0020 - 0x0000)
struct ABP_PlayerDialogueLayer_C_OverwritingLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              OverwritingLayer_0;                                // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_OverwritingLayer;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.Play Dialogue Montage
// 0x0018 (0x0018 - 0x0000)
struct ABP_PlayerDialogueLayer_C_Play_Dialogue_Montage final
{
public:
	class USkeletalMeshComponent*                 InSkeletalMeshComponent;                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            Character;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_Play_Dialogue_Montage;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.SetBlendSpace
// 0x0010 (0x0010 - 0x0000)
struct ABP_PlayerDialogueLayer_C_SetBlendSpace final
{
public:
	class UBlendSpace*                            Value;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EForceBlendspace                              Temp_byte_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EForceBlendspace                              Temp_byte_Variable_1;                              // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EForceBlendspace                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_SetBlendSpace;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.SetBlendSpaceParam
// 0x0010 (0x0010 - 0x0000)
struct ABP_PlayerDialogueLayer_C_SetBlendSpaceParam final
{
public:
	double                                        X;                                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Y;                                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_SetBlendSpaceParam;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.SetDialogueAnimation
// 0x0028 (0x0028 - 0x0000)
struct ABP_PlayerDialogueLayer_C_SetDialogueAnimation final
{
public:
	TSoftObjectPtr<class UAnimSequence>           Input;                                             // 0x0000(0x0028)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_SetDialogueAnimation;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.SetIdleAnim
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_SetIdleAnim final
{
public:
	class UAnimSequence*                          idle_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_SetIdleAnim;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.SetIdleLoaded
// 0x0008 (0x0008 - 0x0000)
struct ABP_PlayerDialogueLayer_C_SetIdleLoaded final
{
public:
	class UAnimSequence*                          NewParam;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_SetIdleLoaded;

// Function ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C.Stop Montage
// 0x0001 (0x0001 - 0x0000)
struct ABP_PlayerDialogueLayer_C_Stop_Montage final
{
public:
	bool                                          Entered;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_PlayerDialogueLayer_C_Stop_Montage;

}

