#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Persecution

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "EPOIType_structs.hpp"
#include "ABP_Persecution_structs.hpp"
#include "Smuta_classes.hpp"
#include "EAnimPersecutionState_structs.hpp"
#include "StatesNPC_structs.hpp"
#include "NPC_InteractPoint_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Persecution.ABP_Persecution_C
// 0x0A30 (0x0DF0 - 0x03C0)
class UABP_Persecution_C final : public UBaseAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Persecution::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x03C8(0x001C)(HasGetValueTypeHash)
	uint8                                         Pad_3E4[0x4];                                      // 0x03E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x03F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0418(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x04D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x04F0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x05A8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x05C8(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0638(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0700(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07B8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x07D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0828(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0850(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x08A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x08C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x08F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0990(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x09B8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0A28(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0A48(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0A90(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0AB0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0B20(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0B40(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0BB0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0BD0(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0C98(0x0110)()
	bool                                          RightStep;                                         // 0x0DA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit_React;                                         // 0x0DA9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatesNPC                                    States;                                            // 0x0DAA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DAB[0x5];                                      // 0x0DAB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPOIType>                              POI_Type;                                          // 0x0DB0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ENPC_InteractPoint                            NPC_Interact;                                      // 0x0DC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC1[0x3];                                      // 0x0DC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationIdleZ;                                     // 0x0DC4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAnimPersecutionState                         AnimState;                                         // 0x0DC8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC9[0x7];                                      // 0x0DC9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_CH_C*                              NPC;                                               // 0x0DD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterMovementComponent*            Character_Movement;                                // 0x0DD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         Speed;                                             // 0x0DE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x0DE4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsKirsha_;                                         // 0x0DE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_an_tpc_footstep_left();
	void AnimNotify_an_tpc_footstep_right();
	void AnimNotify_HitReactEnd();
	void AnimNotify_L_step();
	void AnimNotify_R_step();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_BlendSpacePlayer_6FAE13E94449E4F79420788AC1D05F0D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_2221FE384EA4DDBFE868AB9FE1BD3947();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_2306601945E8098C47F9D5B9E1B756FB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_48F9FA1F459EA39190C66F897D418A48();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_537C0D3149CB0092843CE1A539245411();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_5DD70678400ED754F3950FAC0E1B3E40();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_7052403E4B77B1B76AB4E1A006F79C88();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_725049734E22A2F55014D7B293862EF9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_891079EF430977D8D9D113B8E280E1AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_A3DC55D04AB63B5642A29FA03CB1A839();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_AA8644DC4868027EAFBAB794147D0973();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_CDB89D74419B42CD4B9BCF9EC39D85AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Persecution_AnimGraphNode_TransitionResult_E5A3796D4227795F9EB4D3A1CB14C25A();
	void ExecuteUbergraph_ABP_Persecution(int32 EntryPoint);
	void HitResponse(const struct FPoseLink& InPose, struct FPoseLink* HitResponse_0);
	void LookAt(const struct FPoseLink& InPose, struct FPoseLink* LookAt_0);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Persecution_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Persecution_C")
	}
	static class UABP_Persecution_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Persecution_C>();
	}
};
DUMPER7_ASSERTS_UABP_Persecution_C;

}

