#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Sub_Battle_Template

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "InventorySystemModule_structs.hpp"
#include "ABP_Sub_Battle_Template_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "F_TurnAnimations_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Sub_Battle_Template.ABP_Sub_Battle_Template_C
// 0x1FC0 (0x23B0 - 0x03F0)
class UABP_Sub_Battle_Template_C : public UNPCSubAnimInstance_BattleBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Sub_Battle_Template::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x03F8(0x0024)(HasGetValueTypeHash)
	uint8                                         Pad_41C[0x4];                                      // 0x041C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0420(0x0008)()
	struct FAnimSubsystemInstance_NodeRelevancy   AnimBlueprintExtension_NodeRelevancy;              // 0x0428(0x00A8)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04D0(0x0008)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x04D8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x0520(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x05A0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x05C8(0x0028)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_2;                   // 0x05F0(0x0110)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x0700(0x00D0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x07D0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x0818(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x0898(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x08C0(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x0988(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x09B0(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0A20(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0A40(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0B20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0B70(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0B98(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x0BB8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0BE0(0x0020)()
	struct FAnimNode_ModifyCurve                  AnimGraphNode_ModifyCurve;                         // 0x0C00(0x0120)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0D20(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0D68(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x0D88(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0DB0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x0DD0(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x0E98(0x0080)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x0F18(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x1028(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x1050(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x1140(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1160(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x11A8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x11F0(0x0080)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1270(0x00B8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1328(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x1370(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x13F0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1418(0x0070)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1488(0x0080)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x1508(0x0110)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1618(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x1660(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x1688(0x00F0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x1778(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x17A0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x17C8(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1838(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1880(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x18A0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1968(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x19B0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x19F8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1A40(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1A60(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x1B28(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x1B50(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1C40(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x1CC0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x1CE8(0x0028)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x1D10(0x00D0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x1DE0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x1E08(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x1E30(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x1F20(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1F48(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1F70(0x0020)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1F90(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1FD8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2000(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x20F0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2110(0x00C8)()
	bool                                          __CustomProperty_bIsDefence_E7B8BD3D499338CF4909D9AE785BAF77; // 0x21D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_22;                          // 0x21D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21DA[0x6];                                     // 0x21DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPawnMovementComponent*                 K2Node_PropertyAccess_21;                          // 0x21E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_PropertyAccess_20;                          // 0x21E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_PropertyAccess_19;                          // 0x2200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_PropertyAccess_18;                          // 0x2218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_PropertyAccess_15;                          // 0x2230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_PropertyAccess_14;                          // 0x2238(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_PropertyAccess_12;                          // 0x2250(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APawn*                                  K2Node_PropertyAccess_11;                          // 0x2268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          K2Node_PropertyAccess_10;                          // 0x2270(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_PropertyAccess_8;                           // 0x2278(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_PropertyAccess_7;                           // 0x2290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_PropertyAccess_6;                           // 0x22A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                K2Node_PropertyAccess_5;                           // 0x22C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDefence;                                        // 0x22D8(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22D9[0x7];                                     // 0x22D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBlendSpace*                            MovementBlendSpace;                                // 0x22E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAnimSequence*                          BlockAS;                                           // 0x22E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BlockBS;                                           // 0x22F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          DefaultIdleAS;                                     // 0x22F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          DominantIdleAS;                                    // 0x2300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BodyTurnBS;                                        // 0x2308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          bIsAcceletation;                                   // 0x2310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2311[0x7];                                     // 0x2311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Speed;                                             // 0x2318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x2320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2324[0x4];                                     // 0x2324(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FF_TurnAnimations                      TurnAnimations;                                    // 0x2328(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               StartRotation;                                     // 0x2348(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          InTurn;                                            // 0x2360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2361[0x7];                                     // 0x2361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeToTurn;                                        // 0x2368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFootPlacementPlantSettings            Plant_Settings;                                    // 0x2370(0x0034)(Edit, BlueprintVisible, NoDestructor)
	EEquipmentDefenceStyle                        DefenceStyle;                                      // 0x23A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23A5[0x3];                                     // 0x23A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         HeadAngleVertical;                                 // 0x23A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BattleLocomotion(struct FPoseLink* BattleLocomotion_0);
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	struct FVector2D Calculate_Local_Movement();
	void CustomUpdateAnimation(float DeltaSeconds);
	void DefencePose(const struct FPoseLink& BasePose, bool bIsDefence_0, struct FPoseLink* DefencePose_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Battle_Template_AnimGraphNode_BlendListByBool_2949D9E74FE65C3E6D1129A7825CC7BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Battle_Template_AnimGraphNode_TransitionResult_19144BB04C8A8F858AECAD89F0DE47CD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Battle_Template_AnimGraphNode_TransitionResult_567ECD974E1B13687D692B978162854C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Battle_Template_AnimGraphNode_TransitionResult_674891084F7D007C96EC1B8E186E640D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Battle_Template_AnimGraphNode_TransitionResult_81C751484C90B40F49D016B4C832B494();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_Sub_Battle_Template_AnimGraphNode_TransitionResult_8F77BB55449A0DE298E53794326F8825();
	void ExecuteUbergraph_ABP_Sub_Battle_Template(int32 EntryPoint);
	class ANPC_CH_NewBattleSystem_C* Get_Owner_Character();
	double Get_Turn_Direction();
	class UABP_MasterTemplate_C* GetMasterABP();
	class USmutaNPCMovementComponent* GetMovementComp();
	void On_Turn_Exit(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void On_Turn_Start(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void On_Turn_State_Exit(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void OnBecomeRelevant(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void OnUpdate(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void RotateOnTurnInPlace();
	void Setup_Movement_Blend_Space(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void Setup_Turn_Anims(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void TurnInPlace(const struct FPoseLink& InPose, struct FPoseLink* TurnInPlace_0);
	void Update_Direction(double Angle);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Sub_Battle_Template_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Sub_Battle_Template_C")
	}
	static class UABP_Sub_Battle_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Sub_Battle_Template_C>();
	}
};
DUMPER7_ASSERTS_UABP_Sub_Battle_Template_C;

}

