#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SK_LowerBody

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_SK_LowerBody.ABP_SK_LowerBody_C
// 0x0160 (0x04B0 - 0x0350)
class UABP_SK_LowerBody_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0358(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0360(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0368(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0388(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0440(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0488(0x0020)()

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void ExecuteUbergraph_ABP_SK_LowerBody(int32 EntryPoint);
	void LowerBody(const struct FPoseLink& InPose, struct FPoseLink* LowerBody_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_SK_LowerBody_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_SK_LowerBody_C")
	}
	static class UABP_SK_LowerBody_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_SK_LowerBody_C>();
	}
};
DUMPER7_ASSERTS_UABP_SK_LowerBody_C;

}

