#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPCQTELayer

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "ABP_NPCQTELayer_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Smuta_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPCQTELayer.ABP_NPCQTELayer_C
// 0x06B0 (0x0A00 - 0x0350)
class UABP_NPCQTELayer_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_NPCQTELayer::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;              // 0x0358(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0370(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0378(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0380(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A0(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0458(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x04A0(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0570(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x05E0(0x0070)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0650(0x0048)()
	uint8                                         Pad_698[0x8];                                      // 0x0698(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik;                              // 0x06A0(0x01F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0890(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08B0(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x08D0(0x0048)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0918(0x0020)()
	class UAnimSequenceBase*                      Animation;                                         // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          idle;                                              // 0x0940(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_941[0x7];                                      // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BlendTimerHandle;                                  // 0x0948(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDialogueAnimationsData*                IdleData;                                          // 0x0950(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      IdleAnimation;                                     // 0x0958(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         vert;                                              // 0x0960(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Time;                                        // 0x0964(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EForceBlendspace                              ForceBlendSpace;                                   // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_969[0x7];                                      // 0x0969(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BlendSpaceX;                                       // 0x0970(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpaceY;                                       // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BlendSpace;                                        // 0x0980(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomIdleAnimation;                               // 0x0988(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_989[0x7];                                      // 0x0989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewVar;                                            // 0x0990(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            As_Human_CH;                                       // 0x09F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CastToOwner(class UObject* Object);
	void CustomEvent();
	void ExecuteUbergraph_ABP_NPCQTELayer(int32 EntryPoint);
	void GetBoneTransform();
	void OnBlendOut_C1D81A1B4F13365A905A70B0DDA0068F(class FName NotifyName);
	void OnCompleted_C1D81A1B4F13365A905A70B0DDA0068F(class FName NotifyName);
	void OnInterrupted_C1D81A1B4F13365A905A70B0DDA0068F(class FName NotifyName);
	void OnLoaded_95DBF1A84CEC183433C3FFB252C26529(class UObject* Loaded);
	void OnLoaded_EC2311CA45D93D4B74D3109823FBF6D2(class UObject* Loaded);
	void OnNotifyBegin_C1D81A1B4F13365A905A70B0DDA0068F(class FName NotifyName);
	void OnNotifyEnd_C1D81A1B4F13365A905A70B0DDA0068F(class FName NotifyName);
	void Play_Dialogue_Montage(class USkeletalMeshComponent* InSkeletalMeshComponent, class UAnimMontage* MontageToPlay, class AHuman_CH_C* Character);
	void QTE(const struct FPoseLink& InPose, struct FPoseLink* QTE_0);
	void SetBlendSpace(class UBlendSpace* Value);
	void SetBlendSpaceParam(double X, double Y);
	void SetDialogueAnimation(TSoftObjectPtr<class UAnimSequence> Input);
	void SetIdleAnim(class UAnimSequence* idle_0);
	void SetIdleLoaded(class UAnimSequence* idle_0);
	void Stop_Montage(bool Entered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_NPCQTELayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_NPCQTELayer_C")
	}
	static class UABP_NPCQTELayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NPCQTELayer_C>();
	}
};
DUMPER7_ASSERTS_UABP_NPCQTELayer_C;

}

