#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_WomanPeasant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPC_InteractPoint_structs.hpp"
#include "ABP_WomanPeasant_structs.hpp"
#include "StatesNPC_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "EPOIType_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_WomanPeasant.ABP_WomanPeasant_C
// 0x1750 (0x1B10 - 0x03C0)
class UABP_WomanPeasant_C final : public UBaseAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_WomanPeasant::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x03C8(0x000C)(HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03D8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03E0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x03E8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0408(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x04C0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x04E0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0598(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x05B8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0670(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x0690(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x06B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x06E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x0708(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x0730(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x0758(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0780(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x07A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x07D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x07F8(0x0028)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x0820(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0x0898(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x08B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x08E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0908(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0930(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0958(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0980(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x09A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x09D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x09F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0A20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0A48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0A70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0A98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0AC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0AE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0B10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0B38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0B60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0B88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0BB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0BD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0C00(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_14;                   // 0x0C28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x0C70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0C90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x0CD8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x0CF8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x0D40(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x0D60(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x0DA8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0DC8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x0E10(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0E30(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x0E78(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0E98(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0EE0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0F00(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0F48(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0F68(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0FB0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0FD0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1018(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x1038(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1080(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x10A0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1110(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1130(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x11F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x1218(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1260(0x0020)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x1280(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x12F8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1318(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1360(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1380(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x13C8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1410(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x1458(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1478(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x1540(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x1560(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x1628(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x16F0(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x17B8(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x18C8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1948(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1970(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1A60(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1A88(0x0048)()
	bool                                          RightStep;                                         // 0x1AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit_React;                                         // 0x1AD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatesNPC                                    States;                                            // 0x1AD2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AD3[0x5];                                     // 0x1AD3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPOIType>                              POI_Type;                                          // 0x1AD8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ENPC_InteractPoint                            NPC_Interact;                                      // 0x1AE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AE9[0x3];                                     // 0x1AE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationIdleZ;                                     // 0x1AEC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vertical;                                          // 0x1AF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           BoneNames;                                         // 0x1AF8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Right_Angle;                                       // 0x1B08(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Forward_Angle;                                     // 0x1B0C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_an_tpc_footstep_left();
	void AnimNotify_an_tpc_footstep_right();
	void AnimNotify_HitReactEnd();
	void AnimNotify_L_step();
	void AnimNotify_R_step();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_BlendListByBool_2816DEC54ACDEB665A4C859EB65732B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_0158A6834F95B0E998B90AB2488ED662();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_03FCDEF24F38F8FCE9CC1080C5402BB0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_1084B0B54C89CECB69FCEC9880873B6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_12B9778C463885586170D1A809C93284();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_13E9B9C1405CB5B26F8499910EDF92EC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_16A1960E44D4E478CF32B487FADD5C63();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_26FA538C442485BF9DB4049696BDD5BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_33CFF0424F76C4ACBAFCBCBAD6D5F258();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_35DB5D2F42986857EBE217A05E92712C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_3952A4E24F36BF41959D9A8C5A1EFA63();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_3CADC00742422B1972AA8D817D819C89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_51353BF94CC4E980ADB559B116DD41A9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_517E7A884D5034891C77EB89CC6F32BC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_547A8C534B06DD98199B518B3F398D64();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_62019D65402769117656FDA8A435E033();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_690859D542467A52978769BEC236E55A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_6B68797A44F49E129C500BBEF6FB43B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_70861A7440A13EC37DD34693A3978711();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_70B36118485CAE9D72D496B6F44EFC23();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_712C7AD94B7270A8C0C2A38F87B29BDF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_741116B748B521346F95BCBA4904A557();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_876021FA44DEBED37CC0DFBFECBB637F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_8EB454D345BAF19E1C87B68F6CDB939E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_CFE4B35D48EF93F11ABAB5B15BE7ED3D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_DF459E1449AE9ACC0089C983B582F1AA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_E3B94FA545A3E615E837A9B9B02D1588();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_E928EAD847138D9B4CBCCE85129820AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_EFC00108445B131CB1A2C5929AF23667();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_EFE29092409026D45D5447A965FE8BED();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_F0194D7146FD3941C2E6EA851D869258();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_F214C83247F0184E205709B9D908ACE0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_WomanPeasant_AnimGraphNode_TransitionResult_FB834A824A9CDCD4600F12B4F1B969E8();
	void ExecuteUbergraph_ABP_WomanPeasant(int32 EntryPoint);
	void HitResponse(const struct FPoseLink& InPose, struct FPoseLink* HitResponse_0);
	void LookAt(const struct FPoseLink& InPose, struct FPoseLink* LookAt_0);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_WomanPeasant_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_WomanPeasant_C")
	}
	static class UABP_WomanPeasant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_WomanPeasant_C>();
	}
};
DUMPER7_ASSERTS_UABP_WomanPeasant_C;

}

