#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_PlayerDialogueLayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ABP_PlayerDialogueLayer_structs.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_PlayerDialogueLayer.ABP_PlayerDialogueLayer_C
// 0x0420 (0x0770 - 0x0350)
class UABP_PlayerDialogueLayer_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_PlayerDialogueLayer::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;      // 0x0358(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0370(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0378(0x0008)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0380(0x0070)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03F0(0x00B8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x04A8(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x04F0(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0538(0x00D0)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0608(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0628(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0670(0x0070)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06E0(0x0020)()
	class UAnimSequenceBase*                      Animation;                                         // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         vert;                                              // 0x0708(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_70C[0x4];                                      // 0x070C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BlendTimerHandle;                                  // 0x0710(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          idle;                                              // 0x0718(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_719[0x7];                                      // 0x0719(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      IdleAnimation;                                     // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UDialogueAnimationsData*                IdleData;                                          // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Time;                                        // 0x0730(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_734[0x4];                                      // 0x0734(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AA_DialogueSystemHelper_C*              Dialogue_Helper;                                   // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EForceBlendspace                              ForceBlendSpace;                                   // 0x0740(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_741[0x7];                                      // 0x0741(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BlendSpaceX;                                       // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpaceY;                                       // 0x0750(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BlendSpace;                                        // 0x0758(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomIdleAnimation;                               // 0x0760(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CastToOwner(class UObject* Object);
	void CustomEvent();
	void ExecuteUbergraph_ABP_PlayerDialogueLayer(int32 EntryPoint);
	void Log(const class FString& Str);
	void OnBlendOut_C03AE08B40E18BDC3A09C2B9BA2BD7CC(class FName NotifyName);
	void OnCompleted_C03AE08B40E18BDC3A09C2B9BA2BD7CC(class FName NotifyName);
	void OnInterrupted_C03AE08B40E18BDC3A09C2B9BA2BD7CC(class FName NotifyName);
	void OnLoaded_1DA97F66497F181D09DB678D3270236D(class UObject* Loaded);
	void OnLoaded_BC512E354C9FFC08C78EECAF28587A3C(class UObject* Loaded);
	void OnNotifyBegin_C03AE08B40E18BDC3A09C2B9BA2BD7CC(class FName NotifyName);
	void OnNotifyEnd_C03AE08B40E18BDC3A09C2B9BA2BD7CC(class FName NotifyName);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);
	void Play_Dialogue_Montage(class USkeletalMeshComponent* InSkeletalMeshComponent, class UAnimMontage* MontageToPlay, class AHuman_CH_C* Character);
	void SetBlendSpace(class UBlendSpace* Value);
	void SetBlendSpaceParam(double X, double Y);
	void SetDialogueAnimation(TSoftObjectPtr<class UAnimSequence> Input);
	void SetIdleAnim(class UAnimSequence* idle_0);
	void SetIdleLoaded(class UAnimSequence* NewParam);
	void Stop_Montage(bool Entered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_PlayerDialogueLayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_PlayerDialogueLayer_C")
	}
	static class UABP_PlayerDialogueLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_PlayerDialogueLayer_C>();
	}
};
DUMPER7_ASSERTS_UABP_PlayerDialogueLayer_C;

}

