#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_Sub_Peaceful_Calm_Template

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "CommandExtention_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "ABP_Sub_Peaceful_Calm_Template_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_Sub_Peaceful_Calm_Template.ABP_Sub_Peaceful_Calm_Template_C
// 0x0770 (0x0C30 - 0x04C0)
class UABP_Sub_Peaceful_Calm_Template_C : public UNPCSubAnimInstance_Peaceful_CalmBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_Sub_Peaceful_Calm_Template::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x04C8(0x0008)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x04D0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04D8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04E0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x04E8(0x0020)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x0508(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x05D8(0x0070)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0648(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0758(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x07D8(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x0800(0x00B8)()
	struct FAnimNode_RandomPlayerExt              AnimGraphNode_RandomPlayerExt;                     // 0x08B8(0x00F0)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x09A8(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0A98(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0AC0(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x0AE0(0x00C8)()
	class UAnimInstance*                          K2Node_PropertyAccess_9;                           // 0x0BA8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPawnMovementComponent*                 K2Node_PropertyAccess_8;                           // 0x0BB0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               K2Node_PropertyAccess_6;                           // 0x0BB8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               K2Node_PropertyAccess_5;                           // 0x0BD0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         AimOffsetDir;                                      // 0x0BE8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	struct FFootPlacementPlantSettings            Plant_Settings;                                    // 0x0BEC(0x0034)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          HeadOrientationEnabled;                            // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CustomUpdateAnimation(float DeltaSeconds);
	void ExecuteUbergraph_ABP_Sub_Peaceful_Calm_Template(int32 EntryPoint);
	class UABP_MasterTemplate_C* GetMasterABP();
	class USmutaNPCMovementComponent* GetMovementComp();
	void On_Update_State_Machine(const struct FAnimUpdateContext& Context, const struct FAnimNodeReference& Node);
	void PeacefulCalmLocomotion(struct FPoseLink* PeacefulCalmLocomotion_0);
	void SetupBasicSettings();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_Sub_Peaceful_Calm_Template_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_Sub_Peaceful_Calm_Template_C")
	}
	static class UABP_Sub_Peaceful_Calm_Template_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_Sub_Peaceful_Calm_Template_C>();
	}
};
DUMPER7_ASSERTS_UABP_Sub_Peaceful_Calm_Template_C;

}

