#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_MasterTemplate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimationWarpingRuntime_structs.hpp"
#include "ABP_MasterTemplate_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "ControlRig_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_MasterTemplate.ABP_MasterTemplate_C
// 0x4010 (0x4450 - 0x0440)
class UABP_MasterTemplate_C : public UNPCMasterAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_MasterTemplate::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;           // 0x0448(0x000A)(HasGetValueTypeHash)
	uint8                                         Pad_452[0x6];                                      // 0x0452(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Tag;                        // 0x0458(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0460(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0468(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_9;                              // 0x0470(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x0490(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_8;                              // 0x0548(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_7;                              // 0x0568(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_6;                              // 0x0588(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_3;                   // 0x05A8(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_5;                              // 0x0660(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0680(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_4;                              // 0x0738(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x0758(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x0778(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0798(0x00B8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_7;                  // 0x0850(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x0940(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x0988(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x09D0(0x00D0)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive_1;               // 0x0AA0(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_37;                    // 0x0AD8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_36;                    // 0x0B00(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_15;                   // 0x0B28(0x0080)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0BA8(0x00C8)()
	struct FAnimNode_MakeDynamicAdditive          AnimGraphNode_MakeDynamicAdditive;                 // 0x0C70(0x0038)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_35;                    // 0x0CA8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_34;                    // 0x0CD0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_14;                   // 0x0CF8(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_13;                   // 0x0D78(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_12;                   // 0x0DF8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_33;                    // 0x0E78(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_32;                    // 0x0EA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_31;                    // 0x0EC8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_30;                    // 0x0EF0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x0F18(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_29;                    // 0x0F60(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_28;                    // 0x0F88(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_11;                   // 0x0FB0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_27;                    // 0x1030(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1058(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x10A0(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x10E8(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_6;                  // 0x1130(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_26;                    // 0x1220(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1248(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1268(0x00B8)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_10;                             // 0x1320(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_10;                   // 0x1368(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0x13E8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_25;                    // 0x1430(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_5;                  // 0x1458(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0x1548(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_24;                    // 0x1590(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_23;                    // 0x15B8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x15E0(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x1628(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x1670(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_22;                    // 0x16B8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0x16E0(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_9;                    // 0x1728(0x0080)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0x17A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_21;                    // 0x17F0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_8;                    // 0x1818(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_20;                    // 0x1898(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_19;                    // 0x18C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_18;                    // 0x18E8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_5;                              // 0x1910(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_5;                   // 0x1958(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_7;                    // 0x1A68(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_17;                    // 0x1AE8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_6;                    // 0x1B10(0x0080)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_4;                   // 0x1B90(0x0110)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_16;                    // 0x1CA0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_15;                    // 0x1CC8(0x0028)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_3;                   // 0x1CF0(0x0110)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_4;                              // 0x1E00(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_4;                  // 0x1E48(0x00F0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1F38(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_3;                              // 0x1F80(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_14;                    // 0x1FC8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0x1FF0(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_2;                              // 0x20E0(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_8;                   // 0x2128(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_13;                    // 0x21F0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_5;                    // 0x2218(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_12;                    // 0x2298(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_11;                    // 0x22C0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_10;                    // 0x22E8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_4;                    // 0x2310(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9;                     // 0x2390(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8;                     // 0x23B8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_7;                     // 0x23E0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x2408(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_3;                    // 0x2450(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_6;                     // 0x24D0(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x24F8(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x25E8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2608(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2630(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x2658(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x2680(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_7;                   // 0x26A8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2770(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_6;                   // 0x2790(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2858(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_5;                   // 0x2878(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2940(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_4;                   // 0x2960(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2A28(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x2A48(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_3;                   // 0x2B10(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_2;                    // 0x2BD8(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_5;                     // 0x2C58(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x2C80(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x2D70(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2DB8(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x2DE0(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x2E60(0x0028)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_2;                   // 0x2E88(0x0110)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2F98(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x3088(0x0028)()
	struct FAnimNode_StrideWarping                AnimGraphNode_StrideWarping;                       // 0x30B0(0x0248)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x32F8(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3318(0x0020)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK;                               // 0x3338(0x00F8)()
	struct FAnimNode_FootPlacement                AnimGraphNode_FootPlacement;                       // 0x3430(0x0410)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_2;                   // 0x3840(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x3908(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x3988(0x0028)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x39B0(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x3A78(0x0110)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x3B88(0x0110)()
	struct FAnimNode_ControlRig                   AnimGraphNode_ControlRig;                          // 0x3C98(0x0460)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x40F8(0x0048)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x4140(0x00C8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4208(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4230(0x0048)()
	bool                                          MeshSpace;                                         // 0x4278(0x0001)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4279[0x7];                                     // 0x4279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             K2Node_PropertyAccess_7;                           // 0x4280(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_PropertyAccess_6;                           // 0x42E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          __CustomProperty_MeshSpace_CFF4DE9A41BD54DE643DF78E00D4D3AB; // 0x42F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_42F9[0x7];                                     // 0x42F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_PropertyAccess_5;                           // 0x4300(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                __CustomProperty_LookAtLocationTarget_764E39344A11801D42BC6EBF409E594C; // 0x4318(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_PropertyAccess_4;                           // 0x4330(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_PropertyAccess_3;                           // 0x4338(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ERootMotionMode                               K2Node_PropertyAccess_2;                           // 0x4350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4351[0x7];                                     // 0x4351(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_PropertyAccess_1;                           // 0x4358(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess;                             // 0x4370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4371[0x7];                                     // 0x4371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 SubInstance_Peaceful_Calm;                         // 0x4378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SubInstance_Peaceful_Search;                       // 0x4380(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SubInstance_Battle;                                // 0x4388(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        UpperBodyBlend;                                    // 0x4390(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        LowerBodyBlend;                                    // 0x4398(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 LowerBody_AI;                                      // 0x43A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Speed2D;                                           // 0x43A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                StrideDirection;                                   // 0x43B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Leg_IK_Alpha;                                      // 0x43C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsActiveIK;                                       // 0x43D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43D1[0x3];                                     // 0x43D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFootPlacementPlantSettings            Plant_Settings;                                    // 0x43D4(0x0034)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bIsGunner;                                         // 0x4408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsBattleDefaultSlot;                              // 0x4409(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsSearchDefaultSlot;                              // 0x440A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsHeadIK_Enabled;                                 // 0x440B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_440C[0x4];                                     // 0x440C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FocalPoint;                                        // 0x4410(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FocalPointIsActor;                                 // 0x4428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseUpperBodyOnCalm;                                // 0x4429(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_442A[0x6];                                     // 0x442A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          BothAdditive;                                      // 0x4430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          LeftAdditive;                                      // 0x4438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          RightAdditive;                                     // 0x4440(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BattleLocomotion(struct FPoseLink* BattleLocomotion_0);
	void BlueprintBeginPlay();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EquipmentAdditiveLayer(const struct FPoseLink& InPose_0, bool MeshSpace_0, struct FPoseLink* EquipmentAdditiveLayer_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_BlendListByBool_52813D4D48DED6E03537E18053F5FF28();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_BlendListByBool_9FA3FC194688EC8B43FBD1974825F901();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_BlendListByBool_CD884B23404FFC8958AADCAF74DDC496();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_LayeredBoneBlend_04D1BFA4460483887D8EEF974246B9BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_LayeredBoneBlend_C4F914D0443099BA8E5F64888F96B9B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_TransitionResult_0248D1C24B0A37C82A3EA8AA0F275CF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_TransitionResult_4B1F69DD404F5AAC35054EB19C78B184();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_TransitionResult_809847A3412DF13E0DD48CB02FA8A9D3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_MasterTemplate_AnimGraphNode_TransitionResult_E4D1614F4B5F8DD243A0408F794F5F9B();
	void ExecuteUbergraph_ABP_MasterTemplate(int32 EntryPoint);
	void GetDamageTargets(bool FriendlyFire, TArray<class AActor*>* ActorsHit);
	void LowerBody(const struct FPoseLink& InPose, struct FPoseLink* LowerBody_0);
	void MontageSlotsLayer(const struct FPoseLink& InPose, struct FPoseLink* MontageSlotsLayer_0);
	void OnDialogEnded();
	void OnDialogStarted();
	void OnDialogueEnterLeave(bool Entered);
	void OnTagCnahged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);
	void PeacefulCalmLocomotion(struct FPoseLink* PeacefulCalmLocomotion_0);
	void PeacefulFleeLocomotion(struct FPoseLink* PeacefulFleeLocomotion_0);
	void PeacefulSearchLocomotion(struct FPoseLink* PeacefulSearchLocomotion_0);
	void QTE(const struct FPoseLink& InPose, struct FPoseLink* QTE_0);
	void UpdateAdditive();
	void UpdateHeadIK_Enabled();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_MasterTemplate_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_MasterTemplate_C")
	}
	static class UABP_MasterTemplate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_MasterTemplate_C>();
	}
};
DUMPER7_ASSERTS_UABP_MasterTemplate_C;

}

