#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_NPCDialogueLayer

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ABP_NPCDialogueLayer_structs.hpp"
#include "Smuta_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_NPCDialogueLayer.ABP_NPCDialogueLayer_C
// 0x0960 (0x0CB0 - 0x0350)
class UABP_NPCDialogueLayer_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_NPCDialogueLayer::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;         // 0x0358(0x0014)(HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0370(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0378(0x0008)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0380(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0438(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0458(0x0048)()
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x04A0(0x00D0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x0570(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x05E0(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0628(0x0070)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x0698(0x0048)()
	struct FAnimNode_Fabrik                       AnimGraphNode_Fabrik;                              // 0x06E0(0x01F0)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x08D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x08F0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x0910(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0938(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0980(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x0A70(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x0AF0(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x0B18(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x0B98(0x0028)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0BC0(0x0020)()
	class UPawnMovementComponent*                 K2Node_PropertyAccess;                             // 0x0BE0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          idle;                                              // 0x0BF0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BF1[0x7];                                      // 0x0BF1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           BlendTimerHandle;                                  // 0x0BF8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDialogueAnimationsData*                IdleData;                                          // 0x0C00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      IdleAnimation;                                     // 0x0C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	float                                         vert;                                              // 0x0C10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Time;                                        // 0x0C14(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EForceBlendspace                              ForceBlendSpace;                                   // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C19[0x7];                                      // 0x0C19(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        BlendSpaceX;                                       // 0x0C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BlendSpaceY;                                       // 0x0C28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBlendSpace*                            BlendSpace;                                        // 0x0C30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CustomIdleAnimation;                               // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             NewVar;                                            // 0x0C40(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHuman_CH_C*                            As_Human_CH;                                       // 0x0CA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void BlueprintThreadSafeUpdateAnimation(float DeltaTime);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void CastToOwner(class UObject* Object);
	void CustomEvent();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_NPCDialogueLayer_AnimGraphNode_BlendListByBool_FED8034F4E2146F891D6658AED29DCBC();
	void ExecuteUbergraph_ABP_NPCDialogueLayer(int32 EntryPoint);
	class UCharacterMovementComponent* Get_Movement_Comp();
	void GetBoneTransform();
	void OnBlendOut_48A1A4E64439C922346B39AC2EC77889(class FName NotifyName);
	void OnCompleted_48A1A4E64439C922346B39AC2EC77889(class FName NotifyName);
	void OnInterrupted_48A1A4E64439C922346B39AC2EC77889(class FName NotifyName);
	void OnLoaded_050C278F4FBD8649E18032BF899CB24D(class UObject* Loaded);
	void OnLoaded_E114222441CFFC8AB7ED2F90B716C75A(class UObject* Loaded);
	void OnNotifyBegin_48A1A4E64439C922346B39AC2EC77889(class FName NotifyName);
	void OnNotifyEnd_48A1A4E64439C922346B39AC2EC77889(class FName NotifyName);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);
	void Play_Dialogue_Montage(class USkeletalMeshComponent* InSkeletalMeshComponent, class UAnimMontage* MontageToPlay, class AHuman_CH_C* Character);
	void SetBlendSpace(class UBlendSpace* Value);
	void SetBlendSpaceParam(double X, double Y);
	void SetDialogueAnimation(TSoftObjectPtr<class UAnimSequence> Input);
	void SetIdleAnim(class UAnimSequence* idle_0);
	void SetIdleLoaded(class UAnimSequence* idle_0);
	void Stop_Montage(bool Entered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_NPCDialogueLayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_NPCDialogueLayer_C")
	}
	static class UABP_NPCDialogueLayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_NPCDialogueLayer_C>();
	}
};
DUMPER7_ASSERTS_UABP_NPCDialogueLayer_C;

}

