#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_SK_LowerBody

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ABP_SK_LowerBody.ABP_SK_LowerBody_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct ABP_SK_LowerBody_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_SK_LowerBody_C_AnimGraph;

// Function ABP_SK_LowerBody.ABP_SK_LowerBody_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct ABP_SK_LowerBody_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_SK_LowerBody_C_BlueprintUpdateAnimation;

// Function ABP_SK_LowerBody.ABP_SK_LowerBody_C.ExecuteUbergraph_ABP_SK_LowerBody
// 0x0008 (0x0008 - 0x0000)
struct ABP_SK_LowerBody_C_ExecuteUbergraph_ABP_SK_LowerBody final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_ABP_SK_LowerBody_C_ExecuteUbergraph_ABP_SK_LowerBody;

// Function ABP_SK_LowerBody.ABP_SK_LowerBody_C.LowerBody
// 0x0020 (0x0020 - 0x0000)
struct ABP_SK_LowerBody_C_LowerBody final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              LowerBody_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_ABP_SK_LowerBody_C_LowerBody;

}

