#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ABP_ManPeasant

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "ABP_ManPeasant_structs.hpp"
#include "Engine_structs.hpp"
#include "StatesNPC_structs.hpp"
#include "EPOIType_structs.hpp"
#include "NPC_InteractPoint_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass ABP_ManPeasant.ABP_ManPeasant_C
// 0x18E0 (0x1CA0 - 0x03C0)
class UABP_ManPeasant_C final : public UBaseAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct ABP_ManPeasant::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;               // 0x03C8(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3;                              // 0x03F8(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_2;                   // 0x0418(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x04D0(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x04F0(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x05A8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x05C8(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0638(0x00C8)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0700(0x00B8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x07B8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x07D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x0800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0828(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0850(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x08A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x08C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x08F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0940(0x0028)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_2;                      // 0x0968(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x09E0(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0A00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0A28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0A50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0A78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0AA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0AC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0AF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0B18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0B40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0B68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0B90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x0BB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0BE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0C08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0C30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0C58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0C80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0CA8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0CD0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x0D18(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0D38(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x0D80(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0DA0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x0DE8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0E08(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x0E50(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0E70(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0EB8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0ED8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0F20(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0F40(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0F88(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0FA8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0FF0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1010(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1058(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x1078(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x10E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1108(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x11D0(0x0020)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer_1;                      // 0x11F0(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1268(0x0020)()
	struct FAnimNode_RandomPlayer                 AnimGraphNode_RandomPlayer;                        // 0x1288(0x0078)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x1300(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x13C8(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1438(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x1480(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x14C8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x14E8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x1558(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1578(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x15E8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x1608(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x16D0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x16F0(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer_1;                   // 0x17B8(0x00C8)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x1880(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x1948(0x0110)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x1A58(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x1AD8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x1B00(0x00F0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x1BF0(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x1C18(0x0048)()
	bool                                          RightStep;                                         // 0x1C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Hit_React;                                         // 0x1C61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatesNPC                                    States;                                            // 0x1C62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C63[0x5];                                     // 0x1C63(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EPOIType>                              POI_Type;                                          // 0x1C68(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	ENPC_InteractPoint                            NPC_Interact;                                      // 0x1C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C79[0x3];                                     // 0x1C79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationIdleZ;                                     // 0x1C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Vertical;                                          // 0x1C80(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           BoneNames;                                         // 0x1C88(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Right_Angle;                                       // 0x1C98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Forward_Angle;                                     // 0x1C9C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_an_tpc_footstep_left();
	void AnimNotify_an_tpc_footstep_right();
	void AnimNotify_HitReactEnd();
	void AnimNotify_L_step();
	void AnimNotify_R_step();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_BlendSpacePlayer_357A20664E1C34E7ACCB13BBF9E06A58();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_00DF452C4235C5DD7C52AF8BFD8A5132();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_01AD79B94FCD4DA31E01D5B35F5EA8BB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_144CEBE4445D0E443273018650EAE8C9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_175AC08A48CA20FF81DAEE8131672FA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_18D131D04112A6E714E0F18CD9257E13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_2363FECD4E66FDAA1A95A3BDA071C953();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_291920A94A7A239E1962E59897817FEC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_2A81A59446424BDA999AF481ED12D160();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_3666204B4A29BCE9BE3FEEA0D051BA4B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_4389AA2E40679B1B7647B3A235558D97();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_49877A4E48954815470BF6AF105C0E71();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_539980DF494C1CCAE994D3AAC316497A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_54B4FFC34A3CB873D661B8BC343A01AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_5B0BDC044D6F1166E712AF92780EE2AD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_64C3977E4D0937392A8E6B95F705CAA1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_64DC1B7947C471C81FE3E78241840D57();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_7ADBBC1D48D1B118ACE744B9F874E926();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_828735B243EE80D7848D1FA41CD87A7B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_83E785B447A12933A59FA79DB3629276();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_888FE9134E3A8078E83104912F222F40();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_8AD01C764712E6F671931283C89C64A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_8C68196D485B9AF60A00B2830BCF390D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_9C22531749B5EC98FF8E63A40DE171AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_A3BEC78A43EF4C05FD3B0FBF4910E613();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_AB6A45654B783C26870B7AB34D9BE18D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_B6B485E948DDCC2E20DBE98884DC0B19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_CE6BB98948DEEC4DE8A8989365242131();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_ABP_ManPeasant_AnimGraphNode_TransitionResult_F0965CF74F798967F5E9209EC56EE1DB();
	void ExecuteUbergraph_ABP_ManPeasant(int32 EntryPoint);
	void HitResponse(const struct FPoseLink& InPose, struct FPoseLink* HitResponse_0);
	void LookAt(const struct FPoseLink& InPose, struct FPoseLink* LookAt_0);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ABP_ManPeasant_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ABP_ManPeasant_C")
	}
	static class UABP_ManPeasant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UABP_ManPeasant_C>();
	}
};
DUMPER7_ASSERTS_UABP_ManPeasant_C;

}

