#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_BattleArea

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_BattleArea.AC_BattleArea_C
// 0x0058 (0x00F8 - 0x00A0)
class UAC_BattleArea_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ADefaultCharacter*                      OwnerCharacter;                                    // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class APawn*>                          Soldiers;                                          // 0x00B0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class APawn*>                          Attackers;                                         // 0x00C0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<double>                                Distance;                                          // 0x00D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<double>                                Angle;                                             // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class APawn*                                  PromouteToAttackerPawn;                            // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddSoldier(class APawn* Pawn);
	void ExecuteUbergraph_AC_BattleArea(int32 EntryPoint);
	void GetHitStacks(class AActor* Actor, int32* HitStacksNum);
	void GetNumAttackers(int32* NumAttackers);
	void IntUpdate();
	void PromouteToAttacker(class APawn* Pawn);
	void ReceiveBeginPlay();
	void RemoveSolder(class APawn* Pawn);
	void SetAsAttacker(class APawn* Pawn);
	void SetAsSatellite(class APawn* Pawn);
	void Update();
	void UpdateSatellitePosition(class APawn* Pawn, int32 Index_0, bool* Result);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_BattleArea_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_BattleArea_C")
	}
	static class UAC_BattleArea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_BattleArea_C>();
	}
};
DUMPER7_ASSERTS_UAC_BattleArea_C;

}

