#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AC_Concentration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass AC_Concentration.AC_Concentration_C
// 0x0040 (0x01A0 - 0x0160)
class UAC_Concentration_C final : public UConcentrationComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0160(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInterface*                     MaterialPP;                                        // 0x0168(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CurrentMatPPInst;                                  // 0x0170(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         IndexPPmaterial;                                   // 0x0178(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Target;                                            // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current;                                           // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Duration;                                          // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Curve;                                             // 0x0198(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AC_Concentration(int32 EntryPoint);
	void OnOwnerASCTagUpdated(const struct FGameplayTag& UpdatedTag, bool bExists);
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AC_Concentration_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AC_Concentration_C")
	}
	static class UAC_Concentration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAC_Concentration_C>();
	}
};
DUMPER7_ASSERTS_UAC_Concentration_C;

}

