#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ActivateAbility_BTT

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ActivateAbility_BTT.ActivateAbility_BTT_C
// 0x0038 (0x00E0 - 0x00A8)
class UActivateAbility_BTT_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 AttackAbilityClass;                                // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CancelTag;                                         // 0x00B8(0x0020)(Edit, BlueprintVisible)
	bool                                          bIsAbilityCommited;                                // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SkipOnFailed;                                      // 0x00D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AbilityEndedResponse(const class UGameplayAbility* EndedAbility);
	void ExecuteUbergraph_ActivateAbility_BTT(int32 EntryPoint);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ActivateAbility_BTT_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivateAbility_BTT_C")
	}
	static class UActivateAbility_BTT_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateAbility_BTT_C>();
	}
};
DUMPER7_ASSERTS_UActivateAbility_BTT_C;

}

