#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AITeamFight

#include "Basic.hpp"

#include "AITeamFight_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AITeamFight.AISettingsInterface.GetEnemyFightZoneSettings
// 0x0008 (0x0008 - 0x0000)
struct AISettingsInterface_GetEnemyFightZoneSettings final
{
public:
	class UDA_EnemyFightZoneSettings*             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AISettingsInterface_GetEnemyFightZoneSettings;

// Function AITeamFight.AISettingsInterface.GetEnemyFightZoneSettingsWrapper
// 0x0020 (0x0020 - 0x0000)
struct AISettingsInterface_GetEnemyFightZoneSettingsWrapper final
{
public:
	struct FEnemyFightZoneSettingsWrapper         OutSettings;                                       // 0x0000(0x0018)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AISettingsInterface_GetEnemyFightZoneSettingsWrapper;

// Function AITeamFight.AISettingsInterface.SetEnemyFightZoneSettings
// 0x0008 (0x0008 - 0x0000)
struct AISettingsInterface_SetEnemyFightZoneSettings final
{
public:
	class UDA_EnemyFightZoneSettings*             Settings;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AISettingsInterface_SetEnemyFightZoneSettings;

// Function AITeamFight.AISettingsInterface.SetEnemyFightZoneSettingsWrapper
// 0x0018 (0x0018 - 0x0000)
struct AISettingsInterface_SetEnemyFightZoneSettingsWrapper final
{
public:
	struct FEnemyFightZoneSettingsWrapper         InSettings;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AISettingsInterface_SetEnemyFightZoneSettingsWrapper;

// Function AITeamFight.BattleDirector.GetAdditionalAttackEnemy
// 0x0008 (0x0008 - 0x0000)
struct BattleDirector_GetAdditionalAttackEnemy final
{
public:
	class ACharacter*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattleDirector_GetAdditionalAttackEnemy;

// Function AITeamFight.BattleDirector.GetDominantEnemy
// 0x0008 (0x0008 - 0x0000)
struct BattleDirector_GetDominantEnemy final
{
public:
	class ACharacter*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattleDirector_GetDominantEnemy;

// Function AITeamFight.BattleDirector.ReleasePoint
// 0x0010 (0x0010 - 0x0000)
struct BattleDirector_ReleasePoint final
{
public:
	class UZoneFightAiComponent*                  ZoneFightAiComp;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OldIndex;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattleDirector_ReleasePoint;

// Function AITeamFight.BattleDirector.SetBattleDirectorSettings
// 0x0018 (0x0018 - 0x0000)
struct BattleDirector_SetBattleDirectorSettings final
{
public:
	struct FBattleDirectorSettingsWrapper         InSettings;                                        // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattleDirector_SetBattleDirectorSettings;

// Function AITeamFight.BattleDirector.GetAdditionalAttackEnemyComponent
// 0x0008 (0x0008 - 0x0000)
struct BattleDirector_GetAdditionalAttackEnemyComponent final
{
public:
	class UZoneFightAiComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattleDirector_GetAdditionalAttackEnemyComponent;

// Function AITeamFight.BattleDirector.GetBattleDirectorSettings
// 0x0020 (0x0020 - 0x0000)
struct BattleDirector_GetBattleDirectorSettings final
{
public:
	struct FBattleDirectorSettingsWrapper         OutSettings;                                       // 0x0000(0x0018)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BattleDirector_GetBattleDirectorSettings;

// Function AITeamFight.BattleDirector.GetDominantEnemyComponent
// 0x0008 (0x0008 - 0x0000)
struct BattleDirector_GetDominantEnemyComponent final
{
public:
	class UZoneFightAiComponent*                  ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BattleDirector_GetDominantEnemyComponent;

// Function AITeamFight.DamageHistoryComponent.GetDamageByTime
// 0x0008 (0x0008 - 0x0000)
struct DamageHistoryComponent_GetDamageByTime final
{
public:
	float                                         Seconds;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageHistoryComponent_GetDamageByTime;

// Function AITeamFight.DamageHistoryComponent.UpdateQueue
// 0x0004 (0x0004 - 0x0000)
struct DamageHistoryComponent_UpdateQueue final
{
public:
	float                                         Damage;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DamageHistoryComponent_UpdateQueue;

// Function AITeamFight.DynamicZoneActor.DestroyDynamicZone
// 0x0008 (0x0008 - 0x0000)
struct DynamicZoneActor_DestroyDynamicZone final
{
public:
	class AActor*                                 DestroyedActor;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DynamicZoneActor_DestroyDynamicZone;

// Function AITeamFight.FightZoneAIController.SetNewNavFilterClass
// 0x0008 (0x0008 - 0x0000)
struct FightZoneAIController_SetNewNavFilterClass final
{
public:
	TSubclassOf<class UNavigationQueryFilter>     NewFilterClass;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZoneAIController_SetNewNavFilterClass;

// Function AITeamFight.FightZonesComponent.GetActiveEnemiesCount
// 0x0004 (0x0004 - 0x0000)
struct FightZonesComponent_GetActiveEnemiesCount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_GetActiveEnemiesCount;

// Function AITeamFight.FightZonesComponent.GetAllActiveEnemies
// 0x0010 (0x0010 - 0x0000)
struct FightZonesComponent_GetAllActiveEnemies final
{
public:
	TArray<class ACharacter*>                     ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_GetAllActiveEnemies;

// Function AITeamFight.FightZonesComponent.OnEnemyChangeDesiredZone
// 0x0010 (0x0010 - 0x0000)
struct FightZonesComponent_OnEnemyChangeDesiredZone final
{
public:
	class UZoneFightAiComponent*                  Character;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DesiredZone;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PrevZone;                                          // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_OnEnemyChangeDesiredZone;

// Function AITeamFight.FightZonesComponent.OnZoneBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct FightZonesComponent_OnZoneBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_OnZoneBeginOverlap;

// Function AITeamFight.FightZonesComponent.OnZoneEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct FightZonesComponent_OnZoneEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FightZonesComponent_OnZoneEndOverlap;

// Function AITeamFight.FightZonesComponent.SetNewZonesSettings
// 0x0008 (0x0008 - 0x0000)
struct FightZonesComponent_SetNewZonesSettings final
{
public:
	class UDA_ZoneSettings*                       NewZoneSettings;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_SetNewZonesSettings;

// Function AITeamFight.FightZonesComponent.SetNewZonesSettingsWrapper
// 0x0018 (0x0018 - 0x0000)
struct FightZonesComponent_SetNewZonesSettingsWrapper final
{
public:
	struct FZoneSettingsWrapper                   NewZoneSettingsWrapper;                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_SetNewZonesSettingsWrapper;

// Function AITeamFight.FightZonesComponent.GetBattleDirector
// 0x0008 (0x0008 - 0x0000)
struct FightZonesComponent_GetBattleDirector final
{
public:
	class UBattleDirector*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_GetBattleDirector;

// Function AITeamFight.FightZonesComponent.GetFightZonesSettings
// 0x0020 (0x0020 - 0x0000)
struct FightZonesComponent_GetFightZonesSettings final
{
public:
	struct FZoneSettingsWrapper                   OutFightZones;                                     // 0x0000(0x0018)(Parm, OutParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FightZonesComponent_GetFightZonesSettings;

// Function AITeamFight.FightZonesComponent.GetLastZoneIndex
// 0x0004 (0x0004 - 0x0000)
struct FightZonesComponent_GetLastZoneIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FightZonesComponent_GetLastZoneIndex;

// Function AITeamFight.HealthInterface.GetHealth
// 0x0004 (0x0004 - 0x0000)
struct HealthInterface_GetHealth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HealthInterface_GetHealth;

// Function AITeamFight.HealthInterface.GetHealthRatio
// 0x0004 (0x0004 - 0x0000)
struct HealthInterface_GetHealthRatio final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HealthInterface_GetHealthRatio;

// Function AITeamFight.HealthInterface.GetMaxHealth
// 0x0004 (0x0004 - 0x0000)
struct HealthInterface_GetMaxHealth final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HealthInterface_GetMaxHealth;

// Function AITeamFight.SettingsChangerTrigger.OnBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct SettingsChangerTrigger_OnBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SettingsChangerTrigger_OnBeginOverlap;

// Function AITeamFight.SettingsChangerTrigger.OnEndOverlap
// 0x0020 (0x0020 - 0x0000)
struct SettingsChangerTrigger_OnEndOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SettingsChangerTrigger_OnEndOverlap;

// Function AITeamFight.ZoneFightAiComponent.SetAiSettings
// 0x0008 (0x0008 - 0x0000)
struct ZoneFightAiComponent_SetAiSettings final
{
public:
	class UDA_EnemyFightZoneSettings*             NewZoneSettings;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_SetAiSettings;

// Function AITeamFight.ZoneFightAiComponent.SetAiSettingsWrapper
// 0x0018 (0x0018 - 0x0000)
struct ZoneFightAiComponent_SetAiSettingsWrapper final
{
public:
	struct FEnemyFightZoneSettingsWrapper         NewZoneSettings;                                   // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_SetAiSettingsWrapper;

// Function AITeamFight.ZoneFightAiComponent.SetOverridePreferredZoneIndex
// 0x0004 (0x0004 - 0x0000)
struct ZoneFightAiComponent_SetOverridePreferredZoneIndex final
{
public:
	int32                                         NewZoneIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_SetOverridePreferredZoneIndex;

// Function AITeamFight.ZoneFightAiComponent.TrySetClosestZone
// 0x0001 (0x0001 - 0x0000)
struct ZoneFightAiComponent_TrySetClosestZone final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_TrySetClosestZone;

// Function AITeamFight.ZoneFightAiComponent.TrySetDesiredZone
// 0x0008 (0x0008 - 0x0000)
struct ZoneFightAiComponent_TrySetDesiredZone final
{
public:
	int32                                         NewDesiredZone;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ZoneFightAiComponent_TrySetDesiredZone;

// Function AITeamFight.ZoneFightAiComponent.TrySetRetreatZone
// 0x0001 (0x0001 - 0x0000)
struct ZoneFightAiComponent_TrySetRetreatZone final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_TrySetRetreatZone;

// Function AITeamFight.ZoneFightAiComponent.GetCharacterWeight
// 0x0004 (0x0004 - 0x0000)
struct ZoneFightAiComponent_GetCharacterWeight final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetCharacterWeight;

// Function AITeamFight.ZoneFightAiComponent.GetDesiredZoneIndex
// 0x0004 (0x0004 - 0x0000)
struct ZoneFightAiComponent_GetDesiredZoneIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetDesiredZoneIndex;

// Function AITeamFight.ZoneFightAiComponent.GetDistanceToClosestMate
// 0x0004 (0x0004 - 0x0000)
struct ZoneFightAiComponent_GetDistanceToClosestMate final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetDistanceToClosestMate;

// Function AITeamFight.ZoneFightAiComponent.GetIsAdditionalAttacker
// 0x0001 (0x0001 - 0x0000)
struct ZoneFightAiComponent_GetIsAdditionalAttacker final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetIsAdditionalAttacker;

// Function AITeamFight.ZoneFightAiComponent.GetIsDominant
// 0x0001 (0x0001 - 0x0000)
struct ZoneFightAiComponent_GetIsDominant final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetIsDominant;

// Function AITeamFight.ZoneFightAiComponent.GetPreferredZoneIndex
// 0x0004 (0x0004 - 0x0000)
struct ZoneFightAiComponent_GetPreferredZoneIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetPreferredZoneIndex;

// Function AITeamFight.ZoneFightAiComponent.GetPrevZoneIndex
// 0x0004 (0x0004 - 0x0000)
struct ZoneFightAiComponent_GetPrevZoneIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetPrevZoneIndex;

// Function AITeamFight.ZoneFightAiComponent.GetSuggestedZone
// 0x0028 (0x0028 - 0x0000)
struct ZoneFightAiComponent_GetSuggestedZone final
{
public:
	struct FSuggestedZone                         OutSuggestedZone;                                  // 0x0000(0x0020)(Parm, OutParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetSuggestedZone;

// Function AITeamFight.ZoneFightAiComponent.GetZoneIndex
// 0x0004 (0x0004 - 0x0000)
struct ZoneFightAiComponent_GetZoneIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetZoneIndex;

// Function AITeamFight.ZoneFightAiComponent.GetZoneOwner
// 0x0008 (0x0008 - 0x0000)
struct ZoneFightAiComponent_GetZoneOwner final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ZoneFightAiComponent_GetZoneOwner;

}

