#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AITeamFight

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "AITeamFight_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class AITeamFight.AISettingsInterface
// 0x0000 (0x0000 - 0x0000)
class IAISettingsInterface final
{
public:
	class UDA_EnemyFightZoneSettings* GetEnemyFightZoneSettings();
	bool GetEnemyFightZoneSettingsWrapper(struct FEnemyFightZoneSettingsWrapper* OutSettings);
	void SetEnemyFightZoneSettings(class UDA_EnemyFightZoneSettings* Settings);
	void SetEnemyFightZoneSettingsWrapper(const struct FEnemyFightZoneSettingsWrapper& InSettings);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AISettingsInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AISettingsInterface")
	}
	static class IAISettingsInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IAISettingsInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IAISettingsInterface;

// Class AITeamFight.BattleDirector
// 0x00E8 (0x0110 - 0x0028)
#pragma pack(push, 0x1)
class alignas(0x10) UBattleDirector : public UObject
{
public:
	TMulticastInlineDelegate<void(const class UZoneFightAiComponent* NewDominant)> OnNewDominantSelectedDelegate; // 0x0028(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x88];                                      // 0x0038(0x0088)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleDirectorSettingsWrapper         BattleDirectorSettings;                            // 0x00C0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_D8[0x8];                                       // 0x00D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotationSwapTimerRate;                             // 0x00E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RotationSwapRandomDeviation;                       // 0x00E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_E8[0x20];                                      // 0x00E8(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class ACharacter* GetAdditionalAttackEnemy();
	class ACharacter* GetDominantEnemy();
	void ReleasePoint(class UZoneFightAiComponent* ZoneFightAiComp, int32 Index_0, int32 OldIndex);
	void ResetAdditionalAttacker();
	void SetBattleDirectorSettings(const struct FBattleDirectorSettingsWrapper& InSettings);

	class UZoneFightAiComponent* GetAdditionalAttackEnemyComponent() const;
	bool GetBattleDirectorSettings(struct FBattleDirectorSettingsWrapper* OutSettings) const;
	class UZoneFightAiComponent* GetDominantEnemyComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BattleDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BattleDirector")
	}
	static class UBattleDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBattleDirector>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UBattleDirector;

// Class AITeamFight.BTDecorator_CheckActiveZone
// 0x0000 (0x0068 - 0x0068)
class UBTDecorator_CheckActiveZone final : public UBTDecorator
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_CheckActiveZone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_CheckActiveZone")
	}
	static class UBTDecorator_CheckActiveZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_CheckActiveZone>();
	}
};
DUMPER7_ASSERTS_UBTDecorator_CheckActiveZone;

// Class AITeamFight.BTDecorator_CheckAdditionalAttacker
// 0x0000 (0x0068 - 0x0068)
class UBTDecorator_CheckAdditionalAttacker final : public UBTDecorator
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_CheckAdditionalAttacker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_CheckAdditionalAttacker")
	}
	static class UBTDecorator_CheckAdditionalAttacker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_CheckAdditionalAttacker>();
	}
};
DUMPER7_ASSERTS_UBTDecorator_CheckAdditionalAttacker;

// Class AITeamFight.BTDecorator_CheckDamageHistory
// 0x0040 (0x00A8 - 0x0068)
class UBTDecorator_CheckDamageHistory final : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                 ActorToCheck;                                      // 0x0068(0x0028)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                         TimeToCheck;                                       // 0x0090(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DamageThreshold;                                   // 0x0094(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                 CachedDescription;                                 // 0x0098(0x0010)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_CheckDamageHistory")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_CheckDamageHistory")
	}
	static class UBTDecorator_CheckDamageHistory* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_CheckDamageHistory>();
	}
};
DUMPER7_ASSERTS_UBTDecorator_CheckDamageHistory;

// Class AITeamFight.BTDecorator_CheckIsDominant
// 0x0000 (0x0068 - 0x0068)
class UBTDecorator_CheckIsDominant final : public UBTDecorator
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTDecorator_CheckIsDominant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTDecorator_CheckIsDominant")
	}
	static class UBTDecorator_CheckIsDominant* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTDecorator_CheckIsDominant>();
	}
};
DUMPER7_ASSERTS_UBTDecorator_CheckIsDominant;

// Class AITeamFight.BTS_CheckCurrentZone
// 0x0028 (0x0098 - 0x0070)
class UBTS_CheckCurrentZone final : public UBTService
{
public:
	struct FBlackboardKeySelector                 CurrentZoneKey;                                    // 0x0070(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTS_CheckCurrentZone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTS_CheckCurrentZone")
	}
	static class UBTS_CheckCurrentZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_CheckCurrentZone>();
	}
};
DUMPER7_ASSERTS_UBTS_CheckCurrentZone;

// Class AITeamFight.BTS_SetDominantEnemy
// 0x0028 (0x0098 - 0x0070)
class UBTS_SetDominantEnemy final : public UBTService
{
public:
	struct FBlackboardKeySelector                 DominantEnemyKey;                                  // 0x0070(0x0028)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTS_SetDominantEnemy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTS_SetDominantEnemy")
	}
	static class UBTS_SetDominantEnemy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTS_SetDominantEnemy>();
	}
};
DUMPER7_ASSERTS_UBTS_SetDominantEnemy;

// Class AITeamFight.BTT_ChangeZone
// 0x0008 (0x0078 - 0x0070)
class UBTT_ChangeZone final : public UBTTaskNode
{
public:
	int32                                         ZoneIndex;                                         // 0x0070(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTT_ChangeZone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_ChangeZone")
	}
	static class UBTT_ChangeZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_ChangeZone>();
	}
};
DUMPER7_ASSERTS_UBTT_ChangeZone;

// Class AITeamFight.BTT_ResetAttacker
// 0x0000 (0x0070 - 0x0070)
class UBTT_ResetAttacker final : public UBTTaskNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BTT_ResetAttacker")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_ResetAttacker")
	}
	static class UBTT_ResetAttacker* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_ResetAttacker>();
	}
};
DUMPER7_ASSERTS_UBTT_ResetAttacker;

// Class AITeamFight.DamageHistoryComponent
// 0x0020 (0x00C0 - 0x00A0)
class UDamageHistoryComponent final : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x10];                                      // 0x00A0(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxHistoryLength;                                  // 0x00B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	float GetDamageByTime(float Seconds);
	void UpdateQueue(float Damage);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DamageHistoryComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DamageHistoryComponent")
	}
	static class UDamageHistoryComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDamageHistoryComponent>();
	}
};
DUMPER7_ASSERTS_UDamageHistoryComponent;

// Class AITeamFight.DA_BattleDirectorSettings
// 0x00F0 (0x0120 - 0x0030)
class UDA_BattleDirectorSettings final : public UDataAsset
{
public:
	bool                                          bCanEditDistanceCurve;                             // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DistanceCurve;                                     // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEditHealthRatioCurve;                          // 0x0040(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            HealthRatioCurve;                                  // 0x0048(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEditHealthAbsoluteCurve;                       // 0x0050(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            HealthAbsoluteCurve;                               // 0x0058(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEditAggressionScoreCurve;                      // 0x0060(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            AggressionScoreCurve;                              // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEditElapsedTimeCurve;                          // 0x0070(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            ElapsedTimeCurve;                                  // 0x0078(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanEditDamageHistoryCurve;                        // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageHistory                         DamageHistory;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCanEditAdditionalCurve;                           // 0x0098(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            AdditionalCurve;                                   // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  EnemyProhibitionTagContainer;                      // 0x00A8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  OwnerProhibitionTagContainer;                      // 0x00C8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  NeedHelpTagContainer;                              // 0x00E8(0x0020)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                          bCanUseAdditionalAttack;                           // 0x0108(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_109[0x3];                                      // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AdditionalAttackRate;                              // 0x010C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RandomDeviation;                                   // 0x0110(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           AdditionalAttackerTag;                             // 0x0114(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         UpdateRate;                                        // 0x011C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DA_BattleDirectorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_BattleDirectorSettings")
	}
	static class UDA_BattleDirectorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_BattleDirectorSettings>();
	}
};
DUMPER7_ASSERTS_UDA_BattleDirectorSettings;

// Class AITeamFight.DA_EnemyFightZoneSettings
// 0x0058 (0x0088 - 0x0030)
class UDA_EnemyFightZoneSettings final : public UDataAsset
{
public:
	int32                                         Weight;                                            // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PreferredZoneIndex;                                // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Aggression;                                        // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDominantTime;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SupportPriority;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  DominantProhibitionTags;                           // 0x0048(0x0020)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FGrantedEffects>                ZoneEffects;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGrantedAbilities>              ZoneAbilities;                                     // 0x0078(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DA_EnemyFightZoneSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_EnemyFightZoneSettings")
	}
	static class UDA_EnemyFightZoneSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_EnemyFightZoneSettings>();
	}
};
DUMPER7_ASSERTS_UDA_EnemyFightZoneSettings;

// Class AITeamFight.DA_ZoneSettings
// 0x0010 (0x0040 - 0x0030)
class UDA_ZoneSettings final : public UDataAsset
{
public:
	TArray<struct FZoneSettings>                  ZoneSettings;                                      // 0x0030(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DA_ZoneSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_ZoneSettings")
	}
	static class UDA_ZoneSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_ZoneSettings>();
	}
};
DUMPER7_ASSERTS_UDA_ZoneSettings;

// Class AITeamFight.DynamicZoneActor
// 0x0010 (0x02A8 - 0x0298)
class ADynamicZoneActor final : public AActor
{
public:
	class UFightZoneSphereComponent*              FightZoneSphereComponent;                          // 0x0298(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A0[0x8];                                      // 0x02A0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DestroyDynamicZone(class AActor* DestroyedActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DynamicZoneActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DynamicZoneActor")
	}
	static class ADynamicZoneActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ADynamicZoneActor>();
	}
};
DUMPER7_ASSERTS_ADynamicZoneActor;

// Class AITeamFight.EnemySpreadSolverBase
// 0x0010 (0x0038 - 0x0028)
class UEnemySpreadSolverBase : public UObject
{
public:
	bool                                          bUseCone;                                          // 0x0028(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ConeHalfAngle;                                     // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bUseFixedRadius;                                   // 0x0030(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Radius;                                            // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EnemySpreadSolverBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EnemySpreadSolverBase")
	}
	static class UEnemySpreadSolverBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEnemySpreadSolverBase>();
	}
};
DUMPER7_ASSERTS_UEnemySpreadSolverBase;

// Class AITeamFight.FightZoneAIController
// 0x0000 (0x03C0 - 0x03C0)
class AFightZoneAIController : public AAIController
{
public:
	void SetNewNavFilterClass(TSubclassOf<class UNavigationQueryFilter> NewFilterClass);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FightZoneAIController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FightZoneAIController")
	}
	static class AFightZoneAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFightZoneAIController>();
	}
};
DUMPER7_ASSERTS_AFightZoneAIController;

// Class AITeamFight.FightZonesComponent
// 0x0118 (0x01B8 - 0x00A0)
class UFightZonesComponent final : public UActorComponent
{
public:
	TSubclassOf<class UBattleDirector>            BattleDirectorClass;                               // 0x00A0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBattleDirector*                        BattleDirector;                                    // 0x00A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FZoneSettingsWrapper                   FightZones;                                        // 0x00B0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  EnemyFilterTags;                                   // 0x00C8(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	struct FGameplayTag                           FightStartTag;                                     // 0x00E8(0x0008)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  ProhibitionTags;                                   // 0x00F0(0x0020)(Edit, BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                         RegisterRadius;                                    // 0x0110(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_114[0x14];                                     // 0x0114(0x0014)(Fixing Size After Last Property [ Dumper-7 ])
	class ARegisterActor*                         RegisterActor;                                     // 0x0128(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_130[0x20];                                     // 0x0130(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UFightZoneSphereComponent*>      ActiveZones;                                       // 0x0150(0x0010)(ExportObject, ZeroConstructor, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                         Pad_160[0x58];                                     // 0x0160(0x0058)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DestroyZones();
	int32 GetActiveEnemiesCount();
	TArray<class ACharacter*> GetAllActiveEnemies();
	void InitZones();
	void OnEnemyChangeDesiredZone(class UZoneFightAiComponent* Character, int32 DesiredZone, int32 PrevZone);
	void OnZoneBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnZoneEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void SetNewZonesSettings(class UDA_ZoneSettings* NewZoneSettings);
	void SetNewZonesSettingsWrapper(const struct FZoneSettingsWrapper& NewZoneSettingsWrapper);

	class UBattleDirector* GetBattleDirector() const;
	bool GetFightZonesSettings(struct FZoneSettingsWrapper* OutFightZones) const;
	int32 GetLastZoneIndex() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FightZonesComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FightZonesComponent")
	}
	static class UFightZonesComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFightZonesComponent>();
	}
};
DUMPER7_ASSERTS_UFightZonesComponent;

// Class AITeamFight.FightZoneSphereComponent
// 0x0120 (0x06C0 - 0x05A0)
class UFightZoneSphereComponent final : public USphereComponent
{
public:
	uint8                                         Pad_5A0[0x120];                                    // 0x05A0(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FightZoneSphereComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FightZoneSphereComponent")
	}
	static class UFightZoneSphereComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFightZoneSphereComponent>();
	}
};
DUMPER7_ASSERTS_UFightZoneSphereComponent;

// Class AITeamFight.HealthInterface
// 0x0000 (0x0000 - 0x0000)
class IHealthInterface final
{
public:
	float GetHealth() const;
	float GetHealthRatio() const;
	float GetMaxHealth() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HealthInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HealthInterface")
	}
	static class IHealthInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IHealthInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IHealthInterface;

// Class AITeamFight.RegisterActor
// 0x0008 (0x02A0 - 0x0298)
class ARegisterActor final : public AActor
{
public:
	class USphereComponent*                       SphereComponent;                                   // 0x0298(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("RegisterActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RegisterActor")
	}
	static class ARegisterActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARegisterActor>();
	}
};
DUMPER7_ASSERTS_ARegisterActor;

// Class AITeamFight.SettingsChangerTrigger
// 0x0098 (0x0330 - 0x0298)
class ASettingsChangerTrigger final : public AActor
{
public:
	class UBoxComponent*                          BoxComponent;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bChangeZoneSettings;                               // 0x02A0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FZoneSettingsWrapper                   ZoneSettingsWrapper;                               // 0x02A8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                          bChangeBattleDirectorSettings;                     // 0x02C0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C1[0x7];                                      // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBattleDirectorSettingsWrapper         BattleDirectorSettings;                            // 0x02C8(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E0[0x50];                                     // 0x02E0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void OnEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SettingsChangerTrigger")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SettingsChangerTrigger")
	}
	static class ASettingsChangerTrigger* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASettingsChangerTrigger>();
	}
};
DUMPER7_ASSERTS_ASettingsChangerTrigger;

// Class AITeamFight.UEnvQueryTest_CurrentZone
// 0x0018 (0x0210 - 0x01F8)
class UUEnvQueryTest_CurrentZone final : public UEnvQueryTest
{
public:
	bool                                          bUseDebug;                                         // 0x01F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CurrentDebugZone;                                  // 0x01FC(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseContextActor;                                  // 0x0200(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEnvQueryContext>           ContextActor;                                      // 0x0208(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UEnvQueryTest_CurrentZone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UEnvQueryTest_CurrentZone")
	}
	static class UUEnvQueryTest_CurrentZone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUEnvQueryTest_CurrentZone>();
	}
};
DUMPER7_ASSERTS_UUEnvQueryTest_CurrentZone;

// Class AITeamFight.UEnvQueryTest_FightDirector
// 0x0010 (0x0208 - 0x01F8)
class UUEnvQueryTest_FightDirector final : public UEnvQueryTest
{
public:
	bool                                          bUseDebug;                                         // 0x01F8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseContextActor;                                  // 0x01F9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1FA[0x6];                                      // 0x01FA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UEnvQueryContext>           ContextActor;                                      // 0x0200(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UEnvQueryTest_FightDirector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UEnvQueryTest_FightDirector")
	}
	static class UUEnvQueryTest_FightDirector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUEnvQueryTest_FightDirector>();
	}
};
DUMPER7_ASSERTS_UUEnvQueryTest_FightDirector;

// Class AITeamFight.ZoneFightAiComponent
// 0x00A8 (0x0148 - 0x00A0)
class UZoneFightAiComponent final : public UActorComponent
{
public:
	struct FEnemyFightZoneSettingsWrapper         ZoneSettings;                                      // 0x00A0(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_B8[0x48];                                      // 0x00B8(0x0048)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bIsDominant;                                       // 0x0100(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsAdditionalAttacker;                             // 0x0101(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_102[0x26];                                     // 0x0102(0x0026)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UZoneFightAiComponent* Character, int32 NewZone, int32 PrevZone)> OnZoneChanged; // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class UZoneFightAiComponent* Character, int32 DesiredZone, int32 PrevZone)> OnDesiredZoneChanged; // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	void ResetOverridePreferredZoneIndex();
	void SetAiSettings(class UDA_EnemyFightZoneSettings* NewZoneSettings);
	void SetAiSettingsWrapper(const struct FEnemyFightZoneSettingsWrapper& NewZoneSettings);
	void SetOverridePreferredZoneIndex(int32 NewZoneIndex);
	bool TrySetClosestZone();
	bool TrySetDesiredZone(int32 NewDesiredZone);
	bool TrySetRetreatZone();

	int32 GetCharacterWeight() const;
	int32 GetDesiredZoneIndex() const;
	float GetDistanceToClosestMate() const;
	bool GetIsAdditionalAttacker() const;
	bool GetIsDominant() const;
	int32 GetPreferredZoneIndex() const;
	int32 GetPrevZoneIndex() const;
	bool GetSuggestedZone(struct FSuggestedZone* OutSuggestedZone) const;
	int32 GetZoneIndex() const;
	class AActor* GetZoneOwner() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ZoneFightAiComponent")
	}
	static const class FName& StaticName()
