#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Animal_Bear_MonkDeal_New

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function Animal_Bear_MonkDeal_New.Animal_Bear_MonkDeal_New_C.ExecuteUbergraph_Animal_Bear_MonkDeal_New
// 0x0040 (0x0040 - 0x0000)
struct Animal_Bear_MonkDeal_New_C_ExecuteUbergraph_Animal_Bear_MonkDeal_New final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTag>                   K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromArray_ReturnValue; // 0x0018(0x0020)()
	bool                                          CallFunc_AddLooseGameplayTags_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Animal_Bear_MonkDeal_New_C_ExecuteUbergraph_Animal_Bear_MonkDeal_New;

}

