#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsyncLoadingScreen

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "AsyncLoadingScreen_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class AsyncLoadingScreen.AsyncLoadingScreenLibrary
// 0x0000 (0x0028 - 0x0028)
class UAsyncLoadingScreenLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetIsEnableLoadingScreen();
	static void PreloadBackgroundImages();
	static void RemovePreloadedBackgroundImages();
	static void SetDisplayBackgroundIndex(int32 BackgroundIndex);
	static void SetDisplayMovieIndex(int32 MovieIndex);
	static void SetDisplayTipTextIndex(int32 TipTextIndex);
	static void SetEnableLoadingScreen(bool bIsEnableLoadingScreen);
	static void StopLoadingScreen();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncLoadingScreenLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncLoadingScreenLibrary")
	}
	static class UAsyncLoadingScreenLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncLoadingScreenLibrary>();
	}
};
DUMPER7_ASSERTS_UAsyncLoadingScreenLibrary;

// Class AsyncLoadingScreen.LoadingScreenSettings
// 0x1048 (0x1080 - 0x0038)
class ULoadingScreenSettings final : public UDeveloperSettings
{
public:
	bool                                          bPreloadBackgroundImages;                          // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FALoadingScreenSettings                StartupLoadingScreen;                              // 0x0040(0x04E0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FALoadingScreenSettings                DefaultLoadingScreen;                              // 0x0520(0x04E0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FClassicLayoutSettings                 Classic;                                           // 0x0A00(0x00F0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FCenterLayoutSettings                  Center;                                            // 0x0AF0(0x00F0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FLetterboxLayoutSettings               Letterbox;                                         // 0x0BE0(0x01D0)(Edit, Config, NativeAccessSpecifierPublic)
	struct FSidebarLayoutSettings                 Sidebar;                                           // 0x0DB0(0x0100)(Edit, Config, NativeAccessSpecifierPublic)
	struct FDualSidebarLayoutSettings             DualSidebar;                                       // 0x0EB0(0x01D0)(Edit, Config, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("LoadingScreenSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoadingScreenSettings")
	}
	static class ULoadingScreenSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadingScreenSettings>();
	}
};
DUMPER7_ASSERTS_ULoadingScreenSettings;

}

