#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AttackDamageMagnitude_MM

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function AttackDamageMagnitude_MM.AttackDamageMagnitude_MM_C.CalculateBaseMagnitude
// 0x0408 (0x0408 - 0x0000)
struct AttackDamageMagnitude_MM_C_CalculateBaseMagnitude final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x0298)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	float                                         ReturnValue;                                       // 0x0298(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Damage;                                            // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TargetTags;                                        // 0x02A8(0x0020)(Edit, BlueprintVisible)
	struct FGameplayTagContainer                  SourceTags;                                        // 0x02C8(0x0020)(Edit, BlueprintVisible)
	struct FGameplayAttribute                     Temp_struct_Variable;                              // 0x02E8(0x0038)(HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue;                       // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     Temp_struct_Variable_1;                            // 0x0328(0x0038)(HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetInstigatorFromSpec_ReturnValue;        // 0x0360(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPC_CH_C*                              K2Node_DynamicCast_AsNPC_CH;                       // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_371[0x7];                                      // 0x0371(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_GetTargetAggregatedTags_ReturnValue;      // 0x0378(0x0020)()
	struct FGameplayTagContainer                  CallFunc_GetSourceAggregatedTags_ReturnValue;      // 0x0398(0x0020)()
	bool                                          Temp_bool_Variable;                                // 0x03B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasTag_ReturnValue_1;                     // 0x03B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAttribute                     K2Node_Select_Default;                             // 0x03C0(0x0038)(HasGetValueTypeHash)
	float                                         CallFunc_K2_GetCapturedAttributeMagnitude_ReturnValue; // 0x03F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_FunctionResult_ReturnValue_ImplicitCast;    // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_Damage_ImplicitCast;            // 0x0400(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AttackDamageMagnitude_MM_C_CalculateBaseMagnitude;

}

