#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BC_SmutaSplineMovement

#include "Basic.hpp"

#include "EnchancedSpline_structs.hpp"


namespace SDK::Params
{

// Function BC_SmutaSplineMovement.BC_SmutaSplineMovement_C.ExecuteUbergraph_BC_SmutaSplineMovement
// 0x0068 (0x0068 - 0x0000)
struct BC_SmutaSplineMovement_C_ExecuteUbergraph_BC_SmutaSplineMovement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FEnchancedSplinePointParams            K2Node_Event_PointParams;                          // 0x0010(0x0030)(ConstParm, NoDestructor)
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAIController;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentlyOnSpline_ReturnValue;          // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BC_SmutaSplineMovement_C_ExecuteUbergraph_BC_SmutaSplineMovement;

// Function BC_SmutaSplineMovement.BC_SmutaSplineMovement_C.UpdateMovementSpeed
// 0x0030 (0x0030 - 0x0000)
struct BC_SmutaSplineMovement_C_UpdateMovementSpeed final
{
public:
	struct FEnchancedSplinePointParams            PointParams;                                       // 0x0000(0x0030)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, NoDestructor)
};
DUMPER7_ASSERTS_BC_SmutaSplineMovement_C_UpdateMovementSpeed;

}

