#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BearGates

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BearGates.BP_BearGates_C
// 0x0070 (0x0368 - 0x02F8)
class ABP_BearGates_C final : public AActivatedActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   GateLeft;                                          // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   GateRight;                                         // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneLeftGate;                                     // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        SceneRightGate;                                    // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CloseLeftGate_Alfa_A4E798394F5D199BD6B51DA1F223F720; // 0x0320(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CloseLeftGate__Direction_A4E798394F5D199BD6B51DA1F223F720; // 0x0324(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_325[0x3];                                      // 0x0325(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CloseLeftGate;                                     // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         CloseRightGate_NewTrack_0_3F0DE39844738C6F9E730884D06E59EB; // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CloseRightGate__Direction_3F0DE39844738C6F9E730884D06E59EB; // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_335[0x3];                                      // 0x0335(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CloseRightGate;                                    // 0x0338(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         OpenRightGate_NewTrack_0_CD9399124A132B2FB51C42AE7D63BE9E; // 0x0340(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenRightGate__Direction_CD9399124A132B2FB51C42AE7D63BE9E; // 0x0344(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_345[0x3];                                      // 0x0345(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenRightGate;                                     // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         OpenLeftGate_NewTrack_0_AEF83FF34F3F2E248CF4669F91674A90; // 0x0350(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            OpenLeftGate__Direction_AEF83FF34F3F2E248CF4669F91674A90; // 0x0354(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_355[0x3];                                      // 0x0355(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     OpenLeftGate;                                      // 0x0358(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AlreadyOpen_;                                      // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateGate(bool Condition);
	void ChangeActivateObjectState(EActivatedObjectState NewState);
	void CloseLeftGate__FinishedFunc();
	void CloseLeftGate__UpdateFunc();
	void CloseRightGate__FinishedFunc();
	void CloseRightGate__UpdateFunc();
	void ExecuteUbergraph_BP_BearGates(int32 EntryPoint);
	void OpenLeftGate__FinishedFunc();
	void OpenLeftGate__UpdateFunc();
	void OpenRightGate__FinishedFunc();
	void OpenRightGate__UpdateFunc();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_BearGates_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_BearGates_C")
	}
	static class ABP_BearGates_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BearGates_C>();
	}
};
DUMPER7_ASSERTS_ABP_BearGates_C;

}

