#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EnemyWaves

#include "Basic.hpp"

#include "FEnemyWave_structs.hpp"
#include "Engine_structs.hpp"
#include "BP_SplineVolumeBase_classes.hpp"
#include "GameDifficultyModule_structs.hpp"
#include "FEnemyWaves_structs.hpp"
#include "EWaveSpawnConditionLogic_structs.hpp"
#include "AIModule_structs.hpp"
#include "EWaveUnitType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EnemyWaves.BP_EnemyWaves_C
// 0x00F0 (0x0448 - 0x0358)
class ABP_EnemyWaves_C final : public ABP_SplineVolumeBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_EnemyWaves_C;                    // 0x0358(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          CanBeTriggeredByCollision;                         // 0x0360(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReactOnHorse;                                      // 0x0361(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRestoring;                                       // 0x0362(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoRestoreAfterTime;                              // 0x0363(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RestoreAmount;                                     // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AutoRestoreTime;                                   // 0x0368(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<EGameDifficulty, struct FFEnemyWaves>    Waves;                                             // 0x0370(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference)
	TArray<struct FFEnemyWave>                    CurrentSetup;                                      // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         NumToKill;                                         // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              D_AllWavesCleared;                                 // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class ADefaultCharacter*>              CurrentWaveCharacters;                             // 0x03E8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                           SpawnNextWaveTimerHandle;                          // 0x03F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RestoringTimerHandle;                              // 0x0400(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RestoringSaveTime;                                 // 0x0408(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalAliveCharacters;                              // 0x040C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWaveSpawnConditionLogic                      CurrentConditionType;                              // 0x0410(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TimerCondition;                                    // 0x0411(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          KilledCondition;                                   // 0x0412(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_413[0x5];                                      // 0x0413(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class ANPC_CH_C* NewCharacter)> D_OnWaveCharacterSpawned;          // 0x0418(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          IsWavesInProgress;                                 // 0x0428(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         UnitTypeSpawnIndex;                                // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         UnitSpawnNum;                                      // 0x0430(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Destroy_After_Death;                               // 0x0434(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_435[0x3];                                      // 0x0435(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Destroy_After_Death_Distance;                      // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutOfRestoring;                                    // 0x0440(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActorLoaded();
	void ActorPreSave();
	void ActorSaved();
	void BeginOverlapEvent(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void CheckTrigger(const class AActor* EnteredActor, bool* Result);
	void CheckValidTag();
	void ComponentsToSave(TArray<class UActorComponent*>* Components);
	void ExecuteUbergraph_BP_EnemyWaves(int32 EntryPoint);
	void FinishWaves();
	void Get_Points_Out_Of_Vision(TArray<TSoftObjectPtr<class ABP_WaveUnitSpawnPoint_C>>& Array, TArray<class ABP_WaveUnitSpawnPoint_C*>* AvailablePoints);
	void GetCurrentWaveCharacters(TArray<class ADefaultCharacter*>* CurrentWaveCharacters_0);
	void GetDifficultySetup(TArray<struct FFEnemyWave>* Waves_0);
	struct FTransform GetTransformForSpawnpoint(TArray<class ABP_WaveUnitSpawnPoint_C*>& AvailablePoints, const TArray<TSoftObjectPtr<class ABP_WaveUnitSpawnPoint_C>>& AllPossiblePoints, class ABP_WaveUnitSpawnPoint_C** Selected1);
	bool IsActorOnSreen(class AActor* Target);
	void OnCharacterDied_Event(class ADefaultCharacter* DiedCharacter);
	void OnQueryFinishedEvent_Event(class UEnvQueryInstanceBlueprintWrapper* QueryInstance, EEnvQueryStatus QueryStatus);
	void OutOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void PrepareSpawnPoints(TArray<struct FFEnemyWaveUnit>& Array);
	void ReceiveBeginPlay();
	void Restore();
	const struct FTransform SelectPointFromAvailable(const TArray<class ABP_WaveUnitSpawnPoint_C*>& TargetArray, class ABP_WaveUnitSpawnPoint_C** Selected1);
	struct FTransform SelectPointsFromAvailableSoft(const TArray<TSoftObjectPtr<class ABP_WaveUnitSpawnPoint_C>>& TargetArray, class ABP_WaveUnitSpawnPoint_C** Selected1);
	void SetCanBeTriggered(bool CanBeTriggered);
	void SetCanRestore(bool AutoRestoreAfterTime_0, bool SkipRestoringTimer);
	void SetRestoreAmount(int32 RestoreAmount_0, bool SkipRestoreTimer);
	void SetupCharacter(class ANPC_CH_NewBattleSystem_C* SpawnedCharacter);
	void SpawnNextUnit();
	void SpawnNextUnitType();
	void SpawnNextWave();
	void StartRestoring(float Time);
	void StartWaves();
	void TimerToNextWaveElapsed();
	void TracesCheck(const struct FVector& ActorLocation, bool* TracesVisible);
	void ValidateSpawnPoints();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_EnemyWaves_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_EnemyWaves_C")
	}
	static class ABP_EnemyWaves_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EnemyWaves_C>();
	}
};
DUMPER7_ASSERTS_ABP_EnemyWaves_C;

}

