#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FractionInfluenceChangeHintData

#include "Basic.hpp"

#include "Smuta_structs.hpp"


namespace SDK::Params
{

// Function BP_FractionInfluenceChangeHintData.BP_FractionInfluenceChangeHintData_C.ExecuteUbergraph_BP_FractionInfluenceChangeHintData
// 0x0004 (0x0004 - 0x0000)
struct BP_FractionInfluenceChangeHintData_C_ExecuteUbergraph_BP_FractionInfluenceChangeHintData final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_FractionInfluenceChangeHintData_C_ExecuteUbergraph_BP_FractionInfluenceChangeHintData;

// Function BP_FractionInfluenceChangeHintData.BP_FractionInfluenceChangeHintData_C.OnTabMenuOpened
// 0x0018 (0x0018 - 0x0000)
struct BP_FractionInfluenceChangeHintData_C_OnTabMenuOpened final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Character_C*                   K2Node_DynamicCast_AsUI_Menu_Character;            // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_FractionInfluenceChangeHintData_C_OnTabMenuOpened;

// Function BP_FractionInfluenceChangeHintData.BP_FractionInfluenceChangeHintData_C.BP_IsValidData
// 0x0068 (0x0068 - 0x0000)
struct BP_FractionInfluenceChangeHintData_C_BP_IsValidData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ESmutaDLCFraction, float>                CallFunc_GetLastUnseenFractionsInfluenceChanges_ReturnValue; // 0x0008(0x0050)()
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Map_Find_Value;                           // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_FractionInfluenceChangeHintData_C_BP_IsValidData;

}

