#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FractionMemberCarouselItemData

#include "Basic.hpp"

#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_FractionMemberCarouselItemData.BP_FractionMemberCarouselItemData_C
// 0x00A0 (0x00C8 - 0x0028)
class UBP_FractionMemberCarouselItemData_C final : public UCarouselItemData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFractionMemberData                    FractionMemberData;                                // 0x0030(0x0088)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FName                                   FractionMemberId;                                  // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ESmutaDLCFraction                             Fraction;                                          // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FFractionMemberProgressionInfo         FractionMemberProgressionInfo;                     // 0x00C1(0x0001)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)

public:
	void BP_OnInitialize();
	void ExecuteUbergraph_BP_FractionMemberCarouselItemData(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_FractionMemberCarouselItemData_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_FractionMemberCarouselItemData_C")
	}
	static class UBP_FractionMemberCarouselItemData_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_FractionMemberCarouselItemData_C>();
	}
};
DUMPER7_ASSERTS_UBP_FractionMemberCarouselItemData_C;

}

