#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameMode_DLC_MainMenu

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameMode_DLC_MainMenu.BP_GameMode_DLC_MainMenu_C.ExecuteUbergraph_BP_GameMode_DLC_MainMenu
// 0x0028 (0x0028 - 0x0000)
struct BP_GameMode_DLC_MainMenu_C_ExecuteUbergraph_BP_GameMode_DLC_MainMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputPresetSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_SmutaInstance_C*                    CallFunc_GetSmutaInstance_AsBP_Smuta_Instance;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputPresetSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputMappingPreset*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_GameMode_DLC_MainMenu_C_ExecuteUbergraph_BP_GameMode_DLC_MainMenu;

}

