#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HourglassOverlay

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HourglassOverlay.BP_HourglassOverlay_C
// 0x0030 (0x01D8 - 0x01A8)
class UBP_HourglassOverlay_C : public UOverlay
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x01A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHourglassMechanism*                    Visibility_Hourglass;                              // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              On_Value_Change_Finished;                          // 0x01B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Param_Magnitude_Min;                               // 0x01C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Param_Magnitude_Max;                               // 0x01D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Change_Magnitudes(double New_Min_Magnitude, double New_Max_Magnitude);
	void Change_Ratio(double New_Ratio);
	void Change_Time(double New_Time);
	void Change_Value(bool bNew_Visible);
	void ExecuteUbergraph_BP_HourglassOverlay(int32 EntryPoint);
	void Force_Finish_Value_Changing_Instantly();
	void Initialize(double Initial_Time, double Initial_Param_Magnitude_Min, double Initial_Param_Magnitude_Max);
	void On_Hourglass_Value_Changing_Finished();
	void Update(double Delta_Time);
	void Update_Param();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_HourglassOverlay_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_HourglassOverlay_C")
	}
	static class UBP_HourglassOverlay_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_HourglassOverlay_C>();
	}
};
DUMPER7_ASSERTS_UBP_HourglassOverlay_C;

}

