#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HourglassOverlay

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HourglassOverlay.BP_HourglassOverlay_C.Change Magnitudes
// 0x0010 (0x0010 - 0x0000)
struct BP_HourglassOverlay_C_Change_Magnitudes final
{
public:
	double                                        New_Min_Magnitude;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        New_Max_Magnitude;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HourglassOverlay_C_Change_Magnitudes;

// Function BP_HourglassOverlay.BP_HourglassOverlay_C.Change Ratio
// 0x0010 (0x0010 - 0x0000)
struct BP_HourglassOverlay_C_Change_Ratio final
{
public:
	double                                        New_Ratio;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ChangeRatio_NewRatio_ImplicitCast;        // 0x0008(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HourglassOverlay_C_Change_Ratio;

// Function BP_HourglassOverlay.BP_HourglassOverlay_C.Change Time
// 0x0010 (0x0010 - 0x0000)
struct BP_HourglassOverlay_C_Change_Time final
{
public:
	double                                        New_Time;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ChangeTime_NewTime_ImplicitCast;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HourglassOverlay_C_Change_Time;

// Function BP_HourglassOverlay.BP_HourglassOverlay_C.Change Value
// 0x0001 (0x0001 - 0x0000)
struct BP_HourglassOverlay_C_Change_Value final
{
public:
	bool                                          bNew_Visible;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HourglassOverlay_C_Change_Value;

// Function BP_HourglassOverlay.BP_HourglassOverlay_C.ExecuteUbergraph_BP_HourglassOverlay
// 0x0004 (0x0004 - 0x0000)
struct BP_HourglassOverlay_C_ExecuteUbergraph_BP_HourglassOverlay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HourglassOverlay_C_ExecuteUbergraph_BP_HourglassOverlay;

// Function BP_HourglassOverlay.BP_HourglassOverlay_C.Initialize
// 0x0038 (0x0038 - 0x0000)
struct BP_HourglassOverlay_C_Initialize final
{
public:
	double                                        Initial_Time;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Initial_Param_Magnitude_Min;                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Initial_Param_Magnitude_Max;                       // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHourglassMechanism*                    CallFunc_SpawnObject_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HourglassOverlay_C_Initialize;

// Function BP_HourglassOverlay.BP_HourglassOverlay_C.Update
// 0x0020 (0x0020 - 0x0000)
struct BP_HourglassOverlay_C_Update final
{
public:
	double                                        Delta_Time;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          L_Was_Changing;                                    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Update_InDeltaTime_ImplicitCast;          // 0x0018(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_HourglassOverlay_C_Update;

}

