#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionObjectBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.BndEvt__BP_InteractionObject_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractionObjectBase_C_BndEvt__BP_InteractionObject_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_BndEvt__BP_InteractionObject_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.BndEvt__BP_InteractionObject_Interaction_K2Node_ComponentBoundEvent_3_InteractionBaseDelegate__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionObjectBase_C_BndEvt__BP_InteractionObject_Interaction_K2Node_ComponentBoundEvent_3_InteractionBaseDelegate__DelegateSignature final
{
public:
	bool                                          HasEntered;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_BndEvt__BP_InteractionObject_Interaction_K2Node_ComponentBoundEvent_3_InteractionBaseDelegate__DelegateSignature;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.BndEvt__BP_InteractionObjectBase_BP_QuestMarker_K2Node_ComponentBoundEvent_1_OnQuestMarkerShown__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionObjectBase_C_BndEvt__BP_InteractionObjectBase_BP_QuestMarker_K2Node_ComponentBoundEvent_1_OnQuestMarkerShown__DelegateSignature final
{
public:
	bool                                          IsActive;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_BndEvt__BP_InteractionObjectBase_BP_QuestMarker_K2Node_ComponentBoundEvent_1_OnQuestMarkerShown__DelegateSignature;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.ComponentsToSave
// 0x0010 (0x0010 - 0x0000)
struct BP_InteractionObjectBase_C_ComponentsToSave final
{
public:
	TArray<class UActorComponent*>                Components;                                        // 0x0000(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_ComponentsToSave;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.ExecuteUbergraph_BP_InteractionObjectBase
// 0x0048 (0x0048 - 0x0000)
struct BP_InteractionObjectBase_C_ExecuteUbergraph_BP_InteractionObjectBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedActor;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_HasEntered;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   CallFunc_Conv_ClassToSoftClassReference_ReturnValue; // 0x0018(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          K2Node_Event_On;                                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_isActive;               // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_ExecuteUbergraph_BP_InteractionObjectBase;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.SetEnable
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionObjectBase_C_SetEnable final
{
public:
	bool                                          Enable_0;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_SetEnable;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.Show
// 0x0004 (0x0004 - 0x0000)
struct BP_InteractionObjectBase_C_Show final
{
public:
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_Show;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.Toggle
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionObjectBase_C_Toggle final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_Toggle;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.Triggered
// 0x0018 (0x0018 - 0x0000)
struct BP_InteractionObjectBase_C_Triggered final
{
public:
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryActivateAbilityByClass_ReturnValue;    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_Triggered;

// Function BP_InteractionObjectBase.BP_InteractionObjectBase_C.UserConstructionScript
// 0x0014 (0x0014 - 0x0000)
struct BP_InteractionObjectBase_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E[0x2];                                        // 0x000E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionObjectBase_C_UserConstructionScript;

}

