#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_IngameHUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_HUDStates_structs.hpp"
#include "Smuta_classes.hpp"
#include "UMG_structs.hpp"
#include "FlexibleQuestsRuntime_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_IngameHUD.BP_IngameHUD_C
// 0x0088 (0x0410 - 0x0388)
class ABP_IngameHUD_C final : public AIngameHUD
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0388(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0390(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	E_HUDStates                                   CurrentState;                                      // 0x0398(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_HUDStates                                   PreviousState;                                     // 0x0399(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Container_HUD_C*                    HUD_Ref;                                           // 0x03A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Menu_Base_C*                        UI_Munu_Death;                                     // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(E_HUDStates NewState, E_HUDStates OldState)> OnHudStateChanged;    // 0x03B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AHuman_CH_C*                            DelayedBoss;                                       // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UGenericQuest*>                  NewQuestsToNotify;                                 // 0x03C8(0x0010)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void()>              OnQuestToNotify;                                   // 0x03D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnCodexArticleToNotify;                            // 0x03E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FName>                           NewCodexArticleIdsToNotify;                        // 0x03F8(0x0010)(Edit, BlueprintVisible)
	bool                                          bIsRenderedWorldWidgets;                           // 0x0408(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_IngameHUD(int32 EntryPoint);
	void InitHUD();
	void OnCodexArticleOpened(const class FName& ArticleId);
	void OnCutsceneFinished(class ULevelSequence* Cutscene);
	void OnCutsceneStarted(class ULevelSequence* Cutscene, class ULevelSequencePlayer* Player);
	void OnQuestFinished(class UGenericQuest* FinishedQuest, EQuestResult FinishResult);
	void OnQuestStarted(class UGenericQuest* StartedQuest);
	void PreSaveDelegate_Event();
	void ReceiveBeginPlay();
	void SetHUDState(E_HUDStates State);
	void SetInputMode(bool UI, bool ShowCursor);
	void ShowBossBar(class AHuman_CH_C* Boss);
	void ShowComboHint(const class FName& HintName, const class UTutorialComboHintContent* HintContent);
	void ShowNonBlockingHint(const class FName& HintName, const class UTutorialNonBlockingHintContent* HintContent);
	void ShowPopupHint(const class FName& HintName, const class UTutorialBasePopupHintContent* HintContent);
	void ShowTABSubscreen(int32 Index_0);
	void ShowTagEventComboHint(const class FName& HintName, const class UTutorialTagEventComboContent* HintContent);
	void ShowVersion(bool Show);
	void TryReinitInput_TimeFix();
	void w_mainhudr(bool Rendered);
	void w_tutorialr(bool Rendered);
	void w_worldinteractionr(bool Rendered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_IngameHUD_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_IngameHUD_C")
	}
	static class ABP_IngameHUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_IngameHUD_C>();
	}
};
DUMPER7_ASSERTS_ABP_IngameHUD_C;

}

