#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InteractionComponent

#include "Basic.hpp"

#include "EInteractionType_structs.hpp"


namespace SDK::Params
{

// Function BP_InteractionComponent.BP_InteractionComponent_C.BPI_getDialogComponent
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractionComponent_C_BPI_getDialogComponent final
{
public:
	class UBP_Ink_Dialog_Component_C*             Ref_DialogComponent;                               // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionComponent_C_BPI_getDialogComponent;

// Function BP_InteractionComponent.BP_InteractionComponent_C.ExecuteUbergraph_BP_InteractionComponent
// 0x0060 (0x0060 - 0x0000)
struct BP_InteractionComponent_C_ExecuteUbergraph_BP_InteractionComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_BaseTrigger_C*                      K2Node_Event_Object;                               // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interact_C>       K2Node_DynamicCast_AsBPI_Interact;                 // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInteractionType                              K2Node_Event_InteractionType;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interact_C>       CallFunc_CloseInteractPrompt_self_CastInput;       // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInViewport_ReturnValue;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBPI_Interact_C>       CallFunc_ShowInteractPrompt_self_CastInput;        // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_InteractionPrompt_C*                CallFunc_Create_ReturnValue;                       // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionComponent_C_ExecuteUbergraph_BP_InteractionComponent;

// Function BP_InteractionComponent.BP_InteractionComponent_C.SetInteractionObject
// 0x0008 (0x0008 - 0x0000)
struct BP_InteractionComponent_C_SetInteractionObject final
{
public:
	class ABP_BaseTrigger_C*                      Object;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionComponent_C_SetInteractionObject;

// Function BP_InteractionComponent.BP_InteractionComponent_C.ShowInteractPrompt
// 0x0001 (0x0001 - 0x0000)
struct BP_InteractionComponent_C_ShowInteractPrompt final
{
public:
	EInteractionType                              InteractionType;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InteractionComponent_C_ShowInteractPrompt;

}

