#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_InventoryComponent

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_InventoryComponent.BP_InventoryComponent_C.AddItemsToInventory
// 0x0028 (0x0028 - 0x0000)
struct BP_InventoryComponent_C_AddItemsToInventory final
{
public:
	TArray<class UDA_InventoryItem_C*>            Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 Amount;                                            // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         L_CurrentIndex;                                    // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_AddItemsToInventory;

// Function BP_InventoryComponent.BP_InventoryComponent_C.AddItemToSlot
// 0x0018 (0x0018 - 0x0000)
struct BP_InventoryComponent_C_AddItemToSlot final
{
public:
	class UDA_InventoryItem_C*                    Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_AmountToAdd;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_IndexToAdd;                                      // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_FreeSlotIndex;                                   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_AddItemToSlot;

// Function BP_InventoryComponent.BP_InventoryComponent_C.AddMoneyToSlot
// 0x0004 (0x0004 - 0x0000)
struct BP_InventoryComponent_C_AddMoneyToSlot final
{
public:
	int32                                         Amount;                                            // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_AddMoneyToSlot;

// Function BP_InventoryComponent.BP_InventoryComponent_C.ExecuteUbergraph_BP_InventoryComponent
// 0x0004 (0x0004 - 0x0000)
struct BP_InventoryComponent_C_ExecuteUbergraph_BP_InventoryComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_ExecuteUbergraph_BP_InventoryComponent;

// Function BP_InventoryComponent.BP_InventoryComponent_C.FindFreeSlot
// 0x000C (0x000C - 0x0000)
struct BP_InventoryComponent_C_FindFreeSlot final
{
public:
	bool                                          Found;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FreeSlotIndex;                                     // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         l_Slot;                                            // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_FindFreeSlot;

// Function BP_InventoryComponent.BP_InventoryComponent_C.FindSameItem
// 0x0018 (0x0018 - 0x0000)
struct BP_InventoryComponent_C_FindSameItem final
{
public:
	class UDA_InventoryItem_C*                    Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Found;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexToAddAmount;                                  // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         AmountToAdd;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         L_Index;                                           // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_FindSameItem;

// Function BP_InventoryComponent.BP_InventoryComponent_C.GetItemAtSlot
// 0x0018 (0x0018 - 0x0000)
struct BP_InventoryComponent_C_GetItemAtSlot final
{
public:
	int32                                         Slot;                                              // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_InventoryItem_C*                    Item;                                              // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Amount;                                            // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_GetItemAtSlot;

// Function BP_InventoryComponent.BP_InventoryComponent_C.getItems
// 0x0040 (0x0040 - 0x0000)
struct BP_InventoryComponent_C_getItems final
{
public:
	TArray<class UDA_InventoryItem_C*>            Items;                                             // 0x0000(0x0010)(Parm, OutParm)
	TArray<int32>                                 Amount;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<int32>                                 l_Amount;                                          // 0x0020(0x0010)(Edit, BlueprintVisible)
	TArray<class UDA_InventoryItem_C*>            L_Items;                                           // 0x0030(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_getItems;

// Function BP_InventoryComponent.BP_InventoryComponent_C.GetMoney
// 0x0004 (0x0004 - 0x0000)
struct BP_InventoryComponent_C_GetMoney final
{
public:
	int32                                         MoneyAmount;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_InventoryComponent_C_GetMoney;

}

