#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_OutpostGates

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_OutpostGates.BP_OutpostGates_C
// 0x0030 (0x02C8 - 0x0298)
class ABP_OutpostGates_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   TriggerA;                                          // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UChildActorComponent*                   TriggerB;                                          // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          New_Hidden;                                        // 0x02C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateTrigger(class UChildActorComponent* Trigger, bool Activate);
	void ExecuteUbergraph_BP_OutpostGates(int32 EntryPoint);
	void HideGates(bool IsHidden);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_OutpostGates_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_OutpostGates_C")
	}
	static class ABP_OutpostGates_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_OutpostGates_C>();
	}
};
DUMPER7_ASSERTS_ABP_OutpostGates_C;

}

