#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PC_Datadriven

#include "Basic.hpp"

#include "ELockMode_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EAnimCommands_structs.hpp"
#include "Relation_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "ENPCAction_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PC_Datadriven.BP_PC_Datadriven_C
// 0x0160 (0x07E0 - 0x0680)
class ABP_PC_Datadriven_C final : public ACharacter
{
public:
	uint8                                         Pad_678[0x8];                                      // 0x0678(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0680(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_QuestMarker_C*                      BP_QuestMarker;                                    // 0x0688(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_Ink_Dialog_Component_C*             BP_Ink_Dialog_Component;                           // 0x0690(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       LockTargetWidget;                                  // 0x0698(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       HealthBarWidget;                                   // 0x06A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_CharAudio_C*                       BPC_CharAudio;                                     // 0x06A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPawnSensingComponent*                  PawnSensing;                                       // 0x06B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPawnNoiseEmitterComponent*             PawnNoiseEmitter;                                  // 0x06B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      Char2CharCollision;                                // 0x06C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CombatRange;                                       // 0x06C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCameraComponent*                       Camera;                                            // 0x06D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpringArmComponent*                    SpringArm;                                         // 0x06D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cone;                                              // 0x06E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      DamageCapsule;                                     // 0x06E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         CollisionGrowTimeline_RadiusTrack_DD460C534ED6F73C41ECAD8C96AC1717; // 0x06F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            CollisionGrowTimeline__Direction_DD460C534ED6F73C41ECAD8C96AC1717; // 0x06F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6F5[0x3];                                      // 0x06F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     CollisionGrowTimeline;                             // 0x06F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCharacter_Traits_C*                    Traits;                                            // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsArmed;                                           // 0x0708(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_709[0x7];                                      // 0x0709(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 LockTarget;                                        // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CombatTargets;                                     // 0x0718(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	ELockMode                                     LockMode;                                          // 0x0728(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_729[0x7];                                      // 0x0729(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ManualLockRadius;                                  // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           EndCombatTimer;                                    // 0x0738(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               TargetRotation;                                    // 0x0740(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Debug;                                             // 0x0758(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_759[0x7];                                      // 0x0759(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TargetAngle;                                       // 0x0760(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FleeAngle;                                         // 0x0768(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterEquipment_C*                  Equipment;                                         // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UNPC_AI_Traits_C*                       AI_Traits;                                         // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBattle_Traits_C*                       BattleTraits;                                      // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                 PotentialTarget;                                   // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(bool Left, bool Right, class UPhysicalMaterial* ground)> CharFootstep; // 0x0790(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(EAnimCommands Action)> CharAuidoAction;                            // 0x07A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        Char2CharCollisionRadius;                          // 0x07B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UPassport_C*                            Passport;                                          // 0x07B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ERelation                                     Relation;                                          // 0x07C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Hidden_UI;                                         // 0x07C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C2[0x6];                                      // 0x07C2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_ActionPoint_C*>              ActionPoints;                                      // 0x07C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)

public:
	void AniInterfaceUpdate();
	bool ApplyTraits();
	void BndEvt__BP_PC_Datadriven_CombatRange_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Changed_Armed_State(bool NewArmed);
	void ChangeEquipment(class UCharacterEquipment_C* NewEquip);
	void CollisionGrowTimeline__FinishedFunc();
	void CollisionGrowTimeline__UpdateFunc();
	void Death();
	void ExecuteUbergraph_BP_PC_Datadriven(int32 EntryPoint);
	void Filter_Targets_in_Radius(TArray<class AActor*>& Targets, double Radius, TArray<class AActor*>* Return);
	void FilterTargetsInAngle(TArray<class AActor*>& Targets, double _Angle, TArray<class AActor*>* Filtered);
	void FindClosestTarget(TArray<class AActor*>& _Targets, class AActor** Return);
	void FindClosestToAim(TArray<class AActor*>& _Targets, class AActor** Return);
	void FindNextTarget();
	void ForceAction(ENPCAction::ENPCAction Action);
	void GetCameraVectors(struct FVector* Forward, struct FVector* Right);
	void GetDamageTargets(bool FriendlyFire, TArray<class AActor*>* ActorsHit);
	void getDialogComponent(class UBP_Ink_Dialog_Component_C** Ref_DialigComponent);
	void getPassport(class UPassport_C** Passport_0);
	void getTriggerBoxID(class FString* ID);
	void GrowChar2CharCollision();
	void InitHudHealth(int32 MaxHealth);
	void InitLockTargetWidget();
	void Is_in_Combat(bool* InCombat);
	void IsInCombat(bool* Return);
	void IsRunning(bool* Running);
	void LockCamera();
	void ProcessDamage(double Damage);
	void ReceiveAnyDamage(float Damage, const class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void ReceiveBeginPlay();
	void ReceivePossessed(class AController* NewController);
	void ReceiveTick(float DeltaSeconds);
	void ReduceChar2CharCollision();
	void Request_stance(int32 Type);
	void RequestHeavyAttack();
	void RequestLightAttack();
	void ResetManualTargetLock();
	void Set_Pasport_for_Player();
	void SetSprinting(const bool newWalking, bool NewSprinting);
	void SetTargetLock(class AActor* NewTargetLock, bool WithDelay);
	void ShowEnemyHealthBar(bool Show);
	void ShowLockTarget(bool Show);
	void Stelth(int32 Stelth_0);
	void TryToggleManualLock(bool State);
	void UnlockCamera();
	void Update_Aggro();
	void Update_Target_Lock();
	void UpdateCamera();
	void UpdateCombatRotation();
	void UpdateHudHealth(int32 HealthCurrent);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PC_Datadriven_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PC_Datadriven_C")
	}
	static class ABP_PC_Datadriven_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PC_Datadriven_C>();
	}
};
DUMPER7_ASSERTS_ABP_PC_Datadriven_C;

}

