#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestSaveData

#include "Basic.hpp"

#include "BP_QuestTaskInfoStruct_structs.hpp"
#include "FDialogueSystemData_structs.hpp"
#include "BP_StoryProgressStruct_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestSaveData.BP_QuestSaveData_C.LoadDialogueData
// 0x0140 (0x0140 - 0x0000)
struct BP_QuestSaveData_C_LoadDialogueData final
{
public:
	struct FFDialogueSystemData                   Result;                                            // 0x0000(0x0140)(Parm, OutParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestSaveData_C_LoadDialogueData;

// Function BP_QuestSaveData.BP_QuestSaveData_C.LoadQuestData
// 0x0160 (0x0160 - 0x0000)
struct BP_QuestSaveData_C_LoadQuestData final
{
public:
	TMap<class FString, class UBP_StoryPrgress_C*> StoryProgress_0;                                  // 0x0000(0x0050)(Parm, OutParm)
	TMap<class FString, class UBP_StoryPrgress_C*> StoryProgressMap;                                 // 0x0050(0x0050)(Edit, BlueprintVisible)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_StoryPrgress_C*                     CallFunc_SpawnObject_ReturnValue;                  // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FBP_StoryProgressStruct                CallFunc_Array_Get_Item;                           // 0x00B8(0x0078)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_135[0x3];                                      // 0x0135(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0138(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UDlgDialogue*                           K2Node_DynamicCast_AsDlg_Dialogue;                 // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_149[0x7];                                      // 0x0149(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UBP_Task_C*>                     CallFunc_MakeTasks_Result;                         // 0x0150(0x0010)(ReferenceParm)
};
DUMPER7_ASSERTS_BP_QuestSaveData_C_LoadQuestData;

// Function BP_QuestSaveData.BP_QuestSaveData_C.MakeQuestTaskInfos
// 0x0070 (0x0070 - 0x0000)
struct BP_QuestSaveData_C_MakeQuestTaskInfos final
{
public:
	TArray<class UBP_Task_C*>                     Tasks;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FBP_QuestTaskInfoStruct>        Result;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<struct FBP_QuestTaskInfoStruct>        OutputTasks;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Task_C*                             CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBP_QuestTaskInfoStruct                K2Node_MakeStruct_BP_QuestTaskInfoStruct;          // 0x0050(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestSaveData_C_MakeQuestTaskInfos;

// Function BP_QuestSaveData.BP_QuestSaveData_C.MakeTasks
// 0x0070 (0x0070 - 0x0000)
struct BP_QuestSaveData_C_MakeTasks final
{
public:
	TArray<struct FBP_QuestTaskInfoStruct>        Tasks;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<class UBP_Task_C*>                     Result;                                            // 0x0010(0x0010)(Parm, OutParm)
	TArray<class UBP_Task_C*>                     OutputTasks;                                       // 0x0020(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_Task_C*                             CallFunc_SpawnObject_ReturnValue;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FBP_QuestTaskInfoStruct                CallFunc_Array_Get_Item;                           // 0x0048(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestSaveData_C_MakeTasks;

// Function BP_QuestSaveData.BP_QuestSaveData_C.SaveDialogueData
// 0x0140 (0x0140 - 0x0000)
struct BP_QuestSaveData_C_SaveDialogueData final
{
public:
	struct FFDialogueSystemData                   DialogueData;                                      // 0x0000(0x0140)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestSaveData_C_SaveDialogueData;

// Function BP_QuestSaveData.BP_QuestSaveData_C.SaveQuestData
// 0x0150 (0x0150 - 0x0000)
struct BP_QuestSaveData_C_SaveQuestData final
{
public:
	TMap<class FString, class UBP_StoryPrgress_C*> Story;                                            // 0x0000(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         CallFunc_Map_Keys_Keys;                            // 0x0058(0x0010)(ReferenceParm)
	class FString                                 CallFunc_Array_Get_Item;                           // 0x0068(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_StoryPrgress_C*                     CallFunc_Map_Find_Value;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDlgDialogue>            CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0098(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FBP_QuestTaskInfoStruct>        CallFunc_MakeQuestTaskInfos_Result;                // 0x00C0(0x0010)(ReferenceParm)
	struct FBP_StoryProgressStruct                K2Node_MakeStruct_BP_StoryProgressStruct;          // 0x00D0(0x0078)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestSaveData_C_SaveQuestData;

}

