#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QuestMarker

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_QuestMarker.BP_QuestMarker_C.ExecuteUbergraph_BP_QuestMarker
// 0x0010 (0x0010 - 0x0000)
struct BP_QuestMarker_C_ExecuteUbergraph_BP_QuestMarker final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUI_Menu_Base_C*                        K2Node_CustomEvent_CurrentMenu;                    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestMarker_C_ExecuteUbergraph_BP_QuestMarker;

// Function BP_QuestMarker.BP_QuestMarker_C.GetMarker
// 0x0010 (0x0010 - 0x0000)
struct BP_QuestMarker_C_GetMarker final
{
public:
	class UUI_Minimap_QuestMarker_C*              marker;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestMarker_C_GetMarker;

// Function BP_QuestMarker.BP_QuestMarker_C.OnHUDLayerChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_QuestMarker_C_OnHUDLayerChanged final
{
public:
	class UUI_Menu_Base_C*                        CurrentMenu;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestMarker_C_OnHUDLayerChanged;

// Function BP_QuestMarker.BP_QuestMarker_C.ShowQuestMarker
// 0x0005 (0x0005 - 0x0000)
struct BP_QuestMarker_C_ShowQuestMarker final
{
public:
	bool                                          IsActive_0;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestMarker_C_ShowQuestMarker;

// Function BP_QuestMarker.BP_QuestMarker_C.UpdateStatus
// 0x0020 (0x0020 - 0x0000)
struct BP_QuestMarker_C_UpdateStatus final
{
public:
	class UUI_Minimap_QuestMarker_C*              CallFunc_GetMarker_Marker;                         // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Minimap_QuestMarker_C*              CallFunc_GetMarker_Marker_1;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_Minimap_QuestMarker_C*              CallFunc_GetMarker_Marker_2;                       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue_1;            // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ComponentHasTag_ReturnValue_2;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_QuestMarker_C_UpdateStatus;

}

