#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ScreenshotManager

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ScreenshotManager.BP_ScreenshotManager_C
// 0x0718 (0x09B0 - 0x0298)
class ABP_ScreenshotManager_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPostProcessSettings                   CurrentPostProcess;                                // 0x02B0(0x06E0)(Edit, BlueprintVisible, ExposeOnSpawn)
	double                                        CurrentFOV;                                        // 0x0990(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 RenderTargetTexture;                               // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentTimeDilation;                               // 0x09A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUI_PhotoMode_C*                        PhotoModeWidgetRef;                                // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_ScreenshotManager(int32 EntryPoint);
	void ReceiveTick(float DeltaSeconds);
	void TakeScreenshot(const struct FIntPoint& Size, const class FString& Path, const class FString& Filename);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_ScreenshotManager_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_ScreenshotManager_C")
	}
	static class ABP_ScreenshotManager_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ScreenshotManager_C>();
	}
};
DUMPER7_ASSERTS_ABP_ScreenshotManager_C;

}

