#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmutaInstance

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FDialogueSystemData_structs.hpp"
#include "SCodexArticleState_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SmutaInstance.BP_SmutaInstance_C
// 0x0288 (0x0488 - 0x0200)
class UBP_SmutaInstance_C final : public USmutaGameInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0200(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_GameSettings_C*                     Settings;                                          // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FString                                 SettingsSlotName;                                  // 0x0210(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UDA_InventoryItem_C*>            InventoryItems;                                    // 0x0220(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 InventoryItemsAmount;                              // 0x0230(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UBP_SmutaSaveGame_C*                    SaveGameVar;                                       // 0x0240(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UGlobalConstants_Base_C*                GlobalConstants;                                   // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<class FString, class UBP_StoryPrgress_C*> quests;                                           // 0x0250(0x0050)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FName                                   WaypointTag;                                       // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ScenarioTag;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GlobalMapCameraHeight;                             // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HorseTransform;                                    // 0x02B8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(const class FString& Param)> OnQuestEvent;                         // 0x02D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<class FString>                         QuestID_Arr;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 CurrentQuestID;                                    // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FFDialogueSystemData                   DialogueSystemData;                                // 0x0300(0x0140)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnLoadGameComplete;                                // 0x0440(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class ULevelSequencePlayer*                   SequencePlayer;                                    // 0x0450(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSCodexArticleState>            CodexState;                                        // 0x0458(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          ShowDebugCodexData;                                // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_469[0x7];                                      // 0x0469(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 LastActiveAppearance;                              // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UClass*>                         LastInventoryItems;                                // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void AddCodexArticleState(class FName ArticleId);
	void ExecuteUbergraph_BP_SmutaInstance(int32 EntryPoint);
	void GetAllActorsWithTag(class FName Tag, TArray<class AActor*>* Actors);
	void GetCodexArticleIndex(class FName ArticleId, bool* Found, int32* Index_0);
	void GetCodexArticleState(class FName ArticleId, bool* Found, struct FSCodexArticleState* ArticleState);
	void GetLastLevel(class FString* LastLevel);
	void GetLastZone(int32* LastZone);
	void GetMainQuest(class UBP_StoryPrgress_C** MainQuest, bool* Valid);
	void Load_Global_Map(class FName ScenarioTag_0, class FName WaypointTag_0);
	void LoadGame(const class FString& Slot, int32 UserIndex);
	bool LoadGameData();
	void LoadSettings();
	void MarkerOff(class FName Tag);
	void MarkerOn(class FName Tag);
	void OnGameLoadFailed();
	void OnGamePostLoadFailedEvent();
	void QuestEvent(const class FString& Param);
	void ReceiveInit();
	void ReceiveShutdown();
	void SaveGame(const class FString& Slot, int32 UserIndex);
	bool SaveGameData();
	void SaveSettings();
	void SetCodexArticleRead(class FName ArticleId);
	void SetLastLevelAndZone(const class FString& LastLevel, int32 LastZone);
	void Skip_Cutscene();
	void SkipCutscene();
	void StartDialogue_DialogueSystem(class UDlgDialogue* DlgDialogue, class UDlgContext** DlgContext);
	void StartQuest(class UObject* QuestAsset);
	void StartQuest_DialogueSystem(class UDlgDialogue* QuestDialogueAsset);
	void UpdateAllQuests_DialogueSystem();
	void UpdateLevelVisited(const class FString& Level, bool* prevVisited);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_SmutaInstance_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_SmutaInstance_C")
	}
	static class UBP_SmutaInstance_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_SmutaInstance_C>();
	}
};
DUMPER7_ASSERTS_UBP_SmutaInstance_C;

}

