#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StoryProgressStruct

#include "Basic.hpp"

#include "BP_QuestTaskInfoStruct_structs.hpp"


namespace SDK
{

// UserDefinedStruct BP_StoryProgressStruct.BP_StoryProgressStruct
// 0x0078 (0x0078 - 0x0000)
struct FBP_StoryProgressStruct final
{
public:
	bool                                          IsMain_1_B4DB9BEE41BE9F27FFECFBA753333C1B;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Title_9_E0164138420B9370776313B08139B55C;          // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, HasGetValueTypeHash)
	TArray<class FString>                         Log_23_114A47CD44CCCB8FB012C0BB4270439F;           // 0x0018(0x0010)(Edit, BlueprintVisible, SaveGame)
	bool                                          OnKillExist_14_2AC6487544A20D8A632DE3A0F4B9BEE7;   // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnTriggerExist_15_6AC3C10F40FBCD4BEB1D729A17EF20B3; // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OnEventExist_24_758DEF9A4ED519A6D26709A3D8D9F3C5;  // 0x002A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B[0x5];                                       // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Key_29_CF6CF5B94902E1A377C56BA75013BFB1;           // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, HasGetValueTypeHash)
	TArray<struct FBP_QuestTaskInfoStruct>        Tasks_35_E6B9BA4D43F2FD90E6B20BB1096D3C70;         // 0x0040(0x0010)(Edit, BlueprintVisible, SaveGame)
	TSoftObjectPtr<class UDlgDialogue>            DialogueObject_39_178A6DDF43233BD79B3A0CAEA32E5BE0; // 0x0050(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FBP_StoryProgressStruct;

}

