#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spectator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Spectator.BP_Spectator_C
// 0x0028 (0x0348 - 0x0320)
class ABP_Spectator_C final : public APawn
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0320(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFloatingPawnMovement*                  FloatingPawnMovement;                              // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class APlayer_CH_C*                           PlayerPawn;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUserWidget*                            Widget;                                            // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Spectator(int32 EntryPoint);
	void InpActEvt_E_K2Node_InputKeyEvent_6(const struct FKey& Key);
	void InpActEvt_E_K2Node_InputKeyEvent_7(const struct FKey& Key);
	void InpActEvt_IA_Intuition_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Move_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_LeftControl_K2Node_InputKeyEvent_2(const struct FKey& Key);
	void InpActEvt_LeftControl_K2Node_InputKeyEvent_3(const struct FKey& Key);
	void InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_8(const struct FKey& Key);
	void InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_9(const struct FKey& Key);
	void InpActEvt_Q_K2Node_InputKeyEvent_4(const struct FKey& Key);
	void InpActEvt_Q_K2Node_InputKeyEvent_5(const struct FKey& Key);
	void InpActEvt_SpaceBar_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_SpaceBar_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void ReceivePossessed(class AController* NewController);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveUnpossessed(class AController* OldController);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Spectator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Spectator_C")
	}
	static class ABP_Spectator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Spectator_C>();
	}
};
DUMPER7_ASSERTS_ABP_Spectator_C;

}

