#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SmutaSaveGame

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_SmutaSaveGame.BP_SmutaSaveGame_C.GetLastLevel
// 0x0010 (0x0010 - 0x0000)
struct BP_SmutaSaveGame_C_GetLastLevel final
{
public:
	class FString                                 LastLevel_0;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SmutaSaveGame_C_GetLastLevel;

// Function BP_SmutaSaveGame.BP_SmutaSaveGame_C.GetLastZone
// 0x0004 (0x0004 - 0x0000)
struct BP_SmutaSaveGame_C_GetLastZone final
{
public:
	int32                                         LastZone_0;                                        // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SmutaSaveGame_C_GetLastZone;

// Function BP_SmutaSaveGame.BP_SmutaSaveGame_C.SetLastLevelAndZone
// 0x0018 (0x0018 - 0x0000)
struct BP_SmutaSaveGame_C_SetLastLevelAndZone final
{
public:
	class FString                                 Level;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Zone;                                              // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SmutaSaveGame_C_SetLastLevelAndZone;

// Function BP_SmutaSaveGame.BP_SmutaSaveGame_C.UpdateLevelVisited
// 0x0018 (0x0018 - 0x0000)
struct BP_SmutaSaveGame_C_UpdateLevelVisited final
{
public:
	class FString                                 Level;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	bool                                          prevVisited;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          exist;                                             // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BP_SmutaSaveGame_C_UpdateLevelVisited;

}

