#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_VillageNPCHome

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "EPOIType_structs.hpp"
#include "NPC_InteractPoint_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_VillageNPCHome.BP_VillageNPCHome_C
// 0x0070 (0x0308 - 0x0298)
class ABP_VillageNPCHome_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0298(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    ErrorBillboard;                                    // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    AISpawnBillboard;                                  // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    POI_Icon;                                          // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          Root_Behavior;                                     // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ANPC_CH_DF_Village_C*                   NPCSpawned;                                        // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_DayNightController_C*               DayNightController;                                // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UData_NPC_Village_C*>            NPCs;                                              // 0x02E0(0x0010)(Edit, BlueprintVisible)
	TArray<EPOIType>                              POIs;                                              // 0x02F0(0x0010)(Edit, BlueprintVisible)
	ENPC_InteractPoint                            InteractPoint;                                     // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CheckValidTag();
	void DayNightChanged(bool IsDay);
	void ExecuteUbergraph_BP_VillageNPCHome(int32 EntryPoint);
	void GetNPCAppearance(class UData_NPC_Village_C** NPCData);
	void ReceiveBeginPlay();
	void SetDayNightController();
	void SpawnNPC();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_VillageNPCHome_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_VillageNPCHome_C")
	}
	static class ABP_VillageNPCHome_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_VillageNPCHome_C>();
	}
};
DUMPER7_ASSERTS_ABP_VillageNPCHome_C;

}

