#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_FakeInventoryForVS

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipBoyarinGun
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipBoyarinGun final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipBoyarinGun;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipBoyarinItem
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipBoyarinItem final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipBoyarinItem;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipBoyarinSaber
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipBoyarinSaber final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipBoyarinSaber;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipShishAxe
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipShishAxe final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipShishAxe;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipShishGun
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipShishGun final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipShishGun;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipShishItem
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipShishItem final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipShishItem;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipShishShield
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipShishShield final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipShishShield;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipStreletsBerdish
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipStreletsBerdish final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipStreletsBerdish;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipStreletsGun
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipStreletsGun final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipStreletsGun;

// Function BPC_FakeInventoryForVS.BPC_FakeInventoryForVS_C.EquipStreletsItem
// 0x0010 (0x0010 - 0x0000)
struct BPC_FakeInventoryForVS_C_EquipStreletsItem final
{
public:
	int32                                         IndexToEquip;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_EquipmentItem_C*                    CallFunc_Array_Get_Item;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_FakeInventoryForVS_C_EquipStreletsItem;

}

