#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPC_GameDifficulty_NPC

#include "Basic.hpp"

#include "S_NPCStats_structs.hpp"
#include "Smuta_structs.hpp"
#include "GameDifficultyModule_structs.hpp"


namespace SDK::Params
{

// Function BPC_GameDifficulty_NPC.BPC_GameDifficulty_NPC_C.ExecuteUbergraph_BPC_GameDifficulty_NPC
// 0x0008 (0x0008 - 0x0000)
struct BPC_GameDifficulty_NPC_C_ExecuteUbergraph_BPC_GameDifficulty_NPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameDifficulty                               K2Node_Event_NewDifficulty;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_GameDifficulty_NPC_C_ExecuteUbergraph_BPC_GameDifficulty_NPC;

// Function BPC_GameDifficulty_NPC.BPC_GameDifficulty_NPC_C.GetDefaultCharacterData
// 0x0038 (0x0038 - 0x0000)
struct BPC_GameDifficulty_NPC_C_GetDefaultCharacterData final
{
public:
	class ANPC_CH_NewBattleSystem_C*              NPC;                                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGameDifficulty                               Temp_byte_Variable;                                // 0x0009(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FS_NPCStats                            K2Node_MakeStruct_S_NPCStats;                      // 0x0010(0x0020)(NoDestructor, ContainsInstancedReference, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_GameDifficulty_NPC_C_GetDefaultCharacterData;

// Function BPC_GameDifficulty_NPC.BPC_GameDifficulty_NPC_C.OnDifficultyChanged
// 0x0001 (0x0001 - 0x0000)
struct BPC_GameDifficulty_NPC_C_OnDifficultyChanged final
{
public:
	EGameDifficulty                               NewDifficulty;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPC_GameDifficulty_NPC_C_OnDifficultyChanged;

// Function BPC_GameDifficulty_NPC.BPC_GameDifficulty_NPC_C.SetupCharacterData
// 0x0020 (0x0020 - 0x0000)
struct BPC_GameDifficulty_NPC_C_SetupCharacterData final
{
public:
	class UDA_AITraits_C*                         AITraits;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FNPCAppearanceWrapper                  NPCAppearance;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, ContainsInstancedReference)
};
DUMPER7_ASSERTS_BPC_GameDifficulty_NPC_C_SetupCharacterData;

}

