#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPI_MatrixAI

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BPI_MatrixAI.BPI_MatrixAI_C.Get Matrix Char
// 0x0018 (0x0018 - 0x0000)
struct BPI_MatrixAI_C_Get_Matrix_Char final
{
public:
	class ACH_ForestAnimal_C*                     ForestAnimal;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACH_VillageAnimal_C*                    VillageAnimal;                                     // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACH_MatrixHuman_C*                      Human;                                             // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_MatrixAI_C_Get_Matrix_Char;

// Function BPI_MatrixAI.BPI_MatrixAI_C.GetDesired
// 0x0018 (0x0018 - 0x0000)
struct BPI_MatrixAI_C_GetDesired final
{
public:
	struct FVector                                Desired;                                           // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_MatrixAI_C_GetDesired;

// Function BPI_MatrixAI.BPI_MatrixAI_C.GetHumanSpawner
// 0x0008 (0x0008 - 0x0000)
struct BPI_MatrixAI_C_GetHumanSpawner final
{
public:
	class AA_HumanMatrixSpawner_C*                Spawner;                                           // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_MatrixAI_C_GetHumanSpawner;

// Function BPI_MatrixAI.BPI_MatrixAI_C.GetPOI
// 0x0008 (0x0008 - 0x0000)
struct BPI_MatrixAI_C_GetPOI final
{
public:
	class AA_VillagePOI_C*                        EatPOI;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BPI_MatrixAI_C_GetPOI;

}

