#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTD_ClearLockOnTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTD_ClearLockOnTarget.BTD_ClearLockOnTarget_C.ExecuteUbergraph_BTD_ClearLockOnTarget
// 0x0018 (0x0018 - 0x0000)
struct BTD_ClearLockOnTarget_C_ExecuteUbergraph_BTD_ClearLockOnTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTD_ClearLockOnTarget_C_ExecuteUbergraph_BTD_ClearLockOnTarget;

// Function BTD_ClearLockOnTarget.BTD_ClearLockOnTarget_C.PerformConditionCheckAI
// 0x0020 (0x0020 - 0x0000)
struct BTD_ClearLockOnTarget_C_PerformConditionCheckAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTargetedCharacterMovementComponent*    CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTD_ClearLockOnTarget_C_PerformConditionCheckAI;

// Function BTD_ClearLockOnTarget.BTD_ClearLockOnTarget_C.ReceiveExecutionStartAI
// 0x0010 (0x0010 - 0x0000)
struct BTD_ClearLockOnTarget_C_ReceiveExecutionStartAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTD_ClearLockOnTarget_C_ReceiveExecutionStartAI;

}

