#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTS_RemoveActiveEffectsWishTagForTarget

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTS_RemoveActiveEffectsWishTagForTarget.BTS_RemoveActiveEffectsWishTagForTarget_C.ExecuteUbergraph_BTS_RemoveActiveEffectsWishTagForTarget
// 0x0028 (0x0028 - 0x0000)
struct BTS_RemoveActiveEffectsWishTagForTarget_C_ExecuteUbergraph_BTS_RemoveActiveEffectsWishTagForTarget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_Event_OwnerController_1;                    // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn_1;                     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTS_RemoveActiveEffectsWishTagForTarget_C_ExecuteUbergraph_BTS_RemoveActiveEffectsWishTagForTarget;

// Function BTS_RemoveActiveEffectsWishTagForTarget.BTS_RemoveActiveEffectsWishTagForTarget_C.ReceiveActivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_RemoveActiveEffectsWishTagForTarget_C_ReceiveActivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTS_RemoveActiveEffectsWishTagForTarget_C_ReceiveActivationAI;

// Function BTS_RemoveActiveEffectsWishTagForTarget.BTS_RemoveActiveEffectsWishTagForTarget_C.ReceiveDeactivationAI
// 0x0010 (0x0010 - 0x0000)
struct BTS_RemoveActiveEffectsWishTagForTarget_C_ReceiveDeactivationAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTS_RemoveActiveEffectsWishTagForTarget_C_ReceiveDeactivationAI;

}

