#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTService_CheckAlliesInRadius

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTService_CheckAlliesInRadius.BTService_CheckAlliesInRadius_C
// 0x0048 (0x00E0 - 0x0098)
class UBTService_CheckAlliesInRadius_C final : public UBTService_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0098(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 ShouldWaitAllies;                                  // 0x00A0(0x0028)(Edit, BlueprintVisible)
	class ANPC_CH_NewBattleSystem_C*              SelfActor;                                         // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ValidDistanceToAllies;                             // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInRange;                                         // 0x00D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTService_CheckAlliesInRadius(int32 EntryPoint);
	void ReceiveTickAI(class AAIController* OwnerController, class APawn* ControlledPawn, float DeltaSeconds);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTService_CheckAlliesInRadius_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTService_CheckAlliesInRadius_C")
	}
	static class UBTService_CheckAlliesInRadius_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTService_CheckAlliesInRadius_C>();
	}
};
DUMPER7_ASSERTS_UBTService_CheckAlliesInRadius_C;

}

