#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_NPCVillageSpeak

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "EDialogueSystemEmotion_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_NPCVillageSpeak.BTT_NPCVillageSpeak_C
// 0x00E8 (0x0190 - 0x00A8)
class UBTT_NPCVillageSpeak_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 DialogueRow;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 IndexFromDialogue;                                 // 0x00D8(0x0028)(Edit, BlueprintVisible)
	bool                                          Gender;                                            // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_CH_DF_Village_C*                   CurrentNPC;                                        // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        PhraseWave;                                        // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 Speaker;                                           // 0x0118(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 DialogueIsActivate;                                // 0x0140(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 ActorToSpeakWith;                                  // 0x0168(0x0028)(Edit, BlueprintVisible)

public:
	void ChangeState();
	void ExecuteUbergraph_BTT_NPCVillageSpeak(int32 EntryPoint);
	void GetNPCGender(class UObject* NPC);
	void LoadEmotionAnimation(EDialogueSystemEmotion Emotion, class UClass** EmotionAnimation);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_NPCVillageSpeak_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_NPCVillageSpeak_C")
	}
	static class UBTT_NPCVillageSpeak_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_NPCVillageSpeak_C>();
	}
};
DUMPER7_ASSERTS_UBTT_NPCVillageSpeak_C;

}

