#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_VillageScanRow

#include "Basic.hpp"

#include "S_DialoguePhrase_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "VillageNPCSpeakTable_S_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_VillageScanRow.BTT_VillageScanRow_C
// 0x00A8 (0x0150 - 0x00A8)
class UBTT_VillageScanRow_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANPC_CH_DF_C*                           NPC;                                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVillageNPCSpeakTable_S                FilteredRow;                                       // 0x00B8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 ActorToSpeakWith;                                  // 0x00E8(0x0028)(Edit, BlueprintVisible)
	bool                                          Found;                                             // 0x0110(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_111[0x7];                                      // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FS_DialoguePhrase>              SelectedDialoguePhrases;                           // 0x0118(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FBlackboardKeySelector                 DialogueRaw;                                       // 0x0128(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_VillageScanRow(int32 EntryPoint);
	bool FilterRow(const struct FVillageNPCSpeakTable_S& VillageNPCSpeakTable_S);
	void GetDialoguePhrases(TArray<struct FS_DialoguePhrase>* DialoguePhrases);
	class ANPC_CH_DF_Village_C* GetParticipantByInstigator(bool Index_0);
	void GetRandomPhrase(class FText* Output);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void RowFound();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_VillageScanRow_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_VillageScanRow_C")
	}
	static class UBTT_VillageScanRow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_VillageScanRow_C>();
	}
};
DUMPER7_ASSERTS_UBTT_VillageScanRow_C;

}

