#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SayFractionPhrase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "S_SoundsArray_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_SayFractionPhrase.BTT_SayFractionPhrase_C
// 0x0088 (0x0130 - 0x00A8)
class UBTT_SayFractionPhrase_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<EFraction, struct FS_SoundsArray>        Sounds;                                            // 0x00B0(0x0050)(Edit, BlueprintVisible)
	class UAudioComponent*                        SpawnedSound;                                      // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          InParallel;                                        // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          StopOnAbort;                                       // 0x0109(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_10A[0x6];                                      // 0x010A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundToSpawn;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DelayedFinish;                                     // 0x0118(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ADefaultCharacter*                      OwnerCharacter;                                    // 0x0120(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEnemyDetectionComponent*               DetectionComponent;                                // 0x0128(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_SayFractionPhrase(int32 EntryPoint);
	void GetSoundForFraction(EFraction Fraction, class USoundBase** Sound);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_SayFractionPhrase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_SayFractionPhrase_C")
	}
	static class UBTT_SayFractionPhrase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_SayFractionPhrase_C>();
	}
};
DUMPER7_ASSERTS_UBTT_SayFractionPhrase_C;

}

