#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_NewStimulusReaction

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_NewStimulusReaction.BTT_NewStimulusReaction_C
// 0x0090 (0x0138 - 0x00A8)
class UBTT_NewStimulusReaction_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Animation;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            AnimationToLoad;                                   // 0x00B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class ADefaultCharacter*                      OwnerCharacter;                                    // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEnemyDetectionComponent*               DetectionComponent;                                // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class USoundBase>              SoundToLoad;                                       // 0x00F0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAudioComponent*                        SpawnedSound;                                      // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FStimulusDescription                   CurrentlyReactedStimulud;                          // 0x0120(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        ReactionAnimationCooldown;                         // 0x0130(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EnableRootMotion(bool Enable);
	void EndTask();
	void ExecuteUbergraph_BTT_NewStimulusReaction(int32 EntryPoint);
	void OnBlendOut_E0AE92DA4F68E57A50A7AF85068E0188(class FName NotifyName);
	void OnCompleted_E0AE92DA4F68E57A50A7AF85068E0188(class FName NotifyName);
	void OnInterrupted_E0AE92DA4F68E57A50A7AF85068E0188(class FName NotifyName);
	void OnLoaded_39501CA843AF9CF4E298A4B5313BB812(class UObject* Loaded);
	void OnNotifyBegin_E0AE92DA4F68E57A50A7AF85068E0188(class FName NotifyName);
	void OnNotifyEnd_E0AE92DA4F68E57A50A7AF85068E0188(class FName NotifyName);
	void PlayPhrase();
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void SetAnimation(const struct FDetectionReaction& Reaction);
	void SetPhrase(const struct FDetectionReaction& Reaction);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_NewStimulusReaction_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_NewStimulusReaction_C")
	}
	static class UBTT_NewStimulusReaction_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_NewStimulusReaction_C>();
	}
};
DUMPER7_ASSERTS_UBTT_NewStimulusReaction_C;

}

