#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_RingerCries

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_RingerCries.BTT_RingerCries_C
// 0x0058 (0x0100 - 0x00A8)
class UBTT_RingerCries_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANPC_CH_C*                              PhraseOwner;                                       // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 IsDay;                                             // 0x00B8(0x0028)(Edit, BlueprintVisible)
	class UPDA_ZastavaCries_C*                    RingerPolePhrase;                                  // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaCries_C*                    RingerBrigantPhrase;                               // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaCries_C*                    RingerStrelecPhrase;                               // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaCries_C*                    RingerGermanPhrase;                                // 0x00F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_RingerCries(int32 EntryPoint);
	void GetPhraseFromCries(EFraction Fraction, class USoundWave** Phrase, class UAnimMontage** Anim_Montage);
	void OnBlendOut_ADB3257E4D924FE9C85978BFE271CCAA(class FName NotifyName);
	void OnCompleted_ADB3257E4D924FE9C85978BFE271CCAA(class FName NotifyName);
	void OnInterrupted_ADB3257E4D924FE9C85978BFE271CCAA(class FName NotifyName);
	void OnNotifyBegin_ADB3257E4D924FE9C85978BFE271CCAA(class FName NotifyName);
	void OnNotifyEnd_ADB3257E4D924FE9C85978BFE271CCAA(class FName NotifyName);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_RingerCries_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_RingerCries_C")
	}
	static class UBTT_RingerCries_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_RingerCries_C>();
	}
};
DUMPER7_ASSERTS_UBTT_RingerCries_C;

}

