#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetSplinePath

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "EnchancedSpline_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_SetSplinePath.BTT_SetSplinePath_C
// 0x0090 (0x0138 - 0x00A8)
class UBTT_SetSplinePath_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EGroundMovementMode                           MovementMode;                                      // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USplinePointAsyncAction*                Async_Action;                                      // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UInteractWithSmartObject*               InteractAction;                                    // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          Controller;                                        // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             Character;                                         // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FEnchancedSplinePointParams            Point_Params;                                      // 0x00D8(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                          bSuccess;                                          // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TargetLocation;                                    // 0x0110(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_SetSplinePath(int32 EntryPoint);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_SetSplinePath_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_SetSplinePath_C")
	}
	static class UBTT_SetSplinePath_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_SetSplinePath_C>();
	}
};
DUMPER7_ASSERTS_UBTT_SetSplinePath_C;

}

