#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_Cries

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_classes.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_Cries.BTT_Cries_C
// 0x0030 (0x00D8 - 0x00A8)
class UBTT_Cries_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPDA_ZastavaCries_C*                    PolePhrase;                                        // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaCries_C*                    BrigantPhrase;                                     // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaCries_C*                    StrelecPhrase;                                     // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaCries_C*                    GermanPhrase;                                      // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ANPC_CH_C*                              PhraseOwner;                                       // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_Cries(int32 EntryPoint);
	void GetPhraseFromCries(EFraction Fraction, class USoundWave** Phrase, class UAnimMontage** Anim_Montage);
	void OnBlendOut_807B268E485C2E1EFE26FB85A1FB2E44(class FName NotifyName);
	void OnCompleted_807B268E485C2E1EFE26FB85A1FB2E44(class FName NotifyName);
	void OnInterrupted_807B268E485C2E1EFE26FB85A1FB2E44(class FName NotifyName);
	void OnNotifyBegin_807B268E485C2E1EFE26FB85A1FB2E44(class FName NotifyName);
	void OnNotifyEnd_807B268E485C2E1EFE26FB85A1FB2E44(class FName NotifyName);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_Cries_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_Cries_C")
	}
	static class UBTT_Cries_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_Cries_C>();
	}
};
DUMPER7_ASSERTS_UBTT_Cries_C;

}

