#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_CallForHelpDetection

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTT_CallForHelpDetection.BTT_CallForHelpDetection_C.ExecuteUbergraph_BTT_CallForHelpDetection
// 0x0020 (0x0020 - 0x0000)
struct BTT_CallForHelpDetection_C_ExecuteUbergraph_BTT_CallForHelpDetection final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnemyDetectionComponent*               CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTT_CallForHelpDetection_C_ExecuteUbergraph_BTT_CallForHelpDetection;

// Function BTT_CallForHelpDetection.BTT_CallForHelpDetection_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTT_CallForHelpDetection_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTT_CallForHelpDetection_C_ReceiveExecuteAI;

}

