#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_AssignDialogueIndex

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_AssignDialogueIndex.BTT_AssignDialogueIndex_C
// 0x00D0 (0x0178 - 0x00A8)
class UBTT_AssignDialogueIndex_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 ActorToSpeakWith;                                  // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 Speaker;                                           // 0x00D8(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 IsAssignRole;                                      // 0x0100(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 QueDialogue;                                       // 0x0128(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 IndexFromDialogue;                                 // 0x0150(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTT_AssignDialogueIndex(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_AssignDialogueIndex_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_AssignDialogueIndex_C")
	}
	static class UBTT_AssignDialogueIndex_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_AssignDialogueIndex_C>();
	}
};
DUMPER7_ASSERTS_UBTT_AssignDialogueIndex_C;

}

