#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_SetFocus

#include "Basic.hpp"

#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_SetFocus.BTT_SetFocus_C
// 0x0040 (0x00E8 - 0x00A8)
class UBTT_SetFocus_C final : public UBTTask_BlueprintBase
{
public:
	bool                                          bSetFocus;                                         // 0x00A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSetControllerFocus;                               // 0x00A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AA[0x6];                                       // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 FocusActor;                                        // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class AActor*                                 TargetActor;                                       // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTargetedCharacterMovementComponent*    MovementComponent;                                 // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_SetFocus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_SetFocus_C")
	}
	static class UBTT_SetFocus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_SetFocus_C>();
	}
};
DUMPER7_ASSERTS_UBTT_SetFocus_C;

}

