#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTT_RollDefenceSkill

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "InventorySystemModule_structs.hpp"
#include "GameDifficultyModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTT_RollDefenceSkill.BTT_RollDefenceSkill_C
// 0x0068 (0x0110 - 0x00A8)
class UBTT_RollDefenceSkill_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 SuccessBoolBB;                                     // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class ANPC_CH_C*                              As_NPC_CH;                                         // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        DefenceRoll;                                       // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBPC_ActionRoll_C*                      ActionRollComponent;                               // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        DefenceParam;                                      // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DefenceRollResult;                                 // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Deviation;                                         // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTT_RollDefenceSkill(int32 EntryPoint);
	void GetNPCWeaponLength(EWeaponLength* WeaponLength);
	void GetPlayerWeaponLength(EWeaponLength* WeaponLength);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTT_RollDefenceSkill_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTT_RollDefenceSkill_C")
	}
	static class UBTT_RollDefenceSkill_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTT_RollDefenceSkill_C>();
	}
};
DUMPER7_ASSERTS_UBTT_RollDefenceSkill_C;

}

