#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_GetAnimPoint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_GetAnimPoint.BTTask_GetAnimPoint_C
// 0x0068 (0x0110 - 0x00A8)
class UBTTask_GetAnimPoint_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 POI;                                               // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class ABP_PointOfInterest_C*                  LastPOI;                                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 ActionPoint;                                       // 0x00E8(0x0028)(Edit, BlueprintVisible)

public:
	void ExecuteUbergraph_BTTask_GetAnimPoint(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_GetAnimPoint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_GetAnimPoint_C")
	}
	static class UBTTask_GetAnimPoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_GetAnimPoint_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_GetAnimPoint_C;

}

