#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SayPhrase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_SayPhrase.BTTask_SayPhrase_C
// 0x00A8 (0x0150 - 0x00A8)
class UBTTask_SayPhrase_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDA_Base_AttitudeTowardsPlayer_C*       Pole;                                              // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDA_Base_AttitudeTowardsPlayer_C*       Strelets;                                          // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDA_Base_AttitudeTowardsPlayer_C*       shish;                                             // 0x00C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDA_Base_AttitudeTowardsPlayer_C*       brigant;                                           // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         WarningLevel;                                      // 0x00D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FBlackboardKeySelector                 TeamAttitude;                                      // 0x00D8(0x0028)(Edit, BlueprintVisible)
	class UPDA_ZastavaPhrase_C*                   PolePhrase;                                        // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaPhrase_C*                   BrigantPhrase;                                     // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaPhrase_C*                   GermanPhrase;                                      // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UPDA_ZastavaPhrase_C*                   StrelecPhrase;                                     // 0x0118(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 WarningLvl;                                        // 0x0120(0x0028)(Edit, BlueprintVisible)
	bool                                          Increment;                                         // 0x0148(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_SayPhrase(int32 EntryPoint);
	void Get_Towards_Player_Text(class ADefaultCharacter* Target, class FText* Text);
	void GetCorrectPhrase(ETeamAttitude Attitude, EFraction Fraction, class USoundWave** Phrase);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_SayPhrase_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_SayPhrase_C")
	}
	static class UBTTask_SayPhrase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_SayPhrase_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_SayPhrase_C;

}

