#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_RollRandom

#include "Basic.hpp"


namespace SDK::Params
{

// Function BTTask_RollRandom.BTTask_RollRandom_C.ExecuteUbergraph_BTTask_RollRandom
// 0x0018 (0x0018 - 0x0000)
struct BTTask_RollRandom_C_ExecuteUbergraph_BTTask_RollRandom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_RollRandom_C_ExecuteUbergraph_BTTask_RollRandom;

// Function BTTask_RollRandom.BTTask_RollRandom_C.ReceiveExecute
// 0x0008 (0x0008 - 0x0000)
struct BTTask_RollRandom_C_ReceiveExecute final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_BTTask_RollRandom_C_ReceiveExecute;

}

