#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_ChangeActiveSlot

#include "Basic.hpp"

#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "InventorySystemModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_ChangeActiveSlot.BTTask_ChangeActiveSlot_C
// 0x0020 (0x00C8 - 0x00A8)
class UBTTask_ChangeActiveSlot_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EEquipmentSlotType                            NewSlot;                                           // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHuman_CH_C*                            As_Human_CH;                                       // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldPlayAnim;                                    // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_ChangeActiveSlot(int32 EntryPoint);
	void OnBlendOut_8651AF304341ADE0A6F9FFBFEC1CC857(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_8651AF304341ADE0A6F9FFBFEC1CC857(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_8651AF304341ADE0A6F9FFBFEC1CC857(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_8651AF304341ADE0A6F9FFBFEC1CC857(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_8651AF304341ADE0A6F9FFBFEC1CC857(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void ReceiveAbortAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void SetDebugAIState(EBattleNPCState BattleState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_ChangeActiveSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_ChangeActiveSlot_C")
	}
	static class UBTTask_ChangeActiveSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_ChangeActiveSlot_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_ChangeActiveSlot_C;

}

