#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_GetPOI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EPOIType_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_GetPOI.BTTask_GetPOI_C
// 0x0068 (0x0110 - 0x00A8)
class UBTTask_GetPOI_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 POI;                                               // 0x00B0(0x0028)(Edit, BlueprintVisible)
	class ABP_PointOfInterest_C*                  LastPOI;                                           // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ABP_PointOfInterest_C*>          AllPOIs;                                           // 0x00E0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class ABP_PointOfInterest_C*>          FilteredPOIs;                                      // 0x00F0(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ANPC_CH_DF_Village_C*                   NPC;                                               // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_PointOfInterest_C*                  SelectedPoint;                                     // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_GetPOI(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_GetPOI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_GetPOI_C")
	}
	static class UBTTask_GetPOI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_GetPOI_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_GetPOI_C;

}

