#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_PlayAnimByPOI

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_PlayAnimByPOI.BTTask_PlayAnimByPOI_C
// 0x0070 (0x0118 - 0x00A8)
class UBTTask_PlayAnimByPOI_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ANPC_CH_DF_Village_C*                   NPC;                                               // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 POI;                                               // 0x00B8(0x0028)(Edit, BlueprintVisible)
	class ABP_PointOfInterest_C*                  BP_POI;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlackboardKeySelector                 RotationZ;                                         // 0x00E8(0x0028)(Edit, BlueprintVisible)
	struct FTimerHandle                           TimerForRotate;                                    // 0x0110(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_PlayAnimByPOI(int32 EntryPoint);
	void NewFunction(class ANPC_CH_DF_Village_C* NewParam);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);
	void SwitchAnimation_InPlaza();
	void TimerRotate();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_PlayAnimByPOI_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_PlayAnimByPOI_C")
	}
	static class UBTTask_PlayAnimByPOI_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_PlayAnimByPOI_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_PlayAnimByPOI_C;

}

