#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_CheckTeamAttitude

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BTTask_CheckTeamAttitude.BTTask_CheckTeamAttitude_C
// 0x0068 (0x0110 - 0x00A8)
class UBTTask_CheckTeamAttitude_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 TargetActor;                                       // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 TeamAttitude;                                      // 0x00D8(0x0028)(Edit, BlueprintVisible)
	ETeamAttitude                                 Attitude;                                          // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_CH_NewBattleSystem_C*              NPC;                                               // 0x0108(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BTTask_CheckTeamAttitude(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BTTask_CheckTeamAttitude_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BTTask_CheckTeamAttitude_C")
	}
	static class UBTTask_CheckTeamAttitude_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBTTask_CheckTeamAttitude_C>();
	}
};
DUMPER7_ASSERTS_UBTTask_CheckTeamAttitude_C;

}

