#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_ForestAnimal

#include "Basic.hpp"

#include "Smuta_structs.hpp"
#include "Engine_structs.hpp"
#include "NPC_CH_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_ForestAnimal.CH_ForestAnimal_C
// 0x0040 (0x0A90 - 0x0A50)
class ACH_ForestAnimal_C final : public ANPC_CH_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CH_ForestAnimal_C;                  // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	EAnimalType                                   AnimalType;                                        // 0x0A58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_A59[0x7];                                      // 0x0A59(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMatrixSpawnerBase*                     SpawnerPoint;                                      // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Hangry;                                            // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Stamina;                                           // 0x0A70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AForestAnimalPOI*                       POI;                                               // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EAnimalState                                  Animal_State;                                      // 0x0A80(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EForestRestState                              ForestRestState;                                   // 0x0A81(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EForestEatState                               ForestEatState;                                    // 0x0A82(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeAnimalState(class AActor* Character, EAnimalState AnimalState);
	void ExecuteUbergraph_CH_ForestAnimal(int32 EntryPoint);
	void Get_Matrix_Char(class ACH_ForestAnimal_C** ForestAnimal, class ACH_VillageAnimal_C** VillageAnimal, class ACH_MatrixHuman_C** Human);
	void GetDesired(struct FVector* Desired);
	void GetHumanSpawner(class AA_HumanMatrixSpawner_C** Spawner);
	void GetPOI(class AA_VillagePOI_C** EatPOI);
	void ReceiveTick(float DeltaSeconds);
	void Settings_Character();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CH_ForestAnimal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CH_ForestAnimal_C")
	}
	static class ACH_ForestAnimal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACH_ForestAnimal_C>();
	}
};
DUMPER7_ASSERTS_ACH_ForestAnimal_C;

}

