#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CH_VillageAnimal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "NPC_CH_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CH_VillageAnimal.CH_VillageAnimal_C
// 0x0030 (0x0A80 - 0x0A50)
class ACH_VillageAnimal_C final : public ANPC_CH_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_CH_VillageAnimal_C;                 // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AMatrixSpawnerBase*                     SpawnerPoint;                                      // 0x0A58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Hangry;                                            // 0x0A60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Stamina;                                           // 0x0A68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EAnimalState                                  Animal_State;                                      // 0x0A70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	EVillageRestState                             RestState;                                         // 0x0A71(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVillageEatState                              EatState;                                          // 0x0A72(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVillageAnimalType                            VillageAnimalType;                                 // 0x0A73(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_A74[0x4];                                      // 0x0A74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AEatVillagePOI*                         POI;                                               // 0x0A78(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ChangeAnimalState(class AActor* Character, EAnimalState AnimalState);
	void ExecuteUbergraph_CH_VillageAnimal(int32 EntryPoint);
	void Get_Matrix_Char(class ACH_ForestAnimal_C** ForestAnimal, class ACH_VillageAnimal_C** VillageAnimal, class ACH_MatrixHuman_C** Human);
	void GetDesired(struct FVector* Desired);
	void GetHumanSpawner(class AA_HumanMatrixSpawner_C** Spawner);
	void GetPOI(class AA_VillagePOI_C** EatPOI);
	void ReceiveTick(float DeltaSeconds);
	void Settings_Character();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CH_VillageAnimal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CH_VillageAnimal_C")
	}
	static class ACH_VillageAnimal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ACH_VillageAnimal_C>();
	}
};
DUMPER7_ASSERTS_ACH_VillageAnimal_C;

}

