#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CME_AddFractionInfluence

#include "Basic.hpp"

#include "Smuta_structs.hpp"


namespace SDK::Params
{

// Function CME_AddFractionInfluence.CME_AddFractionInfluence_C.AddFractionInfluence
// 0x0020 (0x0020 - 0x0000)
struct CME_AddFractionInfluence_C_AddFractionInfluence final
{
public:
	ESmutaDLCFraction                             Fraction;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Influence;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFractionsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_AddFractionInfluence_DeltaValue_ImplicitCast; // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CME_AddFractionInfluence_C_AddFractionInfluence;

}

