#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CME_ChangeDayNight

#include "Basic.hpp"


namespace SDK::Params
{

// Function CME_ChangeDayNight.CME_ChangeDayNight_C.Cheat_ChangeDayNight
// 0x0018 (0x0018 - 0x0000)
struct CME_ChangeDayNight_C_Cheat_ChangeDayNight final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DayNightController_C*               CallFunc_FL_Dark_Forest_Get_Day_Night_Controller_DayNightController; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_CME_ChangeDayNight_C_Cheat_ChangeDayNight;

}

