#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CombatHitDetection

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"
#include "DeveloperSettings_classes.hpp"
#include "CombatHitDetection_structs.hpp"


namespace SDK
{

// Class CombatHitDetection.CombatHitDetectionBPLibrary
// 0x0000 (0x0028 - 0x0028)
class UCombatHitDetectionBPLibrary final : public UBlueprintFunctionLibrary
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CombatHitDetectionBPLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CombatHitDetectionBPLibrary")
	}
	static class UCombatHitDetectionBPLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombatHitDetectionBPLibrary>();
	}
};
DUMPER7_ASSERTS_UCombatHitDetectionBPLibrary;

// Class CombatHitDetection.CombatHitDetectionComponentInterface
// 0x0000 (0x0000 - 0x0000)
class ICombatHitDetectionComponentInterface final
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CombatHitDetectionComponentInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CombatHitDetectionComponentInterface")
	}
	static class ICombatHitDetectionComponentInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<ICombatHitDetectionComponentInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_ICombatHitDetectionComponentInterface;

// Class CombatHitDetection.CombatHitDetectionSettings
// 0x0008 (0x0040 - 0x0038)
class UCombatHitDetectionSettings final : public UDeveloperSettings
{
public:
	float                                         RadialSubSteppingLimit;                            // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static const class UCombatHitDetectionSettings* Get();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CombatHitDetectionSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CombatHitDetectionSettings")
	}
	static class UCombatHitDetectionSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombatHitDetectionSettings>();
	}
};
DUMPER7_ASSERTS_UCombatHitDetectionSettings;

// Class CombatHitDetection.DefenceZoneCollisionComponent
// 0x0000 (0x05A0 - 0x05A0)
class UDefenceZoneCollisionComponent final : public UCapsuleComponent
{
public:
	EDefenceZoneType                              DefenceZoneType;                                   // 0x0598(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPriorityInTickDetectionQuery;                     // 0x0599(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterruptCollisionDetectionQuery;                 // 0x059A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIgnoreOwnerCollisionDetection;                    // 0x059B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59C[0x4];                                      // 0x059C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetHitDetectionActive(bool bHitDetectionActive);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DefenceZoneCollisionComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefenceZoneCollisionComponent")
	}
	static class UDefenceZoneCollisionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefenceZoneCollisionComponent>();
	}
};
DUMPER7_ASSERTS_UDefenceZoneCollisionComponent;

}

