#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ControlsSettings

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct ControlsSettings.ControlsSettings
// 0x0020 (0x0020 - 0x0000)
struct FControlsSettings final
{
public:
	double                                        MouseSensitivityX_9_9A604BEC44630AFF60F57CB2ADB1573E; // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        MouseSensitivityY_10_F62513EC4226E22FBA8256A0157BB955; // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        GamepadSensitivity_11_4793C9D642743AAED42D6CABA9ADC7AB; // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertMouseX_13_B18CE33142B0892A0B57BAAF4495C79E;  // 0x0018(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertMouseY_15_1525A8964505018C76D51DB8A23BBE16;  // 0x0019(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FControlsSettings;

}

