#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CR_Strelec_HeadIK_Offset

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "ControlRig_structs.hpp"
#include "ControlRig_classes.hpp"
#include "PBIK_structs.hpp"
#include "RigVM_structs.hpp"
#include "RigVM_classes.hpp"


namespace SDK
{

// RigVMBlueprintGeneratedClass CR_Strelec_HeadIK_Offset.CR_Strelec_HeadIK_Offset_C
// 0x0020 (0x0630 - 0x0610)
class UCR_Strelec_HeadIK_Offset_C final : public UControlRig
{
public:
	struct FVector                                LookAtLocationTarget;                              // 0x0610(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsDesign;                                         // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("CR_Strelec_HeadIK_Offset_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CR_Strelec_HeadIK_Offset_C")
	}
	static class UCR_Strelec_HeadIK_Offset_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCR_Strelec_HeadIK_Offset_C>();
	}
};
DUMPER7_ASSERTS_UCR_Strelec_HeadIK_Offset_C;

// RigVMMemoryStorageGeneratorClass CR_Strelec_HeadIK_Offset.RigVMMemory_Literal
// 0x0338 (0x0360 - 0x0028)
class CR_Strelec_HeadIK_Offset::URigVMMemory_Literal final : public URigVMMemoryStorage
{
public:
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_7_Item__Const;   // 0x0028(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	ERigVMTransformSpace                          RigVMModel___RigUnit_SetTransform_7_Space__Const;  // 0x0034(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_7_bInitial__Const; // 0x0035(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0xA];                                       // 0x0036(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_7_Value__Const;  // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___RigUnit_SetTransform_7_Weight__Const; // 0x00A0(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                          RigVMModel___RigUnit_SetTransform_7_bPropagateToChildren__Const; // 0x00A4(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigElementKey                         RigVMModel___RigUnit_SetTransform_6_Item__Const;   // 0x00A8(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0xC];                                       // 0x00B4(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_SetTransform_6_Value__Const;  // 0x00C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___AimBoneMath_2_InputTransform__Const;  // 0x0120(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___RigUnit_GetTransform_7_4_Item__Const; // 0x0180(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18C[0x4];                                      // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_2_Primary__Const;         // 0x0190(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_2_Secondary__Const;       // 0x01D8(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FRigUnit_AimBone_DebugSettings         RigVMModel___AimBoneMath_2_DebugSettings__Const;   // 0x0220(0x0070)(Edit, EditConst, NonTransactional, NoDestructor)
	float                                         RigVMModel___Interpolate_7_1_T__Const;             // 0x0290(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_2_Item__Const; // 0x0294(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___DISPATCH_RigVMDispatch_MakeStruct_8_1_Elements__Const; // 0x02A0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	double                                        RigVMModel___Add_3_1_B__Const;                     // 0x02B8(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_Item__Const;   // 0x02C0(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRigElementKey                         RigVMModel___OffsetTransformForItem_1_Item__Const; // 0x02CC(0x000C)(Edit, EditConst, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RigVMModel___OffsetTransformForItem_1_Weight__Const; // 0x02D8(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   RigVMModel___PBIK_Root__Const;                     // 0x02DC(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E4[0x4];                                      // 0x02E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__Const;                // 0x02E8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKBoneSetting>               RigVMModel___PBIK_BoneSettings__Const;             // 0x02F8(0x0010)(Edit, EditConst, NonTransactional)
	TArray<class FName>                           RigVMModel___PBIK_ExcludedBones__Const;            // 0x0308(0x0010)(Edit, EditConst, NonTransactional)
	struct FPBIKSolverSettings                    RigVMModel___PBIK_Settings__Const;                 // 0x0318(0x003C)(Edit, EditConst, NonTransactional, NoDestructor)
	struct FPBIKDebug                             RigVMModel___PBIK_Debug__Const;                    // 0x0354(0x0008)(Edit, EditConst, NonTransactional, NoDestructor)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass CR_Strelec_HeadIK_Offset.RigVMMemory_Literal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Literal")
	}
	static class CR_Strelec_HeadIK_Offset::URigVMMemory_Literal* GetDefaultObj()
	{
		return GetDefaultObjImpl<CR_Strelec_HeadIK_Offset::URigVMMemory_Literal>();
	}
};
DUMPER7_ASSERTS_CR_Strelec_HeadIK_Offset__URigVMMemory_Literal;

// RigVMMemoryStorageGeneratorClass CR_Strelec_HeadIK_Offset.RigVMMemory_Work
// 0x0718 (0x0740 - 0x0028)
class CR_Strelec_HeadIK_Offset::URigVMMemory_Work final : public URigVMMemoryStorage
{
public:
	struct FVector                                RigVMModel___From_World_1_Global;                  // 0x0028(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_SetTransform_7_Value__IO;     // 0x0040(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_7_CachedIndex;   // 0x00A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___Interpolate_7_1_Result;               // 0x00B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_9_2_Transform;   // 0x00D0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_9_2_CachedIndex; // 0x0130(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___Interpolate_7_1_A;                    // 0x0140(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___AimBoneMath_2_Result;                 // 0x0160(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_7_4_Transform;   // 0x01C0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_7_4_CachedIndex; // 0x0220(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___AimBoneMath_2_InputTransform__IO;     // 0x0230(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_GetTransform_9_Transform;     // 0x0290(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_9_CachedIndex;   // 0x02F0(0x0010)(Edit, EditConst, NonTransactional)
	struct FRigUnit_AimItem_Target                RigVMModel___AimBoneMath_2_Primary__IO;            // 0x0300(0x0048)(Edit, EditConst, NonTransactional, NoDestructor)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_2_PrimaryCachedSpace;     // 0x0348(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FCachedRigElement>              RigVMModel___AimBoneMath_2_SecondaryCachedSpace;   // 0x0358(0x0010)(Edit, EditConst, NonTransactional)
	TArray<bool>                                  RigVMModel___AimBoneMath_2_bIsInitialized;         // 0x0368(0x0010)(Edit, EditConst, NonTransactional)
	uint8                                         Pad_378[0x8];                                      // 0x0378(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  RigVMModel___Interpolate_7_1_B;                    // 0x0380(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             RigVMModel___RigUnit_SetTransform_6_Value__IO;     // 0x03A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_SetTransform_6_CachedIndex;   // 0x0400(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___RigVMFunction_MathQuaternionFromRotatorV2_4_2_1_Result; // 0x0410(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___DISPATCH_RigVMDispatch_MakeStruct_8_1_Struct; // 0x0430(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRotator                               RigVMModel___DISPATCH_RigVMDispatch_BreakStruct_4_1_Elements; // 0x0448(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRotator                               RigVMModel___RigVMFunction_MathQuaternionToRotator_4_1_Result; // 0x0460(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	uint8                                         Pad_478[0x8];                                      // 0x0478(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___RigUnit_GetTransform_7_Transform;     // 0x0480(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___RigUnit_GetTransform_7_CachedIndex;   // 0x04E0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___RigVMFunction_MathQuaternionToRotator_4_1_Value; // 0x04F0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Add_3_1_Result;                       // 0x0510(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	double                                        RigVMModel___Add_3_1_A;                            // 0x0518(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___DISPATCH_RigVMDispatch_MakeStruct_8_1_Elements__IO; // 0x0520(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	uint8                                         Pad_538[0x8];                                      // 0x0538(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             RigVMModel___OffsetTransformForItem_2_OffsetTransform__IO; // 0x0540(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_2_CachedIndex; // 0x05A0(0x0010)(Edit, EditConst, NonTransactional)
	struct FQuat                                  RigVMModel___RigVMFunction_MathQuaternionFromRotatorV2_Result; // 0x05B0(0x0020)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RigVMModel___DISPATCH_RigVMDispatch_MakeStruct_8_1_1_Struct; // 0x05D0(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRotator                               RigVMModel___DISPATCH_RigVMDispatch_BreakStruct_4_1_1_Elements; // 0x05E8(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRotator                               RigVMModel___RigVMFunction_MathQuaternionToRotator_4_1_2_Result; // 0x0600(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FRotator                               RigVMModel___DISPATCH_RigVMDispatch_MakeStruct_8_1_1_Elements__IO; // 0x0618(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NonTransactional, NoDestructor)
	struct FTransform                             RigVMModel___OffsetTransformForItem_OffsetTransform__IO; // 0x0630(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_CachedIndex;   // 0x0690(0x0010)(Edit, EditConst, NonTransactional)
	struct FTransform                             RigVMModel___OffsetTransformForItem_1_OffsetTransform__IO; // 0x06A0(0x0060)(Edit, EditConst, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCachedRigElement>              RigVMModel___OffsetTransformForItem_1_CachedIndex; // 0x0700(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKEffector>                  RigVMModel___PBIK_Effectors__IO;                   // 0x0710(0x0010)(Edit, EditConst, NonTransactional)
	TArray<TArray<int32>>                         RigVMModel___PBIK_EffectorSolverIndices;           // 0x0720(0x0010)(Edit, EditConst, NonTransactional)
	TArray<struct FPBIKWorkData>                  RigVMModel___PBIK_WorkData;                        // 0x0730(0x0010)(Edit, EditConst, NonTransactional)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL_FULLNAME("RigVMMemoryStorageGeneratorClass CR_Strelec_HeadIK_Offset.RigVMMemory_Work")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RigVMMemory_Work")
	}
	static class CR_Strelec_HeadIK_Offset::URigVMMemory_Work* GetDefaultObj()
	{
		return GetDefaultObjImpl<CR_Strelec_HeadIK_Offset::URigVMMemory_Work>();
	}
};
DUMPER7_ASSERTS_CR_Strelec_HeadIK_Offset__URigVMMemory_Work;

}

