#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CutscenePlayer

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// Class CutscenePlayer.CutscenePlayerSubsystem
// 0x0058 (0x0088 - 0x0030)
class UCutscenePlayerSubsystem final : public UWorldSubsystem
{
public:
	TMulticastInlineDelegate<void()>              OnCutsceneSkip;                                    // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ULevelSequence* Cutscene)> OnCutscenePlayed;                 // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(class ULevelSequence* Cutscene, class ULevelSequencePlayer* Player)> OnCutsceneStarted; // 0x0050(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          bHideUICutScene;                                   // 0x0060(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   LevelSequencePlayer;                               // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ALevelSequenceActor*                    LevelSequenceActor;                                // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevelSequence*                         CurrentSequence;                                   // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevelSequencePlayer*                   StoredSequencePlayer;                              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	class ULevelSequencePlayer* PlaySequence(class ULevelSequence* LevelSequence, const struct FMovieSceneSequencePlaybackSettings& Settings, bool HideUICutScene);
	void SequencePlayedResponse();
	void SetPaused(bool bPaused);
	void SkipScene();
	void StoreSequencePlayer(class ULevelSequencePlayer* Player);

	class ULevelSequencePlayer* GetStoredSequencePlayer() const;
	bool IsPlaying() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CutscenePlayerSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CutscenePlayerSubsystem")
	}
	static class UCutscenePlayerSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCutscenePlayerSubsystem>();
	}
};
DUMPER7_ASSERTS_UCutscenePlayerSubsystem;

}

