#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CutscenePlayer

#include "Basic.hpp"

#include "MovieScene_structs.hpp"


namespace SDK::Params
{

// Function CutscenePlayer.CutscenePlayerSubsystem.PlaySequence
// 0x0038 (0x0038 - 0x0000)
struct CutscenePlayerSubsystem_PlaySequence final
{
public:
	class ULevelSequence*                         LevelSequence;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMovieSceneSequencePlaybackSettings    Settings;                                          // 0x0008(0x0020)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          HideUICutScene;                                    // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelSequencePlayer*                   ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CutscenePlayerSubsystem_PlaySequence;

// Function CutscenePlayer.CutscenePlayerSubsystem.SetPaused
// 0x0001 (0x0001 - 0x0000)
struct CutscenePlayerSubsystem_SetPaused final
{
public:
	bool                                          bPaused;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CutscenePlayerSubsystem_SetPaused;

// Function CutscenePlayer.CutscenePlayerSubsystem.StoreSequencePlayer
// 0x0008 (0x0008 - 0x0000)
struct CutscenePlayerSubsystem_StoreSequencePlayer final
{
public:
	class ULevelSequencePlayer*                   Player;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CutscenePlayerSubsystem_StoreSequencePlayer;

// Function CutscenePlayer.CutscenePlayerSubsystem.GetStoredSequencePlayer
// 0x0008 (0x0008 - 0x0000)
struct CutscenePlayerSubsystem_GetStoredSequencePlayer final
{
public:
	class ULevelSequencePlayer*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CutscenePlayerSubsystem_GetStoredSequencePlayer;

// Function CutscenePlayer.CutscenePlayerSubsystem.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct CutscenePlayerSubsystem_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CutscenePlayerSubsystem_IsPlaying;

}

