#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_Base_AttitudeTowardsPlayer

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_Base_AttitudeTowardsPlayer.DA_Base_AttitudeTowardsPlayer_C
// 0x0060 (0x0090 - 0x0030)
class UDA_Base_AttitudeTowardsPlayer_C final : public UPrimaryDataAsset
{
public:
	TArray<class FText>                           Friendly;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           Neutral;                                           // 0x0040(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           Hostile;                                           // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           Warning_01;                                        // 0x0060(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           Warning_02;                                        // 0x0070(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class FText>                           Warning_03;                                        // 0x0080(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DA_Base_AttitudeTowardsPlayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_Base_AttitudeTowardsPlayer_C")
	}
	static class UDA_Base_AttitudeTowardsPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_Base_AttitudeTowardsPlayer_C>();
	}
};
DUMPER7_ASSERTS_UDA_Base_AttitudeTowardsPlayer_C;

}

