#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_EquipmentItem

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_EquipmentItem.DA_EquipmentItem_C
// 0x0058 (0x0088 - 0x0030)
class UDA_EquipmentItem_C final : public UPrimaryDataAsset
{
public:
	class FText                                   Name_0;                                            // 0x0030(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0048(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             MicroIcon;                                         // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SimpleIcon;                                        // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             ArtIcon;                                           // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasStats;                                          // 0x0078(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Stat1;                                             // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stat2;                                             // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stat3;                                             // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DA_EquipmentItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_EquipmentItem_C")
	}
	static class UDA_EquipmentItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_EquipmentItem_C>();
	}
};
DUMPER7_ASSERTS_UDA_EquipmentItem_C;

}

