#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_InventoryItem

#include "Basic.hpp"

#include "EItemType_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_InventoryItem.DA_InventoryItem_C
// 0x0048 (0x0078 - 0x0030)
class UDA_InventoryItem_C final : public UPrimaryDataAsset
{
public:
	class FText                                   Name_0;                                            // 0x0030(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   Description;                                       // 0x0048(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UTexture2D*                             Icon;                                              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FIntPoint                              AmountToDrop;                                      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EItemType::EItemType                          ItemType;                                          // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DA_InventoryItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_InventoryItem_C")
	}
	static class UDA_InventoryItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_InventoryItem_C>();
	}
};
DUMPER7_ASSERTS_UDA_InventoryItem_C;

}

