#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DA_SkillTree_Unit_Base

#include "Basic.hpp"

#include "E_SkillTree_UnitType_structs.hpp"
#include "Engine_classes.hpp"
#include "E_SkillTree_Category_structs.hpp"
#include "E_SkillTree_UnitFilter_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DA_SkillTree_Unit_Base.DA_SkillTree_Unit_Base_C
// 0x00D0 (0x0100 - 0x0030)
class UDA_SkillTree_Unit_Base_C final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class UTexture2D>              icon_Small;                                        // 0x0030(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              icon_Big;                                          // 0x0058(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FText                                   Name_0;                                            // 0x0080(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   PrimaryEffectDescription;                          // 0x0098(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   SecondaryEffectDescription;                        // 0x00B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	E_SkillTree_UnitType                          Type;                                              // 0x00C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PrimaryGE;                                         // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SecondaryGE;                                       // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_SkillTree_Category                          Category;                                          // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 PrimaryGA;                                         // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 SecondaryGA;                                       // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	E_SkillTree_UnitFilter                        UnitFilter;                                        // 0x00F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DA_SkillTree_Unit_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DA_SkillTree_Unit_Base_C")
	}
	static class UDA_SkillTree_Unit_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDA_SkillTree_Unit_Base_C>();
	}
};
DUMPER7_ASSERTS_UDA_SkillTree_Unit_Base_C;

}

