#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DarkForestEvents

#include "Basic.hpp"

#include "DarkForestEvents_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DarkForestEvents.DFEventCondition.CheckCondition
// 0x0010 (0x0010 - 0x0000)
struct DFEventCondition_CheckCondition final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DFEventCondition_CheckCondition;

// Function DarkForestEvents.DFEventObject.AsyncLoadClass
// 0x0038 (0x0038 - 0x0000)
struct DFEventObject_AsyncLoadClass final
{
public:
	TSoftClassPtr<class UClass>                   ClassToLoad;                                       // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UClass* Class)>          Delegate;                                          // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventObject_AsyncLoadClass;

// Function DarkForestEvents.DFEventObject.AsyncLoadObject
// 0x0038 (0x0038 - 0x0000)
struct DFEventObject_AsyncLoadObject final
{
public:
	TSoftObjectPtr<class UObject>                 ObjectToLoad;                                      // 0x0000(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UObject* Object)>        Delegate;                                          // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventObject_AsyncLoadObject;

// Function DarkForestEvents.DFEventObject.FinishDeferredSpawn
// 0x0008 (0x0008 - 0x0000)
struct DFEventObject_FinishDeferredSpawn final
{
public:
	class AActor*                                 ActorToFinishSpawn;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventObject_FinishDeferredSpawn;

// Function DarkForestEvents.DFEventObject.GetEventTransform
// 0x0050 (0x0050 - 0x0000)
struct DFEventObject_GetEventTransform final
{
public:
	struct FDFEffectSettings                      Settings;                                          // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     OutTransform;                                      // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventObject_GetEventTransform;

// Function DarkForestEvents.DFEventObject.GetPlayerRelativeTransform
// 0x0080 (0x0080 - 0x0000)
struct DFEventObject_GetPlayerRelativeTransform final
{
public:
	struct FDFEventLocation                       Location;                                          // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FTransform                             OutTransform;                                      // 0x0020(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventObject_GetPlayerRelativeTransform;

// Function DarkForestEvents.DFEventObject.SpawnActor
// 0x0080 (0x0080 - 0x0000)
struct DFEventObject_SpawnActor final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DFEventObject_SpawnActor;

// Function DarkForestEvents.DFEventObject.SpawnActorDeferred
// 0x0080 (0x0080 - 0x0000)
struct DFEventObject_SpawnActorDeferred final
{
public:
	TSubclassOf<class AActor>                     ActorClass;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8[0x8];                                        // 0x0008(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0070(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_78[0x8];                                       // 0x0078(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DFEventObject_SpawnActorDeferred;

// Function DarkForestEvents.DFEventObject.TriggerEvent
// 0x0048 (0x0048 - 0x0000)
struct DFEventObject_TriggerEvent final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDFEffectSettings                      Settings;                                          // 0x0008(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventObject_TriggerEvent;

// Function DarkForestEvents.DFEventObject.GetAllTargetPointsWithEventTag
// 0x0020 (0x0020 - 0x0000)
struct DFEventObject_GetAllTargetPointsWithEventTag final
{
public:
	class FName                                   EventTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                     OutTargetPoints;                                   // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DFEventObject_GetAllTargetPointsWithEventTag;

// Function DarkForestEvents.DFEventsManager.AddEffect
// 0x0048 (0x0048 - 0x0000)
struct DFEventsManager_AddEffect final
{
public:
	struct FDFEffectSettings                      Effect;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DFEventsManager_AddEffect;

// Function DarkForestEvents.DFEventsManager.HandleEffectEnded
// 0x0368 (0x0368 - 0x0000)
struct DFEventsManager_HandleEffectEnded final
{
public:
	struct FActiveGameplayEffect                  Effect;                                            // 0x0000(0x0368)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventsManager_HandleEffectEnded;

// Function DarkForestEvents.DFEventsManager.HandleEffectExecuted
// 0x0008 (0x0008 - 0x0000)
struct DFEventsManager_HandleEffectExecuted final
{
public:
	const class UDFEffect*                        Effect;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventsManager_HandleEffectExecuted;

// Function DarkForestEvents.DFEventsManager.RemoveEffect
// 0x0040 (0x0040 - 0x0000)
struct DFEventsManager_RemoveEffect final
{
public:
	struct FDFEffectSettings                      Effect;                                            // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventsManager_RemoveEffect;

// Function DarkForestEvents.DFEventTriggerZone.OnOverlapBegin
// 0x0108 (0x0108 - 0x0000)
struct DFEventTriggerZone_OnOverlapBegin final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DFEventTriggerZone_OnOverlapBegin;

// Function DarkForestEvents.DFEventTriggerZone.OnOverlapEnd
// 0x0020 (0x0020 - 0x0000)
struct DFEventTriggerZone_OnOverlapEnd final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DFEventTriggerZone_OnOverlapEnd;

}

