#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Data_NPC_Village

#include "Basic.hpp"

#include "Smuta_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Data_NPC_Village.Data_NPC_Village_C
// 0x0090 (0x00C0 - 0x0030)
class UData_NPC_Village_C final : public UPrimaryDataAsset
{
public:
	TSoftObjectPtr<class USkeletalMesh>           SkeletalMesh;                                      // 0x0030(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 AnimBP;                                            // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class UEquipmentData*>                   Equipment;                                         // 0x0060(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        WalkSpeed;                                         // 0x00B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFraction                                     Fraction;                                          // 0x00B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Gender;                                            // 0x00B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Data_NPC_Village_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Data_NPC_Village_C")
	}
	static class UData_NPC_Village_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UData_NPC_Village_C>();
	}
};
DUMPER7_ASSERTS_UData_NPC_Village_C;

}

