#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DeathStrelec_ABP

#include "Basic.hpp"

#include "DeathStrelec_ABP_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass DeathStrelec_ABP.DeathStrelec_ABP_C
// 0x0370 (0x06C0 - 0x0350)
class UDeathStrelec_ABP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_348[0x8];                                      // 0x0348(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct DeathStrelec_ABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;             // 0x0358(0x0002)(HasGetValueTypeHash)
	uint8                                         Pad_35A[0x6];                                      // 0x035A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x0360(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x0368(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0370(0x0020)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0390(0x00B8)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x0448(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0470(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x04B8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x04D8(0x0048)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0520(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0568(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x05B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x05D0(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0698(0x0020)()
	bool                                          Can_Give_Up;                                       // 0x06B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DeathStrelec_ABP_AnimGraphNode_TransitionResult_1FD4DF0941342FC471F6D29FCB61EB2F();
	void ExecuteUbergraph_DeathStrelec_ABP(int32 EntryPoint);
	void OverwritingLayer(const struct FPoseLink& InPose, struct FPoseLink* OverwritingLayer_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DeathStrelec_ABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DeathStrelec_ABP_C")
	}
	static class UDeathStrelec_ABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDeathStrelec_ABP_C>();
	}
};
DUMPER7_ASSERTS_UDeathStrelec_ABP_C;

}

