#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DefaultSettings

#include "Basic.hpp"

#include "GameSettings_structs.hpp"
#include "Engine_classes.hpp"
#include "DisplaySettings_structs.hpp"
#include "AudioSettings_structs.hpp"
#include "ControlsSettings_structs.hpp"
#include "DLSSSettings_structs.hpp"
#include "FSRSettings_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass DefaultSettings.DefaultSettings_C
// 0x0078 (0x00A8 - 0x0030)
class UDefaultSettings_C final : public UPrimaryDataAsset
{
public:
	struct FGameSettings                          Game;                                              // 0x0030(0x0002)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAudioSettings                         Sound;                                             // 0x0038(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FControlsSettings                      Controls;                                          // 0x0058(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDLSSSettings                          DLSS;                                              // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDisplaySettings                       Display;                                           // 0x0088(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFSRSettings                           FSR;                                               // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DefaultSettings_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DefaultSettings_C")
	}
	static class UDefaultSettings_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDefaultSettings_C>();
	}
};
DUMPER7_ASSERTS_UDefaultSettings_C;

}

