#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DlgSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "DlgSystem_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function DlgSystem.DlgConditionCustom.IsConditionMet
// 0x0018 (0x0018 - 0x0000)
struct DlgConditionCustom_IsConditionMet final
{
public:
	const class UDlgContext*                      Context;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          Participant;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgConditionCustom_IsConditionMet;

// Function DlgSystem.DlgConditionCustom.IsParticipantRequired
// 0x0001 (0x0001 - 0x0000)
struct DlgConditionCustom_IsParticipantRequired final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgConditionCustom_IsParticipantRequired;

// Function DlgSystem.DlgContext.ChooseChild
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseChild final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_ChooseChild;

// Function DlgSystem.DlgContext.ChooseOption
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseOption final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_ChooseOption;

// Function DlgSystem.DlgContext.ChooseOptionFromAll
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseOptionFromAll final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_ChooseOptionFromAll;

// Function DlgSystem.DlgContext.ChooseSpeechSequenceOptionFromReplicated
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_ChooseSpeechSequenceOptionFromReplicated final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_ChooseSpeechSequenceOptionFromReplicated;

// Function DlgSystem.DlgContext.GetParticipantFromName
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetParticipantFromName final
{
public:
	struct FDlgParticipantName                    Participant;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetParticipantFromName;

// Function DlgSystem.DlgContext.ReevaluateChildren
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_ReevaluateChildren final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_ReevaluateChildren;

// Function DlgSystem.DlgContext.ReevaluateOptions
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_ReevaluateOptions final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_ReevaluateOptions;

// Function DlgSystem.DlgContext.GetActiveNodeData
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeData final
{
public:
	class UDlgNodeData*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeData;

// Function DlgSystem.DlgContext.GetActiveNodeGenericData
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeGenericData final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeGenericData;

// Function DlgSystem.DlgContext.GetActiveNodeGUID
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetActiveNodeGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeGUID;

// Function DlgSystem.DlgContext.GetActiveNodeIndex
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetActiveNodeIndex final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeIndex;

// Function DlgSystem.DlgContext.GetActiveNodeParticipant
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeParticipant final
{
public:
	class UObject*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeParticipant;

// Function DlgSystem.DlgContext.GetActiveNodeParticipantDisplayName
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetActiveNodeParticipantDisplayName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeParticipantDisplayName;

// Function DlgSystem.DlgContext.GetActiveNodeParticipantIcon
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeParticipantIcon final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeParticipantIcon;

// Function DlgSystem.DlgContext.GetActiveNodeParticipantName
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeParticipantName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeParticipantName;

// Function DlgSystem.DlgContext.GetActiveNodeSpeakerState
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeSpeakerState final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeSpeakerState;

// Function DlgSystem.DlgContext.GetActiveNodeText
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetActiveNodeText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeText;

// Function DlgSystem.DlgContext.GetActiveNodeVoiceDialogueWave
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeVoiceDialogueWave final
{
public:
	class UDialogueWave*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeVoiceDialogueWave;

// Function DlgSystem.DlgContext.GetActiveNodeVoiceSoundBase
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeVoiceSoundBase final
{
public:
	class USoundBase*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeVoiceSoundBase;

// Function DlgSystem.DlgContext.GetActiveNodeVoiceSoundWave
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetActiveNodeVoiceSoundWave final
{
public:
	class USoundWave*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetActiveNodeVoiceSoundWave;

// Function DlgSystem.DlgContext.GetAllOptionsArray
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetAllOptionsArray final
{
public:
	TArray<struct FDlgEdgeData>                   ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetAllOptionsArray;

// Function DlgSystem.DlgContext.GetAllOptionsNum
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetAllOptionsNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetAllOptionsNum;

// Function DlgSystem.DlgContext.GetContextString
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetContextString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetContextString;

// Function DlgSystem.DlgContext.GetDialogue
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetDialogue final
{
public:
	class UDlgDialogue*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetDialogue;

// Function DlgSystem.DlgContext.GetDialogueGUID
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetDialogueGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetDialogueGUID;

// Function DlgSystem.DlgContext.GetDialogueName
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetDialogueName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetDialogueName;

// Function DlgSystem.DlgContext.GetDialoguePathName
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetDialoguePathName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetDialoguePathName;

// Function DlgSystem.DlgContext.GetMutableActiveNode
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetMutableActiveNode final
{
public:
	class UDlgNode*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetMutableActiveNode;

// Function DlgSystem.DlgContext.GetMutableActiveNodeAsSpeechSequence
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_GetMutableActiveNodeAsSpeechSequence final
{
public:
	class UDlgNode_SpeechSequence*                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetMutableActiveNodeAsSpeechSequence;

// Function DlgSystem.DlgContext.GetMutableNodeFromGUID
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetMutableNodeFromGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgNode*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetMutableNodeFromGUID;

// Function DlgSystem.DlgContext.GetMutableNodeFromIndex
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetMutableNodeFromIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgNode*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetMutableNodeFromIndex;

// Function DlgSystem.DlgContext.GetMutableParticipant
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetMutableParticipant final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetMutableParticipant;

// Function DlgSystem.DlgContext.GetNodeGUIDForIndex
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_GetNodeGUIDForIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetNodeGUIDForIndex;

// Function DlgSystem.DlgContext.GetNodeIndexForGUID
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_GetNodeIndexForGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetNodeIndexForGUID;

// Function DlgSystem.DlgContext.GetOption
// 0x0078 (0x0078 - 0x0000)
struct DlgContext_GetOption final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgEdge                               ReturnValue;                                       // 0x0008(0x0070)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOption;

// Function DlgSystem.DlgContext.GetOptionEnterConditions
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_GetOptionEnterConditions final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgCondition>                  ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionEnterConditions;

// Function DlgSystem.DlgContext.GetOptionFromAll
// 0x0080 (0x0080 - 0x0000)
struct DlgContext_GetOptionFromAll final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgEdgeData                           ReturnValue;                                       // 0x0008(0x0078)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionFromAll;

// Function DlgSystem.DlgContext.GetOptionsArray
// 0x0010 (0x0010 - 0x0000)
struct DlgContext_GetOptionsArray final
{
public:
	TArray<struct FDlgEdge>                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionsArray;

// Function DlgSystem.DlgContext.GetOptionsNum
// 0x0004 (0x0004 - 0x0000)
struct DlgContext_GetOptionsNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionsNum;

// Function DlgSystem.DlgContext.GetOptionSpeakerState
// 0x000C (0x000C - 0x0000)
struct DlgContext_GetOptionSpeakerState final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionSpeakerState;

// Function DlgSystem.DlgContext.GetOptionSpeakerStateFromAll
// 0x000C (0x000C - 0x0000)
struct DlgContext_GetOptionSpeakerStateFromAll final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   ReturnValue;                                       // 0x0004(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionSpeakerStateFromAll;

// Function DlgSystem.DlgContext.GetOptionText
// 0x0020 (0x0020 - 0x0000)
struct DlgContext_GetOptionText final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionText;

// Function DlgSystem.DlgContext.GetOptionTextFromAll
// 0x0020 (0x0020 - 0x0000)
struct DlgContext_GetOptionTextFromAll final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetOptionTextFromAll;

// Function DlgSystem.DlgContext.GetParticipants
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetParticipants final
{
public:
	TMap<class FName, class UObject*>             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetParticipants;

// Function DlgSystem.DlgContext.GetParticipantsMap
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetParticipantsMap final
{
public:
	TMap<class FName, class UObject*>             ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetParticipantsMap;

// Function DlgSystem.DlgContext.GetVisitedNodeGUIDs
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetVisitedNodeGUIDs final
{
public:
	TSet<struct FGuid>                            ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetVisitedNodeGUIDs;

// Function DlgSystem.DlgContext.GetVisitedNodeIndices
// 0x0050 (0x0050 - 0x0000)
struct DlgContext_GetVisitedNodeIndices final
{
public:
	TSet<int32>                                   ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_GetVisitedNodeIndices;

// Function DlgSystem.DlgContext.HasDialogueEnded
// 0x0001 (0x0001 - 0x0000)
struct DlgContext_HasDialogueEnded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgContext_HasDialogueEnded;

// Function DlgSystem.DlgContext.IsNodeVisited
// 0x0018 (0x0018 - 0x0000)
struct DlgContext_IsNodeVisited final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  NodeGuid;                                          // 0x0004(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalHistory;                                     // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0015(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsNodeVisited;

// Function DlgSystem.DlgContext.IsOptionConnectedToEndNode
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsOptionConnectedToEndNode final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIndexSkipsUnsatisfiedEdges;                       // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0005(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsOptionConnectedToEndNode;

// Function DlgSystem.DlgContext.IsOptionConnectedToVisitedNode
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsOptionConnectedToVisitedNode final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLocalHistory;                                     // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIndexSkipsUnsatisfiedEdges;                       // 0x0005(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0006(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsOptionConnectedToVisitedNode;

// Function DlgSystem.DlgContext.IsOptionSatisfied
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsOptionSatisfied final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsOptionSatisfied;

// Function DlgSystem.DlgContext.IsValidAllOptionIndex
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsValidAllOptionIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsValidAllOptionIndex;

// Function DlgSystem.DlgContext.IsValidNodeGUID
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_IsValidNodeGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsValidNodeGUID;

// Function DlgSystem.DlgContext.IsValidNodeIndex
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsValidNodeIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsValidNodeIndex;

// Function DlgSystem.DlgContext.IsValidOptionIndex
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_IsValidOptionIndex final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_IsValidOptionIndex;

// Function DlgSystem.DlgContext.WasNodeGUIDVisitedInThisContext
// 0x0014 (0x0014 - 0x0000)
struct DlgContext_WasNodeGUIDVisitedInThisContext final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_WasNodeGUIDVisitedInThisContext;

// Function DlgSystem.DlgContext.WasNodeIndexVisitedInThisContext
// 0x0008 (0x0008 - 0x0000)
struct DlgContext_WasNodeIndexVisitedInThisContext final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_DlgContext_WasNodeIndexVisitedInThisContext;

// Function DlgSystem.DlgDialogue.GetMutableStartNodes
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetMutableStartNodes final
{
public:
	TArray<class UDlgNode*>                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetMutableStartNodes;

// Function DlgSystem.DlgDialogue.GetAllParticipantNames
// 0x0050 (0x0050 - 0x0000)
struct DlgDialogue_GetAllParticipantNames final
{
public:
	TSet<class FName>                             Outset;                                            // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetAllParticipantNames;

// Function DlgSystem.DlgDialogue.GetAllSpeakerStates
// 0x0050 (0x0050 - 0x0000)
struct DlgDialogue_GetAllSpeakerStates final
{
public:
	TSet<class FName>                             Outset;                                            // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetAllSpeakerStates;

// Function DlgSystem.DlgDialogue.GetBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetBoolNames;

// Function DlgSystem.DlgDialogue.GetClassBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetClassBoolNames;

// Function DlgSystem.DlgDialogue.GetClassFloatNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassFloatNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetClassFloatNames;

// Function DlgSystem.DlgDialogue.GetClassIntNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassIntNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetClassIntNames;

// Function DlgSystem.DlgDialogue.GetClassNameNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassNameNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetClassNameNames;

// Function DlgSystem.DlgDialogue.GetClassTextNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetClassTextNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetClassTextNames;

// Function DlgSystem.DlgDialogue.GetConditions
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetConditions final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetConditions;

// Function DlgSystem.DlgDialogue.GetCustomEvents
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetCustomEvents final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetCustomEvents;

// Function DlgSystem.DlgDialogue.GetDialogueFName
// 0x0008 (0x0008 - 0x0000)
struct DlgDialogue_GetDialogueFName final
{
public:
	class FName                                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetDialogueFName;

// Function DlgSystem.DlgDialogue.GetDialogueName
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetDialogueName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetDialogueName;

// Function DlgSystem.DlgDialogue.GetDialogueVersion
// 0x0004 (0x0004 - 0x0000)
struct DlgDialogue_GetDialogueVersion final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetDialogueVersion;

// Function DlgSystem.DlgDialogue.GetEvents
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetEvents final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetEvents;

// Function DlgSystem.DlgDialogue.GetFloatNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetFloatNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetFloatNames;

// Function DlgSystem.DlgDialogue.GetGUID
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetGUID final
{
public:
	struct FGuid                                  ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetGUID;

// Function DlgSystem.DlgDialogue.GetIntNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetIntNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetIntNames;

// Function DlgSystem.DlgDialogue.GetMutableNodeFromGUID
// 0x0018 (0x0018 - 0x0000)
struct DlgDialogue_GetMutableNodeFromGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgNode*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetMutableNodeFromGUID;

// Function DlgSystem.DlgDialogue.GetMutableNodeFromIndex
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetMutableNodeFromIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgNode*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetMutableNodeFromIndex;

// Function DlgSystem.DlgDialogue.GetMutableStartNode
// 0x0008 (0x0008 - 0x0000)
struct DlgDialogue_GetMutableStartNode final
{
public:
	class UDlgNode*                               ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetMutableStartNode;

// Function DlgSystem.DlgDialogue.GetNameNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetNameNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             Outset;                                            // 0x0008(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetNameNames;

// Function DlgSystem.DlgDialogue.GetNodeGUIDForIndex
// 0x0014 (0x0014 - 0x0000)
struct DlgDialogue_GetNodeGUIDForIndex final
{
public:
	int32                                         NodeIndex;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0004(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetNodeGUIDForIndex;

// Function DlgSystem.DlgDialogue.GetNodeIndexForGUID
// 0x0014 (0x0014 - 0x0000)
struct DlgDialogue_GetNodeIndexForGUID final
{
public:
	struct FGuid                                  NodeGuid;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetNodeIndexForGUID;

// Function DlgSystem.DlgDialogue.GetNodes
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetNodes final
{
public:
	TArray<class UDlgNode*>                       ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetNodes;

// Function DlgSystem.DlgDialogue.GetParticipantBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantBoolNames;

// Function DlgSystem.DlgDialogue.GetParticipantClass
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetParticipantClass final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantClass;

// Function DlgSystem.DlgDialogue.GetParticipantClassBoolNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantClassBoolNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantClassBoolNames;

// Function DlgSystem.DlgDialogue.GetParticipantClasses
// 0x0010 (0x0010 - 0x0000)
struct DlgDialogue_GetParticipantClasses final
{
public:
	TArray<struct FDlgParticipantClass>           ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantClasses;

// Function DlgSystem.DlgDialogue.GetParticipantClassFloatNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantClassFloatNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantClassFloatNames;

// Function DlgSystem.DlgDialogue.GetParticipantClassFNameNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantClassFNameNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantClassFNameNames;

// Function DlgSystem.DlgDialogue.GetParticipantClassFTextNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantClassFTextNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantClassFTextNames;

// Function DlgSystem.DlgDialogue.GetParticipantClassIntNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantClassIntNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantClassIntNames;

// Function DlgSystem.DlgDialogue.GetParticipantConditionNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantConditionNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantConditionNames;

// Function DlgSystem.DlgDialogue.GetParticipantCustomConditions
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantCustomConditions final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantCustomConditions;

// Function DlgSystem.DlgDialogue.GetParticipantCustomEvents
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantCustomEvents final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantCustomEvents;

// Function DlgSystem.DlgDialogue.GetParticipantCustomTextArguments
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantCustomTextArguments final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantCustomTextArguments;

// Function DlgSystem.DlgDialogue.GetParticipantEventNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantEventNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantEventNames;

// Function DlgSystem.DlgDialogue.GetParticipantFloatNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantFloatNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantFloatNames;

// Function DlgSystem.DlgDialogue.GetParticipantFNameNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantFNameNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantFNameNames;

// Function DlgSystem.DlgDialogue.GetParticipantIntNames
// 0x0058 (0x0058 - 0x0000)
struct DlgDialogue_GetParticipantIntNames final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FName>                             ReturnValue;                                       // 0x0008(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantIntNames;

// Function DlgSystem.DlgDialogue.GetParticipantNames
// 0x0050 (0x0050 - 0x0000)
struct DlgDialogue_GetParticipantNames final
{
public:
	TSet<class FName>                             ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantNames;

// Function DlgSystem.DlgDialogue.GetParticipantsData
// 0x0050 (0x0050 - 0x0000)
struct DlgDialogue_GetParticipantsData final
{
public:
	TMap<class FName, struct FDlgParticipantData> ReturnValue;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_DlgDialogue_GetParticipantsData;

// Function DlgSystem.DlgDialogue.GetParticipantsNum
// 0x0004 (0x0004 - 0x0000)
