#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DlgSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "DlgSystem_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "SlateCore_structs.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class DlgSystem.DlgObject
// 0x0000 (0x0028 - 0x0028)
class UDlgObject : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgObject")
	}
	static class UDlgObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgObject>();
	}
};
DUMPER7_ASSERTS_UDlgObject;

// Class DlgSystem.DlgConditionCustom
// 0x0000 (0x0028 - 0x0028)
class UDlgConditionCustom : public UDlgObject
{
public:
	bool IsConditionMet(const class UDlgContext* Context, const class UObject* Participant);
	bool IsParticipantRequired();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgConditionCustom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgConditionCustom")
	}
	static class UDlgConditionCustom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgConditionCustom>();
	}
};
DUMPER7_ASSERTS_UDlgConditionCustom;

// Class DlgSystem.DlgConditionCustomHideCategories
// 0x0000 (0x0028 - 0x0028)
class UDlgConditionCustomHideCategories final : public UDlgConditionCustom
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgConditionCustomHideCategories")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgConditionCustomHideCategories")
	}
	static class UDlgConditionCustomHideCategories* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgConditionCustomHideCategories>();
	}
};
DUMPER7_ASSERTS_UDlgConditionCustomHideCategories;

// Class DlgSystem.DlgContext
// 0x0188 (0x01B0 - 0x0028)
class UDlgContext final : public UDlgObject
{
public:
	class UDlgDialogue*                           Dialogue;                                          // 0x0028(0x0008)(Net, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UObject*>                        SerializedParticipants;                            // 0x0030(0x0010)(Net, ZeroConstructor, RepNotify, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UObject*>             Participants;                                      // 0x0040(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_90[0x120];                                     // 0x0090(0x0120)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ChooseChild(int32 OptionIndex);
	bool ChooseOption(int32 OptionIndex);
	bool ChooseOptionFromAll(int32 Index_0);
	bool ChooseSpeechSequenceOptionFromReplicated(int32 OptionIndex);
	class UObject* GetParticipantFromName(const struct FDlgParticipantName& Participant);
	void OnRep_SerializedParticipants();
	bool ReevaluateChildren();
	bool ReevaluateOptions();

	class UDlgNodeData* GetActiveNodeData() const;
	class UObject* GetActiveNodeGenericData() const;
	struct FGuid GetActiveNodeGUID() const;
	int32 GetActiveNodeIndex() const;
	class UObject* GetActiveNodeParticipant() const;
	class FText GetActiveNodeParticipantDisplayName() const;
	class UTexture2D* GetActiveNodeParticipantIcon() const;
	class FName GetActiveNodeParticipantName() const;
	class FName GetActiveNodeSpeakerState() const;
	const class FText GetActiveNodeText() const;
	class UDialogueWave* GetActiveNodeVoiceDialogueWave() const;
	class USoundBase* GetActiveNodeVoiceSoundBase() const;
	class USoundWave* GetActiveNodeVoiceSoundWave() const;
	const TArray<struct FDlgEdgeData> GetAllOptionsArray() const;
	int32 GetAllOptionsNum() const;
	class FString GetContextString() const;
	class UDlgDialogue* GetDialogue() const;
	struct FGuid GetDialogueGUID() const;
	class FName GetDialogueName() const;
	class FString GetDialoguePathName() const;
	class UDlgNode* GetMutableActiveNode() const;
	class UDlgNode_SpeechSequence* GetMutableActiveNodeAsSpeechSequence() const;
	class UDlgNode* GetMutableNodeFromGUID(const struct FGuid& NodeGuid) const;
	class UDlgNode* GetMutableNodeFromIndex(int32 NodeIndex) const;
	class UObject* GetMutableParticipant(class FName ParticipantName) const;
	struct FGuid GetNodeGUIDForIndex(int32 NodeIndex) const;
	int32 GetNodeIndexForGUID(const struct FGuid& NodeGuid) const;
	const struct FDlgEdge GetOption(int32 OptionIndex) const;
	const TArray<struct FDlgCondition> GetOptionEnterConditions(int32 OptionIndex) const;
	const struct FDlgEdgeData GetOptionFromAll(int32 Index_0) const;
	const TArray<struct FDlgEdge> GetOptionsArray() const;
	int32 GetOptionsNum() const;
	class FName GetOptionSpeakerState(int32 OptionIndex) const;
	class FName GetOptionSpeakerStateFromAll(int32 Index_0) const;
	const class FText GetOptionText(int32 OptionIndex) const;
	const class FText GetOptionTextFromAll(int32 Index_0) const;
	const TMap<class FName, class UObject*> GetParticipants() const;
	const TMap<class FName, class UObject*> GetParticipantsMap() const;
	const TSet<struct FGuid> GetVisitedNodeGUIDs() const;
	const TSet<int32> GetVisitedNodeIndices() const;
	bool HasDialogueEnded() const;
	bool IsNodeVisited(int32 NodeIndex, const struct FGuid& NodeGuid, bool bLocalHistory) const;
	bool IsOptionConnectedToEndNode(int32 Index_0, bool bIndexSkipsUnsatisfiedEdges) const;
	bool IsOptionConnectedToVisitedNode(int32 Index_0, bool bLocalHistory, bool bIndexSkipsUnsatisfiedEdges) const;
	bool IsOptionSatisfied(int32 Index_0) const;
	bool IsValidAllOptionIndex(int32 Index_0) const;
	bool IsValidNodeGUID(const struct FGuid& NodeGuid) const;
	bool IsValidNodeIndex(int32 NodeIndex) const;
	bool IsValidOptionIndex(int32 OptionIndex) const;
	bool WasNodeGUIDVisitedInThisContext(const struct FGuid& NodeGuid) const;
	bool WasNodeIndexVisitedInThisContext(int32 NodeIndex) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgContext")
	}
	static class UDlgContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgContext>();
	}
};
DUMPER7_ASSERTS_UDlgContext;

// Class DlgSystem.DlgDialogue
// 0x0150 (0x0178 - 0x0028)
class UDlgDialogue final : public UObject
{
public:
	int32                                         Version;                                           // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                   Name_0;                                            // 0x002C(0x0008)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                  Guid;                                              // 0x0034(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bParticipantsOptional;                             // 0x0044(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgParticipantClass>           ParticipantsClasses;                               // 0x0048(0x0010)(Edit, EditFixedSize, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FDlgParticipantData> ParticipantsData;                                  // 0x0058(0x0050)(Edit, EditConst, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	TSet<class FName>                             AllSpeakerStates;                                  // 0x00A8(0x0050)(Edit, EditConst, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	class UDlgNode*                               StartNode;                                         // 0x00F8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, Deprecated, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UDlgNode*>                       StartNodes;                                        // 0x0100(0x0010)(Edit, ExportObject, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UDlgNode*>                       Nodes;                                             // 0x0110(0x0010)(ExportObject, EditFixedSize, ZeroConstructor, ContainsInstancedReference, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGuid, int32>                     NodesGUIDToIndexMap;                               // 0x0120(0x0050)(Edit, EditConst, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<class UDlgNode*> GetMutableStartNodes();

	void GetAllParticipantNames(TSet<class FName>* Outset) const;
	void GetAllSpeakerStates(TSet<class FName>* Outset) const;
	void GetBoolNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassBoolNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassFloatNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassIntNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassNameNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetClassTextNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetConditions(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetCustomEvents(class FName ParticipantName, TSet<class UClass*>* Outset) const;
	class FName GetDialogueFName() const;
	class FString GetDialogueName() const;
	int32 GetDialogueVersion() const;
	void GetEvents(class FName ParticipantName, TSet<class FName>* Outset) const;
	void GetFloatNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	struct FGuid GetGUID() const;
	void GetIntNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	class UDlgNode* GetMutableNodeFromGUID(const struct FGuid& NodeGuid) const;
	class UDlgNode* GetMutableNodeFromIndex(int32 NodeIndex) const;
	class UDlgNode* GetMutableStartNode() const;
	void GetNameNames(class FName ParticipantName, TSet<class FName>* Outset) const;
	struct FGuid GetNodeGUIDForIndex(int32 NodeIndex) const;
	int32 GetNodeIndexForGUID(const struct FGuid& NodeGuid) const;
	const TArray<class UDlgNode*> GetNodes() const;
	TSet<class FName> GetParticipantBoolNames(class FName ParticipantName) const;
	class UClass* GetParticipantClass(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassBoolNames(class FName ParticipantName) const;
	const TArray<struct FDlgParticipantClass> GetParticipantClasses() const;
	TSet<class FName> GetParticipantClassFloatNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassFNameNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassFTextNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantClassIntNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantConditionNames(class FName ParticipantName) const;
	TSet<class UClass*> GetParticipantCustomConditions(class FName ParticipantName) const;
	TSet<class UClass*> GetParticipantCustomEvents(class FName ParticipantName) const;
	TSet<class UClass*> GetParticipantCustomTextArguments(class FName ParticipantName) const;
	TSet<class FName> GetParticipantEventNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantFloatNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantFNameNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantIntNames(class FName ParticipantName) const;
	TSet<class FName> GetParticipantNames() const;
	const TMap<class FName, struct FDlgParticipantData> GetParticipantsData() const;
	int32 GetParticipantsNum() const;
	TSet<class FName> GetSpeakerStates() const;
	bool HasGUID() const;
	bool HasParticipant(class FName ParticipantName) const;
	bool IsParticipantsOptional() const;
	bool IsValidNodeGUID(const struct FGuid& NodeGuid) const;
	bool IsValidNodeIndex(int32 NodeIndex) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgDialogue")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgDialogue")
	}
	static class UDlgDialogue* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgDialogue>();
	}
};
DUMPER7_ASSERTS_UDlgDialogue;

// Class DlgSystem.DlgDialogueParticipant
// 0x0000 (0x0000 - 0x0000)
class IDlgDialogueParticipant final
{
public:
	bool ModifyBoolValue(class FName ValueName, bool bNewValue);
	bool ModifyFloatValue(class FName ValueName, bool bDelta, float Value);
	bool ModifyIntValue(class FName ValueName, bool bDelta, int32 Value);
	bool ModifyNameValue(class FName ValueName, class FName NameValue);
	bool OnDialogueEvent(class UDlgContext* Context, class FName EventName);

	bool CheckCondition(const class UDlgContext* Context, class FName ConditionName) const;
	bool GetBoolValue(class FName ValueName) const;
	float GetFloatValue(class FName ValueName) const;
	int32 GetIntValue(class FName ValueName) const;
	class FName GetNameValue(class FName ValueName) const;
	class FText GetParticipantDisplayName(class FName ActiveSpeaker) const;
	ETextGender GetParticipantGender() const;
	class UTexture2D* GetParticipantIcon(class FName ActiveSpeaker, class FName ActiveSpeakerState) const;
	class FName GetParticipantName() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgDialogueParticipant")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgDialogueParticipant")
	}
	static class IDlgDialogueParticipant* GetDefaultObj()
	{
		return GetDefaultObjImpl<IDlgDialogueParticipant>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IDlgDialogueParticipant;

// Class DlgSystem.DlgEventCustom
// 0x0000 (0x0028 - 0x0028)
class UDlgEventCustom : public UDlgObject
{
public:
	void EnterEvent(class UDlgContext* Context, class UObject* Participant);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgEventCustom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgEventCustom")
	}
	static class UDlgEventCustom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgEventCustom>();
	}
};
DUMPER7_ASSERTS_UDlgEventCustom;

// Class DlgSystem.DlgEventCustomHideCategories
// 0x0000 (0x0028 - 0x0028)
class UDlgEventCustomHideCategories final : public UDlgEventCustom
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgEventCustomHideCategories")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgEventCustomHideCategories")
	}
	static class UDlgEventCustomHideCategories* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgEventCustomHideCategories>();
	}
};
DUMPER7_ASSERTS_UDlgEventCustomHideCategories;

// Class DlgSystem.DlgTestObjectPrimitivesBase
// 0x0020 (0x0048 - 0x0028)
class UDlgTestObjectPrimitivesBase : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Integer;                                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgTestObjectPrimitivesBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgTestObjectPrimitivesBase")
	}
	static class UDlgTestObjectPrimitivesBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitivesBase>();
	}
};
DUMPER7_ASSERTS_UDlgTestObjectPrimitivesBase;

// Class DlgSystem.DlgTestObjectPrimitives_DefaultToInstanced
// 0x0010 (0x0058 - 0x0048)
class UDlgTestObjectPrimitives_DefaultToInstanced final : public UDlgTestObjectPrimitivesBase
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InstancedChild;                                    // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgTestObjectPrimitives_DefaultToInstanced")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgTestObjectPrimitives_DefaultToInstanced")
	}
	static class UDlgTestObjectPrimitives_DefaultToInstanced* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_DefaultToInstanced>();
	}
};
DUMPER7_ASSERTS_UDlgTestObjectPrimitives_DefaultToInstanced;

// Class DlgSystem.DlgTestObjectPrimitives_ChildA
// 0x0010 (0x0058 - 0x0048)
class UDlgTestObjectPrimitives_ChildA : public UDlgTestObjectPrimitivesBase
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntegerChildA;                                     // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgTestObjectPrimitives_ChildA")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgTestObjectPrimitives_ChildA")
	}
	static class UDlgTestObjectPrimitives_ChildA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_ChildA>();
	}
};
DUMPER7_ASSERTS_UDlgTestObjectPrimitives_ChildA;

// Class DlgSystem.DlgTestObjectPrimitives_ChildB
// 0x0018 (0x0060 - 0x0048)
class UDlgTestObjectPrimitives_ChildB final : public UDlgTestObjectPrimitivesBase
{
public:
	uint8                                         Pad_48[0x8];                                       // 0x0048(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 StringChildB;                                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgTestObjectPrimitives_ChildB")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgTestObjectPrimitives_ChildB")
	}
	static class UDlgTestObjectPrimitives_ChildB* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_ChildB>();
	}
};
DUMPER7_ASSERTS_UDlgTestObjectPrimitives_ChildB;

// Class DlgSystem.DlgTestObjectPrimitives_GrandChildA_Of_ChildA
// 0x0010 (0x0068 - 0x0058)
class UDlgTestObjectPrimitives_GrandChildA_Of_ChildA final : public UDlgTestObjectPrimitives_ChildA
{
public:
	uint8                                         Pad_58[0x8];                                       // 0x0058(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IntegerGrandChildA_Of_ChildA;                      // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgTestObjectPrimitives_GrandChildA_Of_ChildA")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgTestObjectPrimitives_GrandChildA_Of_ChildA")
	}
	static class UDlgTestObjectPrimitives_GrandChildA_Of_ChildA* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgTestObjectPrimitives_GrandChildA_Of_ChildA>();
	}
};
DUMPER7_ASSERTS_UDlgTestObjectPrimitives_GrandChildA_Of_ChildA;

// Class DlgSystem.DlgManager
// 0x0000 (0x0028 - 0x0028)
class UDlgManager final : public UBlueprintFunctionLibrary
{
public:
	static bool CanStartDialogue(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants);
	static void ClearDialogueHistory();
	static void ClearDialoguePersistentWorldContextObject();
	static bool DoesObjectImplementDialogueParticipantInterface(const class UObject* Object);
	static void GetAllDialoguesBoolNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesConditionNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesEventNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesFloatNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesIntNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesNameNames(class FName ParticipantName, TArray<class FName>* OutArray);
	static void GetAllDialoguesParticipantNames(TArray<class FName>* OutArray);
	static void GetAllDialoguesSpeakerStates(TArray<class FName>* OutArray);
	static const TMap<struct FGuid, struct FDlgHistory> GetDialogueHistory();
	static TArray<class FName> GetDialoguesParticipantBoolNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantConditionNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantEventNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantFloatNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantFNameNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantIntNames(class FName ParticipantName);
	static TArray<class FName> GetDialoguesParticipantNames();
	static TArray<class FName> GetDialoguesSpeakerStates();
	static class UWorld* GetDialogueWorld();
	static TMap<class FName, struct FDlgObjectsArray> GetObjectsMapWithDialogueParticipantInterface(class UObject* WorldContextObject);
	static TArray<class UObject*> GetObjectsWithDialogueParticipantInterface(class UObject* WorldContextObject);
	static bool IsObjectACustomCondition(const class UObject* Object);
	static bool IsObjectACustomEvent(const class UObject* Object);
	static bool IsObjectACustomTextArgument(const class UObject* Object);
	static bool IsObjectANodeData(const class UObject* Object);
	static bool RegisterDialogueConsoleCommands();
	static class UDlgContext* ResumeDialogueFromNodeGUID(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants, const struct FGuid& StartNodeGUID, const TSet<struct FGuid>& AlreadyVisitedNodes, bool bFireEnterEvents);
	static class UDlgContext* ResumeDialogueFromNodeIndex(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants, int32 StartIndex, const TSet<int32>& AlreadyVisitedNodes, bool bFireEnterEvents);
	static void SetDialogueHistory(const TMap<struct FGuid, struct FDlgHistory>& DlgHistory);
	static void SetDialoguePersistentWorldContextObject(const class UObject* WorldContextObject);
	static class UDlgContext* StartDialogue(class UDlgDialogue* Dialogue, const TArray<class UObject*>& Participants);
	static class UDlgContext* StartDialogue2(class UDlgDialogue* Dialogue, class UObject* Participant0, class UObject* Participant1);
	static class UDlgContext* StartDialogue3(class UDlgDialogue* Dialogue, class UObject* Participant0, class UObject* Participant1, class UObject* Participant2);
	static class UDlgContext* StartDialogue4(class UDlgDialogue* Dialogue, class UObject* Participant0, class UObject* Participant1, class UObject* Participant2, class UObject* Participant3);
	static class UDlgContext* StartDialogueWithDefaultParticipants(class UObject* WorldContextObject, class UDlgDialogue* Dialogue);
	static class UDlgContext* StartMonologue(class UDlgDialogue* Dialogue, class UObject* Participant);
	static bool UnregisterDialogueConsoleCommands();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgManager")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgManager")
	}
	static class UDlgManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgManager>();
	}
};
DUMPER7_ASSERTS_UDlgManager;

// Class DlgSystem.DlgNode
// 0x0070 (0x0098 - 0x0028)
class UDlgNode : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OwnerName;                                         // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCheckChildrenOnEvaluation;                        // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgCondition>                  EnterConditions;                                   // 0x0050(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	EDlgEntryRestriction                          EnterRestriction;                                  // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FDlgEvent>                      EnterEvents;                                       // 0x0068(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FGuid                                  NodeGuid;                                          // 0x0078(0x0010)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FDlgEdge>                       Children;                                          // 0x0088(0x0010)(Edit, EditFixedSize, ZeroConstructor, EditConst, ContainsInstancedReference, AdvancedDisplay, Protected, NativeAccessSpecifierProtected)

public:
	bool GetCheckChildrenOnEvaluation() const;
	struct FGuid GetGUID() const;
	const struct FDlgEdge GetNodeChildAt(int32 EdgeIndex) const;
	const TArray<struct FDlgEdge> GetNodeChildren() const;
	class UDlgNodeData* GetNodeData() const;
	const TArray<struct FDlgCondition> GetNodeEnterConditions() const;
	const TArray<struct FDlgEvent> GetNodeEnterEvents() const;
	class UObject* GetNodeGenericData() const;
	class FName GetNodeParticipantName() const;
	const class FText GetNodeText() const;
	const class FText GetNodeUnformattedText() const;
	class UDialogueWave* GetNodeVoiceDialogueWave() const;
	class USoundBase* GetNodeVoiceSoundBase() const;
	class USoundWave* GetNodeVoiceSoundWave() const;
	int32 GetNumNodeChildren() const;
	class FName GetSpeakerState() const;
	const TArray<struct FDlgTextArgument> GetTextArguments() const;
	bool HasAnyEnterConditions() const;
	bool HasAnyEnterEvents() const;
	bool HasGUID() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode")
	}
	static class UDlgNode* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode>();
	}
};
DUMPER7_ASSERTS_UDlgNode;

// Class DlgSystem.DlgNodeData
// 0x0000 (0x0028 - 0x0028)
class UDlgNodeData : public UDlgObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNodeData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNodeData")
	}
	static class UDlgNodeData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNodeData>();
	}
};
DUMPER7_ASSERTS_UDlgNodeData;

// Class DlgSystem.DlgNodeDataHideCategories
// 0x0000 (0x0028 - 0x0028)
class UDlgNodeDataHideCategories final : public UDlgNodeData
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNodeDataHideCategories")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNodeDataHideCategories")
	}
	static class UDlgNodeDataHideCategories* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNodeDataHideCategories>();
	}
};
DUMPER7_ASSERTS_UDlgNodeDataHideCategories;

// Class DlgSystem.DlgNode_Custom
// 0x0000 (0x0098 - 0x0098)
class UDlgNode_Custom final : public UDlgNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode_Custom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode_Custom")
	}
	static class UDlgNode_Custom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Custom>();
	}
};
DUMPER7_ASSERTS_UDlgNode_Custom;

// Class DlgSystem.DlgNode_End
// 0x0000 (0x0098 - 0x0098)
class UDlgNode_End final : public UDlgNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode_End")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode_End")
	}
	static class UDlgNode_End* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_End>();
	}
};
DUMPER7_ASSERTS_UDlgNode_End;

// Class DlgSystem.DlgNode_Proxy
// 0x0008 (0x00A0 - 0x0098)
class UDlgNode_Proxy final : public UDlgNode
{
public:
	int32                                         NodeIndex;                                         // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode_Proxy")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode_Proxy")
	}
	static class UDlgNode_Proxy* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Proxy>();
	}
};
DUMPER7_ASSERTS_UDlgNode_Proxy;

// Class DlgSystem.DlgNode_Selector
// 0x0020 (0x00B8 - 0x0098)
class UDlgNode_Selector final : public UDlgNode
{
public:
	EDlgNodeSelectorType                          SelectorType;                                      // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAvoidPickingSameOptionTwiceInARow;                // 0x0099(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCycleThroughSatisfiedOptionsWithoutRepetition;    // 0x009A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9B[0x5];                                       // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DynamicDisplayText;                                // 0x00A0(0x0018)(Transient, Protected, NativeAccessSpecifierProtected)

public:
	EDlgNodeSelectorType GetSelectorType() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode_Selector")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode_Selector")
	}
	static class UDlgNode_Selector* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Selector>();
	}
};
DUMPER7_ASSERTS_UDlgNode_Selector;

// Class DlgSystem.DlgNode_Speech
// 0x0078 (0x0110 - 0x0098)
class UDlgNode_Speech final : public UDlgNode
{
public:
	bool                                          bIsVirtualParent;                                  // 0x0098(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bVirtualParentFireDirectChildEnterEvents;          // 0x0099(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_9A[0x6];                                       // 0x009A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x00A0(0x0018)(Edit, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgTextArgument>               TextArguments;                                     // 0x00B8(0x0010)(Edit, EditFixedSize, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class FName                                   SpeakerState;                                      // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDlgNodeData*                           NodeData;                                          // 0x00D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundBase*                             VoiceSoundWave;                                    // 0x00D8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDialogueWave*                          VoiceDialogueWave;                                 // 0x00E0(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UObject*                                GenericData;                                       // 0x00E8(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_F0[0x20];                                      // 0x00F0(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsVirtualParent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode_Speech")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode_Speech")
	}
	static class UDlgNode_Speech* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Speech>();
	}
};
DUMPER7_ASSERTS_UDlgNode_Speech;

// Class DlgSystem.DlgNode_SpeechSequence
// 0x0028 (0x00C0 - 0x0098)
class UDlgNode_SpeechSequence final : public UDlgNode
{
public:
	TArray<struct FDlgSpeechSequenceEntry>        SpeechSequence;                                    // 0x0098(0x0010)(Edit, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgEdge>                       InnerEdges;                                        // 0x00A8(0x0010)(ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	const TArray<struct FDlgSpeechSequenceEntry> GetNodeSpeechSequence() const;
	bool HasSpeechSequences() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode_SpeechSequence")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode_SpeechSequence")
	}
	static class UDlgNode_SpeechSequence* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_SpeechSequence>();
	}
};
DUMPER7_ASSERTS_UDlgNode_SpeechSequence;

// Class DlgSystem.DlgNode_Start
// 0x0000 (0x0098 - 0x0098)
class UDlgNode_Start final : public UDlgNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgNode_Start")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgNode_Start")
	}
	static class UDlgNode_Start* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgNode_Start>();
	}
};
DUMPER7_ASSERTS_UDlgNode_Start;

// Class DlgSystem.DlgSystemSettings
// 0x0340 (0x0378 - 0x0038)
class UDlgSystemSettings final : public UDeveloperSettings
{
public:
	bool                                          bClearDialogueHistoryAutomatically;                // 0x0038(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRegisterDialogueConsoleCommandsAutomatically;     // 0x0039(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgNoSatisfiedChildBehavior                  NoSatisfiedChildBehavior;                          // 0x003A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgDialogueTextFormat                        DialogueTextFormat;                                // 0x003B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgTextInputKeyForNewLine                    DialogueTextInputKeyForNewLine;                    // 0x003C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSetDefaultParticipantClasses;                 // 0x003D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowNodeData;                                     // 0x003E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEdgeData;                                     // 0x003F(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgSpeakerStateVisibility                    DialogueSpeakerStateVisibility;                    // 0x0040(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgVoiceDisplayedFields                      DialogueDisplayedVoiceFields;                      // 0x0041(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowGenericData;                                  // 0x0042(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowAdvancedChildren;                             // 0x0043(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UClass*>                         BlacklistedReflectionClasses;                      // 0x0048(0x0010)(Edit, ZeroConstructor, Config, NativeAccessSpecifierPublic)
	TSubclassOf<class UDlgNodeData>               DefaultCustomNodeDataClass;                        // 0x0058(0x0008)(Edit, ZeroConstructor, Config, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgClassPickerDisplayMode                    ClassPickerDisplayMode;                            // 0x0060(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBatchOnlyInGameDialogues;                         // 0x0061(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FString>                           AdditionalTextFormatFileExtensionsToLookFor;       // 0x0068(0x0050)(Edit, Config, NativeAccessSpecifierPublic)
	bool                                          bSetDefaultEdgeTexts;                              // 0x00B8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSetDefaultEdgeTextOnFirstChildOnly;               // 0x00B9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_BA[0x6];                                       // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   DefaultTextEdgeToEndNode;                          // 0x00C0(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	class FText                                   DefaultTextEdgeToNormalNode;                       // 0x00D8(0x0018)(Edit, Config, NativeAccessSpecifierPublic)
	EDlgTextNamespaceLocalization                 DialogueTextNamespaceLocalization;                 // 0x00F0(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DialogueTextGlobalNamespaceName;                   // 0x00F8(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DialogueTextPrefixNamespaceName;                   // 0x0108(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<class FString>                           LocalizationIgnoredStrings;                        // 0x0118(0x0050)(Edit, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
	TMap<class FString, class FText>              LocalizationRemapSourceStringsToTexts;             // 0x0168(0x0050)(Edit, Config, AdvancedDisplay, NativeAccessSpecifierPublic)
	bool                                          bEnableMessageLog;                                 // 0x01B8(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMessageLogMirrorToOutputLog;                      // 0x01B9(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMessageLogOpen;                                   // 0x01BA(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableOutputLog;                                  // 0x01BB(0x0001)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENYLoggerLogLevel                             RedirectMessageLogLevelsHigherThan;                // 0x01BC(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ENYLoggerLogLevel                             OpenMessageLogLevelsHigherThan;                    // 0x01BD(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHideEmptyDialogueBrowserCategories;               // 0x01BE(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowExternalURLsToolbar;                          // 0x01BF(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C0[0x50];                                     // 0x01C0(0x0050)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DescriptionWrapTextAt;                             // 0x0210(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                DescriptionTextMargin;                             // 0x0214(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          TitleHorizontalAlignment;                          // 0x0224(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHasEnterConditionsIcon;                       // 0x0225(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHasEnterEventsIcon;                           // 0x0226(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHasVoiceIcon;                                 // 0x0227(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowHasGenericDataIcon;                           // 0x0228(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           SpeechNodeColor;                                   // 0x022C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RootNodeColor;                                     // 0x023C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           EndNodeColor;                                      // 0x024C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VirtualParentNodeColor;                            // 0x025C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SelectorFirstNodeColor;                            // 0x026C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SelectorRandomNodeColor;                           // 0x027C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SpeechSequenceNodeColor;                           // 0x028C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ProxyNodeColor;                                    // 0x029C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BorderBackgroundColor;                             // 0x02AC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BorderHoveredBackgroundColor;                      // 0x02BC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BorderBackgroundColorNoChildren;                   // 0x02CC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BorderHoveredBackgroundColorNoChildren;            // 0x02DC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           BorderBackgroundColorHighlighted;                  // 0x02EC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                                DescriptionSpeakerMargin;                          // 0x02FC(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          DescriptionSpeakerHorizontalAlignment;             // 0x030C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_30D[0x3];                                      // 0x030D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         WireThickness;                                     // 0x0310(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWireDrawBubbles;                                  // 0x0314(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowEdgeHasConditionsIcon;                        // 0x0315(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_316[0x2];                                      // 0x0316(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WireBaseColor;                                     // 0x0318(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowDifferentColorForConditionWires;              // 0x0328(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WireWithConditionsColor;                           // 0x032C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WireHoveredColor;                                  // 0x033C(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShowPrimarySecondaryEdges;                        // 0x034C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawPrimaryEdges;                                 // 0x034D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawSecondaryEdges;                               // 0x034E(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34F[0x1];                                      // 0x034F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           WirePrimaryEdgeColor;                              // 0x0350(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           WireSecondaryEdgeColor;                            // 0x0360(0x0010)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OffsetBetweenColumnsX;                             // 0x0370(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OffsetBetweenRowsY;                                // 0x0374(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgSystemSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgSystemSettings")
	}
	static class UDlgSystemSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDlgSystemSettings>();
	}
};
DUMPER7_ASSERTS_UDlgSystemSettings;

// Class DlgSystem.DlgTextArgumentCustom
// 0x0000 (0x0028 - 0x0028)
class UDlgTextArgumentCustom : public UDlgObject
{
public:
	class FText GetText(const class UDlgContext* Context, const class UObject* Participant, const class FString& DisplayStringParam);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DlgTextArgumentCustom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DlgTextArgumentCustom")
	}
	static class UDlgTextArgumentCustom* GetDefaultObj()
	{
