#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DSE_SetFractionMemberOpened

#include "Basic.hpp"

#include "Smuta_structs.hpp"
#include "Engine_structs.hpp"
#include "DlgSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass DSE_SetFractionMemberOpened.DSE_SetFractionMemberOpened_C
// 0x0018 (0x0040 - 0x0028)
class UDSE_SetFractionMemberOpened_C final : public UDlgEventCustom
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ESmutaDLCFraction                             Fraction;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   FractionMemberId;                                  // 0x0034(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNewOpened;                                        // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void EnterEvent(class UDlgContext* Context, class UObject* Participant);
	void ExecuteUbergraph_DSE_SetFractionMemberOpened(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("DSE_SetFractionMemberOpened_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DSE_SetFractionMemberOpened_C")
	}
	static class UDSE_SetFractionMemberOpened_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDSE_SetFractionMemberOpened_C>();
	}
};
DUMPER7_ASSERTS_UDSE_SetFractionMemberOpened_C;

}

