#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DSE_SetFractionMemberOpened

#include "Basic.hpp"


namespace SDK::Params
{

// Function DSE_SetFractionMemberOpened.DSE_SetFractionMemberOpened_C.EnterEvent
// 0x0010 (0x0010 - 0x0000)
struct DSE_SetFractionMemberOpened_C_EnterEvent final
{
public:
	class UDlgContext*                            Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Participant;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DSE_SetFractionMemberOpened_C_EnterEvent;

// Function DSE_SetFractionMemberOpened.DSE_SetFractionMemberOpened_C.ExecuteUbergraph_DSE_SetFractionMemberOpened
// 0x0020 (0x0020 - 0x0000)
struct DSE_SetFractionMemberOpened_C_ExecuteUbergraph_DSE_SetFractionMemberOpened final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgContext*                            K2Node_Event_Context;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Participant;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UFractionsSubsystem*                    CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DSE_SetFractionMemberOpened_C_ExecuteUbergraph_DSE_SetFractionMemberOpened;

}

