#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DSE_AddGlobalTag

#include "Basic.hpp"


namespace SDK::Params
{

// Function DSE_AddGlobalTag.DSE_AddGlobalTag_C.EnterEvent
// 0x0010 (0x0010 - 0x0000)
struct DSE_AddGlobalTag_C_EnterEvent final
{
public:
	class UDlgContext*                            Context;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Participant;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DSE_AddGlobalTag_C_EnterEvent;

// Function DSE_AddGlobalTag.DSE_AddGlobalTag_C.ExecuteUbergraph_DSE_AddGlobalTag
// 0x0020 (0x0020 - 0x0000)
struct DSE_AddGlobalTag_C_ExecuteUbergraph_DSE_AddGlobalTag final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgContext*                            K2Node_Event_Context;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                K2Node_Event_Participant;                          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuestManager*                          CallFunc_GetQuestManager_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_DSE_AddGlobalTag_C_ExecuteUbergraph_DSE_AddGlobalTag;

}

