#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DT_Animal_SoundSets

#include "Basic.hpp"

#include "Enum_AnimalActions_structs.hpp"


namespace SDK
{

// UserDefinedStruct DT_Animal_SoundSets.DT_Animal_SoundSets
// 0x0030 (0x0030 - 0x0000)
struct FDT_Animal_SoundSets final
{
public:
	Enum_AnimalActions                            AnimalAction_37_870B2A6A4A9B7717312ADE8065FE907E;  // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class USkeletalMesh>>   Skelet_38_F1D16B364FB6F8A8952055813C215D68;        // 0x0008(0x0010)(Edit, BlueprintVisible)
	class USoundBase*                             Sound_13_F83E2DF24651330F4DECD49C2583DD65;         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TriggerParameter_16_04DEE37F4715B07BCD87E787CA0FBA7C; // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_25_46E686C84BFB647D03F8089631890BA3;    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDT_Animal_SoundSets;

}

