#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DT_FootstepSoundsSets

#include "Basic.hpp"

#include "PhysicsCore_structs.hpp"
#include "Enum_SoundMovementTypes_structs.hpp"


namespace SDK
{

// UserDefinedStruct DT_FootstepSoundsSets.DT_FootstepSoundsSets
// 0x0088 (0x0088 - 0x0000)
struct FDT_FootstepSoundsSets final
{
public:
	bool                                          PlayerCharacter_1_5D07239741D24023D10B46AC21D4EE18; // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          LeftStep_3_95733CD14B15016E46C19A8BF3068B5A;       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class USkeleton*>                      Skelet_41_F1D16B364FB6F8A8952055813C215D68;        // 0x0008(0x0010)(Edit, BlueprintVisible)
	TSet<EPhysicalSurface>                        GroundMaterial_29_11F061104C5B7D43774CE8A9A6EE348D; // 0x0018(0x0050)(Edit, BlueprintVisible)
	class USoundBase*                             Sound_13_F83E2DF24651330F4DECD49C2583DD65;         // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   TriggerParameter_16_04DEE37F4715B07BCD87E787CA0FBA7C; // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName_25_46E686C84BFB647D03F8089631890BA3;    // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	Enum_SoundMovementTypes                       MovmentType_39_0618B8BB44A11838A6A29D859A748F6D;   // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FDT_FootstepSoundsSets;

}

