#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyMultiSave

#include "Basic.hpp"

#include "EasyMultiSave_structs.hpp"


namespace SDK::Params
{

// Function EasyMultiSave.EMSActorSaveInterface.ComponentsToSave
// 0x0010 (0x0010 - 0x0000)
struct EMSActorSaveInterface_ComponentsToSave final
{
public:
	TArray<class UActorComponent*>                Components;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSActorSaveInterface_ComponentsToSave;

// Function EasyMultiSave.EMSAsyncLoadGame.AsyncLoadActors
// 0x0018 (0x0018 - 0x0000)
struct EMSAsyncLoadGame_AsyncLoadActors final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Data;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFullReload;                                       // 0x000C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UEMSAsyncLoadGame*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSAsyncLoadGame_AsyncLoadActors;

// Function EasyMultiSave.EMSAsyncSaveGame.AsyncSaveActors
// 0x0018 (0x0018 - 0x0000)
struct EMSAsyncSaveGame_AsyncSaveActors final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Data;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UEMSAsyncSaveGame*                      ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSAsyncSaveGame_AsyncSaveActors;

// Function EasyMultiSave.EMSAsyncWait.AsyncWaitForOperation
// 0x0018 (0x0018 - 0x0000)
struct EMSAsyncWait_AsyncWaitForOperation final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAsyncCheckType                               CheckType;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEMSAsyncWait*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSAsyncWait_AsyncWaitForOperation;

// Function EasyMultiSave.EMSFunctionLibrary.ClearMultiLevelSave
// 0x0008 (0x0008 - 0x0000)
struct EMSFunctionLibrary_ClearMultiLevelSave final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_ClearMultiLevelSave;

// Function EasyMultiSave.EMSFunctionLibrary.DeleteAllSaveDataForSlot
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_DeleteAllSaveDataForSlot final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveGameName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_DeleteAllSaveDataForSlot;

// Function EasyMultiSave.EMSFunctionLibrary.DeleteCustomSave
// 0x0010 (0x0010 - 0x0000)
struct EMSFunctionLibrary_DeleteCustomSave final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEMSCustomSaveGame*                     SaveGame;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_DeleteCustomSave;

// Function EasyMultiSave.EMSFunctionLibrary.DeleteSaveUser
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_DeleteSaveUser final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_DeleteSaveUser;

// Function EasyMultiSave.EMSFunctionLibrary.DoesSaveSlotExist
// 0x0020 (0x0020 - 0x0000)
struct EMSFunctionLibrary_DoesSaveSlotExist final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveGameName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EMSFunctionLibrary_DoesSaveSlotExist;

// Function EasyMultiSave.EMSFunctionLibrary.ExportSaveThumbnail
// 0x0020 (0x0020 - 0x0000)
struct EMSFunctionLibrary_ExportSaveThumbnail final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 TextureRenderTarget;                               // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveGameName;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_ExportSaveThumbnail;

// Function EasyMultiSave.EMSFunctionLibrary.GetAllSaveUsers
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_GetAllSaveUsers final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_GetAllSaveUsers;

// Function EasyMultiSave.EMSFunctionLibrary.GetCustomSave
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_GetCustomSave final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UEMSCustomSaveGame>         SaveGameClass;                                     // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEMSCustomSaveGame*                     ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_GetCustomSave;

// Function EasyMultiSave.EMSFunctionLibrary.GetNamedSlotInfo
// 0x0020 (0x0020 - 0x0000)
struct EMSFunctionLibrary_GetNamedSlotInfo final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveGameName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEMSInfoSaveGame*                       ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_GetNamedSlotInfo;

// Function EasyMultiSave.EMSFunctionLibrary.GetSlotInfoSaveGame
// 0x0020 (0x0020 - 0x0000)
struct EMSFunctionLibrary_GetSlotInfoSaveGame final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveGameName;                                      // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEMSInfoSaveGame*                       ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_GetSlotInfoSaveGame;

// Function EasyMultiSave.EMSFunctionLibrary.GetSortedSaveSlots
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_GetSortedSaveSlots final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_GetSortedSaveSlots;

// Function EasyMultiSave.EMSFunctionLibrary.ImportSaveThumbnail
// 0x0020 (0x0020 - 0x0000)
struct EMSFunctionLibrary_ImportSaveThumbnail final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveGameName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_ImportSaveThumbnail;

// Function EasyMultiSave.EMSFunctionLibrary.IsSavingOrLoading
// 0x0010 (0x0010 - 0x0000)
struct EMSFunctionLibrary_IsSavingOrLoading final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EMSFunctionLibrary_IsSavingOrLoading;

// Function EasyMultiSave.EMSFunctionLibrary.SaveCustom
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_SaveCustom final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEMSCustomSaveGame*                     SaveGame;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EMSFunctionLibrary_SaveCustom;

// Function EasyMultiSave.EMSFunctionLibrary.SetActorSaveProperties
// 0x0010 (0x0010 - 0x0000)
struct EMSFunctionLibrary_SetActorSaveProperties final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipSave;                                         // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistent;                                       // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipTransform;                                    // 0x000A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EMSFunctionLibrary_SetActorSaveProperties;

// Function EasyMultiSave.EMSFunctionLibrary.SetCurrentSaveGameName
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_SetCurrentSaveGameName final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SaveGameName;                                      // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_SetCurrentSaveGameName;

// Function EasyMultiSave.EMSFunctionLibrary.SetCurrentSaveUserName
// 0x0018 (0x0018 - 0x0000)
struct EMSFunctionLibrary_SetCurrentSaveUserName final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EMSFunctionLibrary_SetCurrentSaveUserName;

}

