#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EasyMultiSave

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "EasyMultiSave_structs.hpp"


namespace SDK
{

// Class EasyMultiSave.EMSActorSaveInterface
// 0x0000 (0x0000 - 0x0000)
class IEMSActorSaveInterface final
{
public:
	void ActorLoaded();
	void ActorPreSave();
	void ActorSaved();
	void ComponentsToSave(TArray<class UActorComponent*>* Components);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSActorSaveInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSActorSaveInterface")
	}
	static class IEMSActorSaveInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEMSActorSaveInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IEMSActorSaveInterface;

// Class EasyMultiSave.EMSAsyncLoadGame
// 0x0068 (0x0098 - 0x0030)
class UEMSAsyncLoadGame final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnFailed;                                          // 0x0040(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_50[0x48];                                      // 0x0050(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UEMSAsyncLoadGame* AsyncLoadActors(class UObject* WorldContextObject, int32 Data, bool bFullReload);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSAsyncLoadGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSAsyncLoadGame")
	}
	static class UEMSAsyncLoadGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSAsyncLoadGame>();
	}
};
DUMPER7_ASSERTS_UEMSAsyncLoadGame;

// Class EasyMultiSave.EMSAsyncSaveGame
// 0x0030 (0x0060 - 0x0030)
class UEMSAsyncSaveGame final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x20];                                      // 0x0040(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UEMSAsyncSaveGame* AsyncSaveActors(class UObject* WorldContextObject, int32 Data);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSAsyncSaveGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSAsyncSaveGame")
	}
	static class UEMSAsyncSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSAsyncSaveGame>();
	}
};
DUMPER7_ASSERTS_UEMSAsyncSaveGame;

// Class EasyMultiSave.EMSAsyncWait
// 0x0030 (0x0060 - 0x0030)
class UEMSAsyncWait final : public UBlueprintAsyncActionBase
{
public:
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnCompleted;                                       // 0x0038(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UEMSAsyncWait* AsyncWaitForOperation(class UObject* WorldContextObject, EAsyncCheckType CheckType);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSAsyncWait")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSAsyncWait")
	}
	static class UEMSAsyncWait* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSAsyncWait>();
	}
};
DUMPER7_ASSERTS_UEMSAsyncWait;

// Class EasyMultiSave.EMSCompSaveInterface
// 0x0000 (0x0000 - 0x0000)
class IEMSCompSaveInterface final
{
public:
	void ComponentLoaded();
	void ComponentPreSave();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSCompSaveInterface")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSCompSaveInterface")
	}
	static class IEMSCompSaveInterface* GetDefaultObj()
	{
		return GetDefaultObjImpl<IEMSCompSaveInterface>();
	}

	class UObject* AsUObject()
	{
		return reinterpret_cast<UObject*>(this);
	}
	const class UObject* AsUObject() const
	{
		return reinterpret_cast<const UObject*>(this);
	}
};
DUMPER7_ASSERTS_IEMSCompSaveInterface;

// Class EasyMultiSave.EMSCustomSaveGame
// 0x0018 (0x0040 - 0x0028)
class UEMSCustomSaveGame : public USaveGame
{
public:
	class FString                                 SaveGameName;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseSaveSlot;                                      // 0x0038(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSCustomSaveGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSCustomSaveGame")
	}
	static class UEMSCustomSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSCustomSaveGame>();
	}
};
DUMPER7_ASSERTS_UEMSCustomSaveGame;

// Class EasyMultiSave.EMSFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UEMSFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void ClearMultiLevelSave(class UObject* WorldContextObject);
	static void DeleteAllSaveDataForSlot(class UObject* WorldContextObject, const class FString& SaveGameName);
	static void DeleteCustomSave(class UObject* WorldContextObject, class UEMSCustomSaveGame* SaveGame);
	static void DeleteSaveUser(class UObject* WorldContextObject, const class FString& UserName);
	static bool DoesSaveSlotExist(class UObject* WorldContextObject, const class FString& SaveGameName);
	static void ExportSaveThumbnail(class UObject* WorldContextObject, class UTextureRenderTarget2D* TextureRenderTarget, const class FString& SaveGameName);
	static TArray<class FString> GetAllSaveUsers(class UObject* WorldContextObject);
	static class UEMSCustomSaveGame* GetCustomSave(class UObject* WorldContextObject, TSubclassOf<class UEMSCustomSaveGame> SaveGameClass);
	static class UEMSInfoSaveGame* GetNamedSlotInfo(class UObject* WorldContextObject, const class FString& SaveGameName);
	static class UEMSInfoSaveGame* GetSlotInfoSaveGame(class UObject* WorldContextObject, class FString* SaveGameName);
	static TArray<class FString> GetSortedSaveSlots(class UObject* WorldContextObject);
	static class UTexture2D* ImportSaveThumbnail(class UObject* WorldContextObject, const class FString& SaveGameName);
	static bool IsSavingOrLoading(class UObject* WorldContextObject);
	static bool SaveCustom(class UObject* WorldContextObject, class UEMSCustomSaveGame* SaveGame);
	static void SetActorSaveProperties(class UObject* WorldContextObject, bool bSkipSave, bool bPersistent, bool bSkipTransform);
	static void SetCurrentSaveGameName(class UObject* WorldContextObject, const class FString& SaveGameName);
	static void SetCurrentSaveUserName(class UObject* WorldContextObject, const class FString& UserName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSFunctionLibrary")
	}
	static class UEMSFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UEMSFunctionLibrary;

// Class EasyMultiSave.EMSInfoSaveGame
// 0x0030 (0x0058 - 0x0028)
class UEMSInfoSaveGame : public USaveGame
{
public:
	struct FSaveSlotInfo                          SlotInfo;                                          // 0x0028(0x0030)(BlueprintVisible, BlueprintReadOnly, SaveGame, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSInfoSaveGame")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSInfoSaveGame")
	}
	static class UEMSInfoSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSInfoSaveGame>();
	}
};
DUMPER7_ASSERTS_UEMSInfoSaveGame;

// Class EasyMultiSave.EMSObject
// 0x02F0 (0x0320 - 0x0030)
class UEMSObject : public UGameInstanceSubsystem
{
public:
	uint8                                         Pad_30[0x30];                                      // 0x0030(0x0030)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CurrentSaveGameName;                               // 0x0060(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrentSaveUserName;                               // 0x0070(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEMSInfoSaveGame*                       CachedSlotInfoSave;                                // 0x0080(0x0008)(ZeroConstructor, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class UEMSCustomSaveGame*> CachedCustomSaves;                                // 0x0088(0x0050)(Transient, NativeAccessSpecifierPublic)
	TArray<class AActor*>                         ActorList;                                         // 0x00D8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FLevelArchive>                  LevelArchiveList;                                  // 0x00E8(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	struct FMultiLevelStreamingData               MultiLevelStreamData;                              // 0x00F8(0x0020)(Transient, NativeAccessSpecifierPublic)
	struct FPlayerStackArchive                    PlayerStackData;                                   // 0x0118(0x0100)(Transient, NativeAccessSpecifierPublic)
	TArray<struct FActorSaveData>                 SavedActors;                                       // 0x0218(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<struct FLevelScriptSaveData>           SavedScripts;                                      // 0x0228(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	struct FGameObjectSaveData                    SavedGameMode;                                     // 0x0238(0x0020)(Transient, NativeAccessSpecifierPublic)
	struct FGameObjectSaveData                    SavedGameState;                                    // 0x0258(0x0020)(Transient, NativeAccessSpecifierPublic)
	struct FControllerSaveData                    SavedController;                                   // 0x0278(0x0038)(Transient, NativeAccessSpecifierPublic)
	struct FPawnSaveData                          SavedPawn;                                         // 0x02B0(0x0050)(Transient, NativeAccessSpecifierPublic)
	struct FGameObjectSaveData                    SavedPlayerState;                                  // 0x0300(0x0020)(Transient, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSObject")
	}
	static class UEMSObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSObject>();
	}
};
DUMPER7_ASSERTS_UEMSObject;

// Class EasyMultiSave.EMSPluginSettings
// 0x0048 (0x0070 - 0x0028)
class UEMSPluginSettings final : public UObject
{
public:
	class FString                                 DefaultSaveGameName;                               // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftClassPath                         SlotInfoSaveGameClass;                             // 0x0038(0x0020)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFileSaveMethod                               FileSaveMethod;                                    // 0x0058(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAdvancedSpawnCheck;                               // 0x0059(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSimpleActorNames;                                 // 0x005A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoSaveStructs;                                  // 0x005B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMultiThreadSaving;                                // 0x005C(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELoadMethod                                   LoadMethod;                                        // 0x005D(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5E[0x2];                                       // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         DeferredLoadStackSize;                             // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AsyncWaitDelay;                                    // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECompressionMethod                            CompressionMethod;                                 // 0x0068(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMultiLevelSaveMethod                         MultiLevelSaving;                                  // 0x0069(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistentPlayer;                                 // 0x006A(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPersistentGameMode;                               // 0x006B(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EMSPluginSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EMSPluginSettings")
	}
	static class UEMSPluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEMSPluginSettings>();
	}
};
DUMPER7_ASSERTS_UEMSPluginSettings;

}

