#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: EnchancedSpline

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// Enum EnchancedSpline.ESmartMontageSection
// NumValues: 0x0005
enum class ESmartMontageSection : uint8
{
	Default                                  = 0,
	Loop                                     = 1,
	TalkLoop                                 = 2,
	End                                      = 3,
	ESmartMontageSection_MAX                 = 4,
};

// Enum EnchancedSpline.EBehaviorRole
// NumValues: 0x0008
enum class EBehaviorRole : uint8
{
	Roamer                                   = 0,
	Soldier                                  = 1,
	Smith                                    = 2,
	Farmer                                   = 3,
	Beggar                                   = 4,
	Merchant                                 = 5,
	Worker                                   = 6,
	EBehaviorRole_MAX                        = 7,
};

// Enum EnchancedSpline.ESplineMovementMode
// NumValues: 0x0005
enum class ESplineMovementMode : uint8
{
	None                                     = 0,
	Walk                                     = 1,
	Run                                      = 2,
	Sprint                                   = 3,
	ESplineMovementMode_MAX                  = 4,
};

// Enum EnchancedSpline.SmartObjectInteractionType
// NumValues: 0x0006
enum class ESmartObjectInteractionType : uint8
{
	SplinePoint                              = 0,
	Linked                                   = 1,
	Initial                                  = 2,
	PreSelected                              = 3,
	Random                                   = 4,
	SmartObjectInteractionType_MAX           = 5,
};

// Enum EnchancedSpline.EItemLifeTimeMode
// NumValues: 0x0004
enum class EItemLifeTimeMode : uint8
{
	ThisObject                               = 0,
	NextObject                               = 1,
	Persistent                               = 2,
	EItemLifeTimeMode_MAX                    = 3,
};

// ScriptStruct EnchancedSpline.BehaviorSettings
// 0x0040 (0x0040 - 0x0000)
struct FBehaviorSettings final
{
public:
	TArray<struct FGameplayTagContainer>          ActionSequence;                                    // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AdditionalActivities;                              // 0x0010(0x0020)(Edit, NativeAccessSpecifierPublic)
	EBehaviorRole                                 Role;                                              // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SmartObjectSearchRadius;                           // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DialogPriority;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FBehaviorSettings;

// ScriptStruct EnchancedSpline.SmartObjectInteractionSettingsWrapper
// 0x0018 (0x0018 - 0x0000)
struct FSmartObjectInteractionSettingsWrapper final
{
public:
	class UDA_SmartObjectInteractionSettings*     Settings;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDA_SmartObjectInteractionSettings*     InstancedSettings;                                 // 0x0008(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSettings;                                 // 0x0010(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSmartObjectInteractionSettingsWrapper;

// ScriptStruct EnchancedSpline.EnchancedSplinePointParams
// 0x0030 (0x0030 - 0x0000)
struct FEnchancedSplinePointParams final
{
public:
	float                                         StopTime;                                          // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseTargetRotation;                                // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               TargetRotation;                                    // 0x0008(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bOverrideMovementMode;                             // 0x0020(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESplineMovementMode                           MovementMode;                                      // 0x0021(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUsePointOnce;                                     // 0x0022(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_23[0x5];                                       // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_ActionsSettings*                    Actions;                                           // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FEnchancedSplinePointParams;

// ScriptStruct EnchancedSpline.InteractItemContext
// 0x0020 (0x0020 - 0x0000)
struct FInteractItemContext final
{
public:
	class ASharedInteractItem*                    ItemPtr;                                           // 0x0000(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ABaseSmartObject*                       InstigatorSmartObject;                             // 0x0008(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SocketName;                                        // 0x0010(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EItemLifeTimeMode                             LifeTimeMode;                                      // 0x0018(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActive;                                           // 0x0019(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FInteractItemContext;

// ScriptStruct EnchancedSpline.NPCSmartObjectVars
// 0x0088 (0x0088 - 0x0000)
struct FNPCSmartObjectVars final
{
public:
	struct FBehaviorSettings                      BehaviorSettings;                                  // 0x0000(0x0040)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class ASplineActor>            Spline;                                            // 0x0040(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDA_SmartObjectInteractionSettings*     SplineSmartSettings;                               // 0x0068(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           ComponentTags;                                     // 0x0070(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          bStartSplineOnBeginPlay;                           // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNPCSmartObjectVars;

}

