#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEnemyWaveUnit

#include "Basic.hpp"

#include "EWaveUnitType_structs.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// UserDefinedStruct FEnemyWaveUnit.FEnemyWaveUnit
// 0x0090 (0x0090 - 0x0000)
struct FFEnemyWaveUnit final
{
public:
	EWaveUnitType                                 UnitType_15_2BF9F99F400486E1B3475CBE4EE8B0C5;      // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFraction                                     Fraction_2_530C7BA840DA66DA19093C8D8B7CE835;       // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UDA_AITraits_C>          AITraits_9_AE61FE6143B75CD9986EE48E773EF912;       // 0x0008(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 BattleData_8_23C4DD1B49EF70511AFD2A85452411FF;     // 0x0030(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
	int32                                         Amount_12_716FCCD844EBA9422B4181894815AB7F;        // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class ABP_WaveUnitSpawnPoint_C>> SpawnPoints_19_D343B2AD458D086E1F2A0C9D7A352392; // 0x0060(0x0010)(Edit, BlueprintVisible, SaveGame)
	struct FNPCAppearanceWrapper                  NPCAppearance_24_BEC8E913493CA2E673B3B6AC4F378A05; // 0x0070(0x0018)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference)
	class UPassportAsset*                         Passport_27_FD765DFD4A0BC67F7A556A87511937F2;      // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFEnemyWaveUnit;

}

