#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FEnemyWave

#include "Basic.hpp"

#include "FEnemyWaveUnit_structs.hpp"
#include "EWaveSpawnConditionLogic_structs.hpp"


namespace SDK
{

// UserDefinedStruct FEnemyWave.FEnemyWave
// 0x0020 (0x0020 - 0x0000)
struct FFEnemyWave final
{
public:
	TArray<struct FFEnemyWaveUnit>                WaveUnits_5_530C7BA840DA66DA19093C8D8B7CE835;      // 0x0000(0x0010)(Edit, BlueprintVisible, SaveGame, ContainsInstancedReference)
	EWaveSpawnConditionLogic                      ConditionsCombinations_18_3BCA4B434DF1E17E02DC7F90B6F04F12; // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         KillsToNextWave_9_F759E7E54691CAFFA95DB0B812D62D17; // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TimeToNextWave_12_2B6FD1D44DAD4DC4C92E80AC0B359B53; // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFEnemyWave;

}

