#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlexibleQuestsRuntime

#include "Basic.hpp"


namespace SDK
{

// Enum FlexibleQuestsRuntime.EQuestMarkerState
// NumValues: 0x0008
enum class EQuestMarkerState : uint8
{
	MainFinish                               = 0,
	MainIntermediate                         = 1,
	MainStart                                = 2,
	SideFinish                               = 3,
	SideIntermediate                         = 4,
	SideStart                                = 5,
	None                                     = 255,
	EQuestMarkerState_MAX                    = 256,
};

// Enum FlexibleQuestsRuntime.EQuestResult
// NumValues: 0x0004
enum class EQuestResult : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	Restart                                  = 2,
	EQuestResult_MAX                         = 3,
};

// Enum FlexibleQuestsRuntime.EQuestStatus
// NumValues: 0x0005
enum class EQuestStatus : uint8
{
	Succeeded                                = 0,
	Failed                                   = 1,
	NotStarted                               = 2,
	Active                                   = 3,
	EQuestStatus_MAX                         = 4,
};

// Enum FlexibleQuestsRuntime.EConditionsRequirementMode
// NumValues: 0x0003
enum class EConditionsRequirementMode : uint8
{
	AnyConditionMet                          = 0,
	AllConditionsMet                         = 1,
	EConditionsRequirementMode_MAX           = 2,
};

// ScriptStruct FlexibleQuestsRuntime.ObjectSaveData
// 0x0028 (0x0028 - 0x0000)
struct FObjectSaveData final
{
public:
	class UClass*                                 Class;                                             // 0x0000(0x0008)(ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0008(0x0008)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 SerializedData;                                    // 0x0010(0x0010)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	uint8                                         Flags;                                             // 0x0020(0x0001)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FObjectSaveData;

}

