#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FlexibleQuestsRuntime

#include "Basic.hpp"

#include "FlexibleQuestsRuntime_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function FlexibleQuestsRuntime.BaseQuest.Print
// 0x0002 (0x0002 - 0x0000)
struct BaseQuest_Print final
{
public:
	bool                                          ToConsole;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ToScreen;                                          // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_Print;

// Function FlexibleQuestsRuntime.BaseQuest.SetIsRuntimeChangeable
// 0x0001 (0x0001 - 0x0000)
struct BaseQuest_SetIsRuntimeChangeable final
{
public:
	bool                                          bNewChangeable;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_SetIsRuntimeChangeable;

// Function FlexibleQuestsRuntime.BaseQuest.GetAllSteps
// 0x0010 (0x0010 - 0x0000)
struct BaseQuest_GetAllSteps final
{
public:
	TArray<class UQuestStep*>                     AllSteps;                                          // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_GetAllSteps;

// Function FlexibleQuestsRuntime.BaseQuest.GetAssetQuestStep
// 0x0010 (0x0010 - 0x0000)
struct BaseQuest_GetAssetQuestStep final
{
public:
	class FName                                   QuestStepID;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestStep*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_GetAssetQuestStep;

// Function FlexibleQuestsRuntime.BaseQuest.GetDebugString
// 0x0010 (0x0010 - 0x0000)
struct BaseQuest_GetDebugString final
{
public:
	class FString                                 DebugString;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_GetDebugString;

// Function FlexibleQuestsRuntime.BaseQuest.GetIsRuntimeChangeable
// 0x0001 (0x0001 - 0x0000)
struct BaseQuest_GetIsRuntimeChangeable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_GetIsRuntimeChangeable;

// Function FlexibleQuestsRuntime.BaseQuest.GetRootSteps
// 0x0010 (0x0010 - 0x0000)
struct BaseQuest_GetRootSteps final
{
public:
	TArray<class UQuestStep*>                     RootSteps;                                         // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_GetRootSteps;

// Function FlexibleQuestsRuntime.BaseQuest.IsEqual
// 0x0010 (0x0010 - 0x0000)
struct BaseQuest_IsEqual final
{
public:
	const class UBaseQuest*                       Other;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_BaseQuest_IsEqual;

// Function FlexibleQuestsRuntime.BaseQuest.IsMainQuest
// 0x0001 (0x0001 - 0x0000)
struct BaseQuest_IsMainQuest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_IsMainQuest;

// Function FlexibleQuestsRuntime.BaseQuest.IsTechQuest
// 0x0001 (0x0001 - 0x0000)
struct BaseQuest_IsTechQuest final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseQuest_IsTechQuest;

// Function FlexibleQuestsRuntime.QuestStep.GetEdge
// 0x0010 (0x0010 - 0x0000)
struct QuestStep_GetEdge final
{
public:
	class UQuestStep*                             ChildNode;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestStepTransition*                   ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_GetEdge;

// Function FlexibleQuestsRuntime.QuestStep.OnTransitionReady
// 0x0008 (0x0008 - 0x0000)
struct QuestStep_OnTransitionReady final
{
public:
	class UQuestStepTransition*                   Transition;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_OnTransitionReady;

// Function FlexibleQuestsRuntime.QuestStep.GetDebugString
// 0x0010 (0x0010 - 0x0000)
struct QuestStep_GetDebugString final
{
public:
	class FString                                 DebugString;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_GetDebugString;

// Function FlexibleQuestsRuntime.QuestStep.GetDescription
// 0x0018 (0x0018 - 0x0000)
struct QuestStep_GetDescription final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_GetDescription;

// Function FlexibleQuestsRuntime.QuestStep.GetQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestStep_GetQuest final
{
public:
	class UGenericQuest*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_GetQuest;

// Function FlexibleQuestsRuntime.QuestStep.GetQuestState
// 0x0008 (0x0008 - 0x0000)
struct QuestStep_GetQuestState final
{
public:
	class UQuestState*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_GetQuestState;

// Function FlexibleQuestsRuntime.QuestStep.GetUniqueVisibleStepName
// 0x0018 (0x0018 - 0x0000)
struct QuestStep_GetUniqueVisibleStepName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_GetUniqueVisibleStepName;

// Function FlexibleQuestsRuntime.QuestStep.IsLeafNode
// 0x0001 (0x0001 - 0x0000)
struct QuestStep_IsLeafNode final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_IsLeafNode;

// Function FlexibleQuestsRuntime.QuestStep.IsStepActive
// 0x0001 (0x0001 - 0x0000)
struct QuestStep_IsStepActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStep_IsStepActive;

// Function FlexibleQuestsRuntime.MarkerManager.MarkerUpdateResponse
// 0x0010 (0x0010 - 0x0000)
struct MarkerManager_MarkerUpdateResponse final
{
public:
	class UQuestMarker*                           marker;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuestMarkerState                             NewState;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MarkerManager_MarkerUpdateResponse;

// Function FlexibleQuestsRuntime.QuestManager.AddGlobalTag
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_AddGlobalTag final
{
public:
	struct FGameplayTag                           TagToAdd;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_AddGlobalTag;

// Function FlexibleQuestsRuntime.QuestManager.BindOnQuestEvent
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_BindOnQuestEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayTag& Tag, const class UObject* EventCauser)> Event;         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_BindOnQuestEvent;

// Function FlexibleQuestsRuntime.QuestManager.CallQuestEvent
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_CallQuestEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          EventCauser;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_CallQuestEvent;

// Function FlexibleQuestsRuntime.QuestManager.FinishQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_FinishQuest final
{
public:
	const class UGenericQuest*                    Quest;                                             // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuestResult                                  WithResult;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestManager_FinishQuest;

// Function FlexibleQuestsRuntime.QuestManager.FinishQuestByName
// 0x0020 (0x0020 - 0x0000)
struct QuestManager_FinishQuestByName final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	EQuestResult                                  WithResult;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestManager_FinishQuestByName;

// Function FlexibleQuestsRuntime.QuestManager.QuestFinishedResponse
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_QuestFinishedResponse final
{
public:
	class UQuestState*                            FinishedQuest;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EQuestResult                                  Result;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestManager_QuestFinishedResponse;

// Function FlexibleQuestsRuntime.QuestManager.RemoveGlobalTag
// 0x000C (0x000C - 0x0000)
struct QuestManager_RemoveGlobalTag final
{
public:
	struct FGameplayTag                           TagToRemove;                                       // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDeferParentTags;                                  // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestManager_RemoveGlobalTag;

// Function FlexibleQuestsRuntime.QuestManager.StartQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_StartQuest final
{
public:
	const class UGenericQuest*                    QuestToStart;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestManager_StartQuest;

// Function FlexibleQuestsRuntime.QuestManager.TrackQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_TrackQuest final
{
public:
	const class UGenericQuest*                    QuestToTrack;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_TrackQuest;

// Function FlexibleQuestsRuntime.QuestManager.UnbindOnQuestEvent
// 0x0018 (0x0018 - 0x0000)
struct QuestManager_UnbindOnQuestEvent final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(const struct FGameplayTag& Tag, const class UObject* EventCauser)> Event;         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_UnbindOnQuestEvent;

// Function FlexibleQuestsRuntime.QuestManager.UntrackQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestManager_UntrackQuest final
{
public:
	const class UBaseQuest*                       QuestToUntrack;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_UntrackQuest;

// Function FlexibleQuestsRuntime.QuestManager.GetActiveQuestState
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetActiveQuestState final
{
public:
	const class UGenericQuest*                    InQuestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestState*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_GetActiveQuestState;

// Function FlexibleQuestsRuntime.QuestManager.GetGlobalTags
// 0x0020 (0x0020 - 0x0000)
struct QuestManager_GetGlobalTags final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_GetGlobalTags;

// Function FlexibleQuestsRuntime.QuestManager.GetQuestState
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetQuestState final
{
public:
	const class UGenericQuest*                    InQuestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestState*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_GetQuestState;

// Function FlexibleQuestsRuntime.QuestManager.GetTrackingQuestInstance
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_GetTrackingQuestInstance final
{
public:
	const class UBaseQuest*                       InQuestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestState*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestManager_GetTrackingQuestInstance;

// Function FlexibleQuestsRuntime.QuestManager.IsQuestActive
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_IsQuestActive final
{
public:
	const class UGenericQuest*                    InQuest;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestManager_IsQuestActive;

// Function FlexibleQuestsRuntime.QuestManager.IsQuestTracking
// 0x0010 (0x0010 - 0x0000)
struct QuestManager_IsQuestTracking final
{
public:
	const class UGenericQuest*                    InQuest;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestManager_IsQuestTracking;

// Function FlexibleQuestsRuntime.QuestMarker.AddStatusFromObject
// 0x0010 (0x0010 - 0x0000)
struct QuestMarker_AddStatusFromObject final
{
public:
	EQuestMarkerState                             State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestMarker_AddStatusFromObject;

// Function FlexibleQuestsRuntime.QuestMarker.RemoveStatusFromObject
// 0x0010 (0x0010 - 0x0000)
struct QuestMarker_RemoveStatusFromObject final
{
public:
	EQuestMarkerState                             State;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                Object;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestMarker_RemoveStatusFromObject;

// Function FlexibleQuestsRuntime.QuestMarker.GetCurrentState
// 0x0001 (0x0001 - 0x0000)
struct QuestMarker_GetCurrentState final
{
public:
	EQuestMarkerState                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestMarker_GetCurrentState;

// Function FlexibleQuestsRuntime.QuestMarker.GetPendingQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestMarker_GetPendingQuest final
{
public:
	class UGenericQuest*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestMarker_GetPendingQuest;

// Function FlexibleQuestsRuntime.QuestMarker.GetPendingQuestState
// 0x0008 (0x0008 - 0x0000)
struct QuestMarker_GetPendingQuestState final
{
public:
	class UQuestState*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestMarker_GetPendingQuestState;

// Function FlexibleQuestsRuntime.QuestStepAction.OnLoaded_K2
// 0x0008 (0x0008 - 0x0000)
struct QuestStepAction_OnLoaded_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepAction_OnLoaded_K2;

// Function FlexibleQuestsRuntime.QuestStepAction.RunAction_K2
// 0x0008 (0x0008 - 0x0000)
struct QuestStepAction_RunAction_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepAction_RunAction_K2;

// Function FlexibleQuestsRuntime.QuestStepCondition.ChangeStatus
// 0x0001 (0x0001 - 0x0000)
struct QuestStepCondition_ChangeStatus final
{
public:
	bool                                          bNewStatus;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_ChangeStatus;

// Function FlexibleQuestsRuntime.QuestStepCondition.GetConditionText
// 0x0018 (0x0018 - 0x0000)
struct QuestStepCondition_GetConditionText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_GetConditionText;

// Function FlexibleQuestsRuntime.QuestStepCondition.GetDebugString
// 0x0010 (0x0010 - 0x0000)
struct QuestStepCondition_GetDebugString final
{
public:
	class FString                                 DebugString;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_GetDebugString;

// Function FlexibleQuestsRuntime.QuestStepCondition.GetQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestStepCondition_GetQuest final
{
public:
	class UGenericQuest*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_GetQuest;

// Function FlexibleQuestsRuntime.QuestStepCondition.GetQuestMarkerType
// 0x0001 (0x0001 - 0x0000)
struct QuestStepCondition_GetQuestMarkerType final
{
public:
	EQuestMarkerState                             ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_GetQuestMarkerType;

// Function FlexibleQuestsRuntime.QuestStepCondition.GetQuestState
// 0x0008 (0x0008 - 0x0000)
struct QuestStepCondition_GetQuestState final
{
public:
	class UQuestState*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_GetQuestState;

// Function FlexibleQuestsRuntime.QuestStepCondition.GetTargetActors
// 0x0010 (0x0010 - 0x0000)
struct QuestStepCondition_GetTargetActors final
{
public:
	TArray<class AActor*>                         Targets;                                           // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_GetTargetActors;

// Function FlexibleQuestsRuntime.QuestStepCondition.GetTransition
// 0x0008 (0x0008 - 0x0000)
struct QuestStepCondition_GetTransition final
{
public:
	class UQuestStepTransition*                   ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_GetTransition;

// Function FlexibleQuestsRuntime.QuestStepCondition.IsConditionMet
// 0x0001 (0x0001 - 0x0000)
struct QuestStepCondition_IsConditionMet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepCondition_IsConditionMet;

// Function FlexibleQuestsRuntime.QuestStepTransition.OnConditionUpdated
// 0x0010 (0x0010 - 0x0000)
struct QuestStepTransition_OnConditionUpdated final
{
public:
	class UQuestStepCondition*                    ChangedCondition;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewStatus;                                        // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_QuestStepTransition_OnConditionUpdated;

// Function FlexibleQuestsRuntime.QuestStepTransition.GetDebugString
// 0x0010 (0x0010 - 0x0000)
struct QuestStepTransition_GetDebugString final
{
public:
	class FString                                 DebugString;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepTransition_GetDebugString;

// Function FlexibleQuestsRuntime.QuestStepTransition.GetOwningQuestStep
// 0x0008 (0x0008 - 0x0000)
struct QuestStepTransition_GetOwningQuestStep final
{
public:
	class UQuestStep*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepTransition_GetOwningQuestStep;

// Function FlexibleQuestsRuntime.QuestStepTransition.GetQuest
// 0x0008 (0x0008 - 0x0000)
struct QuestStepTransition_GetQuest final
{
public:
	class UGenericQuest*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepTransition_GetQuest;

// Function FlexibleQuestsRuntime.QuestStepTransition.GetQuestState
// 0x0008 (0x0008 - 0x0000)
struct QuestStepTransition_GetQuestState final
{
public:
	class UQuestState*                            ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepTransition_GetQuestState;

// Function FlexibleQuestsRuntime.QuestStepTransition.IsActive
// 0x0001 (0x0001 - 0x0000)
struct QuestStepTransition_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestStepTransition_IsActive;

// Function FlexibleQuestsRuntime.QuestSubsystem.ClearQuests
// 0x0008 (0x0008 - 0x0000)
struct QuestSubsystem_ClearQuests final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSubsystem_ClearQuests;

// Function FlexibleQuestsRuntime.QuestSubsystem.GetQuestManager
// 0x0010 (0x0010 - 0x0000)
struct QuestSubsystem_GetQuestManager final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestManager*                          ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSubsystem_GetQuestManager;

// Function FlexibleQuestsRuntime.QuestSubsystem.TrackQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestSubsystem_TrackQuest final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UGenericQuest*                    QuestToTrack;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSubsystem_TrackQuest;

// Function FlexibleQuestsRuntime.QuestSubsystem.UntrackQuest
// 0x0010 (0x0010 - 0x0000)
struct QuestSubsystem_UntrackQuest final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UBaseQuest*                       QuestToUntrack;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestSubsystem_UntrackQuest;

// Function FlexibleQuestsRuntime.GenericQuest.GetNodesByLevel
// 0x0018 (0x0018 - 0x0000)
struct GenericQuest_GetNodesByLevel final
{
public:
	int32                                         Level;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UQuestStep*>                     Nodes;                                             // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GenericQuest_GetNodesByLevel;

// Function FlexibleQuestsRuntime.GenericQuest.GetLevelNum
// 0x0004 (0x0004 - 0x0000)
struct GenericQuest_GetLevelNum final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GenericQuest_GetLevelNum;

// Function FlexibleQuestsRuntime.GenericQuest.GetQuestStepLevel
// 0x0010 (0x0010 - 0x0000)
struct GenericQuest_GetQuestStepLevel final
{
public:
	const class UQuestStep*                       QuestStep;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GenericQuest_GetQuestStepLevel;

// Function FlexibleQuestsRuntime.QuestState.MoveToStep
// 0x0008 (0x0008 - 0x0000)
struct QuestState_MoveToStep final
{
public:
	class UQuestStep*                             InStepToMove;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_MoveToStep;

// Function FlexibleQuestsRuntime.QuestState.SetIsTracking
// 0x0001 (0x0001 - 0x0000)
struct QuestState_SetIsTracking final
{
public:
	bool                                          bNewIsTracking;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_SetIsTracking;

// Function FlexibleQuestsRuntime.QuestState.GetActivatedQuestStep
// 0x0010 (0x0010 - 0x0000)
struct QuestState_GetActivatedQuestStep final
{
public:
	class FName                                   QuestStepID;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestStep*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetActivatedQuestStep;

// Function FlexibleQuestsRuntime.QuestState.GetCurrentStep
// 0x0008 (0x0008 - 0x0000)
struct QuestState_GetCurrentStep final
{
public:
	class UQuestStep*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetCurrentStep;

// Function FlexibleQuestsRuntime.QuestState.GetCurrentStepNotHidden
// 0x0008 (0x0008 - 0x0000)
struct QuestState_GetCurrentStepNotHidden final
{
public:
	class UQuestStep*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetCurrentStepNotHidden;

// Function FlexibleQuestsRuntime.QuestState.GetIsTracking
// 0x0001 (0x0001 - 0x0000)
struct QuestState_GetIsTracking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetIsTracking;

// Function FlexibleQuestsRuntime.QuestState.GetLastVisibleQuestStep
// 0x0008 (0x0008 - 0x0000)
struct QuestState_GetLastVisibleQuestStep final
{
public:
	class UQuestStep*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetLastVisibleQuestStep;

// Function FlexibleQuestsRuntime.QuestState.GetNextVisibleQuestStep
// 0x0010 (0x0010 - 0x0000)
struct QuestState_GetNextVisibleQuestStep final
{
public:
	const class UQuestStep*                       ForStep;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UQuestStep*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetNextVisibleQuestStep;

// Function FlexibleQuestsRuntime.QuestState.GetQuestAsset
// 0x0008 (0x0008 - 0x0000)
struct QuestState_GetQuestAsset final
{
public:
	class UGenericQuest*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetQuestAsset;

// Function FlexibleQuestsRuntime.QuestState.GetQuestName
// 0x0018 (0x0018 - 0x0000)
struct QuestState_GetQuestName final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetQuestName;

// Function FlexibleQuestsRuntime.QuestState.GetQuestStatus
// 0x0001 (0x0001 - 0x0000)
struct QuestState_GetQuestStatus final
{
public:
	EQuestStatus                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetQuestStatus;

// Function FlexibleQuestsRuntime.QuestState.GetStepsHistory
// 0x0010 (0x0010 - 0x0000)
struct QuestState_GetStepsHistory final
{
public:
	TArray<class UQuestStep*>                     HistoricalSteps;                                   // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_QuestState_GetStepsHistory;

}

