#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FSRSettings

#include "Basic.hpp"

#include "E_FSR_structs.hpp"
#include "E_FSR_SR_structs.hpp"
#include "E_FSR_FI_structs.hpp"


namespace SDK
{

// UserDefinedStruct FSRSettings.FSRSettings
// 0x0010 (0x0010 - 0x0000)
struct FFSRSettings final
{
public:
	E_FSR                                         OnOff_35_4793C9D642743AAED42D6CABA9ADC7AB;         // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FSR_SR                                      Mode_36_B18CE33142B0892A0B57BAAF4495C79E;          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_FSR_FI                                      FI_39_5E4927CA40A172E04C2D3993BAE1101A;            // 0x0002(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Sharpness_29_1525A8964505018C76D51DB8A23BBE16;     // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FFSRSettings;

}

