#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_AimMode

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "Engine_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_AimMode.GA_AimMode_C
// 0x0270 (0x06D0 - 0x0460)
class UGA_AimMode_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAimActionData*                         AimActionData;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputRelease*          WaitInputReleaseTask;                              // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputActionPressed*    WaitShootInputTask;                                // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bWantToShoot;                                      // 0x0488(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_489[0x7];                                      // 0x0489(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         WaitShootingAbilityEnded;                          // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            AimStateEffectHandle;                              // 0x0498(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bWantExit;                                         // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TargetCheckTimerHandle;                            // 0x04A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CurrentAimedTarget;                                // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAimedTargetHostile;                              // 0x04B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B9[0x7];                                      // 0x04B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Aim_C*                             AimWidgetRef;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URangeWeaponItem*                       RangeWeaponRef;                                    // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            PredictedDamageEffectHandle;                       // 0x04D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UConcentrationComponent*                ConcentrationComponent;                            // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<EShootAnimationType, class UAnimMontage*> LoadedAimMontages;                                // 0x04E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MontageLoaderIterator;                             // 0x0530(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHand                                         CurrentWeaponHand;                                 // 0x0534(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHand                                         PreviousWeaponHand;                                // 0x0535(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCrouch;                                          // 0x0536(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EShootAnimationType                           CurrentAimState;                                   // 0x0537(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            UnderAimStateEffectHandle;                         // 0x0538(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CurrentTargetHitResult;                            // 0x0540(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bWantSwichIdleStand;                               // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            RangeWeaponSwitchBlockEffectHandle;                // 0x062C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_634[0x4];                                      // 0x0634(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayEvent*         NoAmmoWaitTagTask;                                 // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            Tutorial_Shooting_Effect_Handle;                   // 0x0640(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAimBlocked;                                      // 0x0648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_649[0x7];                                      // 0x0649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CachedHandIdleTransform;                           // 0x0650(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LastHandClipLocation;                              // 0x06B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyPredictedDamage();
	void ApplyUnderAimStateEffect();
	void BindToRangeWeaponSwitch();
	void BindToTagChanged();
	void CacheHandIdlePosition();
	void CallShootingAbility();
	void ChangeAimBlockedState(bool IsBlocked);
	void ChangeAimState(EShootAnimationType NewState);
	void CheckArmorHit(const struct FHitResult& Hit, bool* Result);
	void CheckObstacles(bool* IsHandClipped_);
	void EventReceived_A1EF9D9B49D42A868DE67C9538F48A00(const struct FGameplayEventData& Payload);
	void EventReceived_F220312746BF60F27F493281E9889A7A(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_AimMode(int32 EntryPoint);
	void ExitAimMode();
	void GenerateShootingAbilityPayload(struct FGameplayEventData* OutPayload);
	void GetAimedCharacter(class AActor** HitActor, bool* IsHostile, struct FHitResult* OutHit);
	class UAimActionData* GetAnimationData(class UActionDataAsset* ActionDataAsset);
	void GetDamageEffect(const struct FHitResult& Hit, class UClass** DamageEffect);
	void GetShootingWeapon(class URangeWeaponItem** Range_Weapon);
	void GetTraceLocations(struct FVector* StartLocation, struct FVector* EndLocation);
	void Initialize(bool* Result);
	void InitializeAimWidget();
	void InitializeAnimData(bool* Result);
	bool IsHostileActor_(const class AActor* OwnerActor, const class AActor* EnemyActor);
	bool IsLastShoot_(class URangeWeaponItem* Item);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void LoadMontagesAsync(const struct FAimActionMontages& Montages);
	void OnActiveRangeWeaponChanged(class URangeWeaponItem* NewActiveWeapon, int32 Index_0);
	void OnAvatarActorTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void OnBlendOut_216822FA46D7DFED8BF85383EF2DA76E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnBlendOut_2C0866254FB700DEDB6AD28A0E4FAEFB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnBlendOut_41896A20474EF152367F3E973C2927CA(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnBlendOut_74D3B71549F9F05A7BECA9AF8248FA24(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnBlendOut_B77B832C45491EBC60F20E822092DA06(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnBlendOut_D525CCA4451966940522E6989E53BB2C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_216822FA46D7DFED8BF85383EF2DA76E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_2C0866254FB700DEDB6AD28A0E4FAEFB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_41896A20474EF152367F3E973C2927CA(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_74D3B71549F9F05A7BECA9AF8248FA24(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_B77B832C45491EBC60F20E822092DA06(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_D525CCA4451966940522E6989E53BB2C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_216822FA46D7DFED8BF85383EF2DA76E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_2C0866254FB700DEDB6AD28A0E4FAEFB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_41896A20474EF152367F3E973C2927CA(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_74D3B71549F9F05A7BECA9AF8248FA24(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_B77B832C45491EBC60F20E822092DA06(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_D525CCA4451966940522E6989E53BB2C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_216822FA46D7DFED8BF85383EF2DA76E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_2C0866254FB700DEDB6AD28A0E4FAEFB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_41896A20474EF152367F3E973C2927CA(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_74D3B71549F9F05A7BECA9AF8248FA24(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_B77B832C45491EBC60F20E822092DA06(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_D525CCA4451966940522E6989E53BB2C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_216822FA46D7DFED8BF85383EF2DA76E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_2C0866254FB700DEDB6AD28A0E4FAEFB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_41896A20474EF152367F3E973C2927CA(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_74D3B71549F9F05A7BECA9AF8248FA24(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_B77B832C45491EBC60F20E822092DA06(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_D525CCA4451966940522E6989E53BB2C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnRelease_095254B64D07741F09F752A756A09325(float TimeHeld);
	void PlayAimModeAnimations();
	void PlayIdleAimMontage();
	void PlayNoAmmoMontage();
	void RemovePredictedDamageEffect();
	void RemoveUnderAimStateEffect();
	void SetCanSwitchWeapons(bool Value);
	void StartAimMode();
	void StartTargetCheck();
	void StopAimMode();
	void TargetCheckTick();
	void TraceAimModeTarget(struct FHitResult* OutHit);
	void UpdateAimedCharacter(class AActor* Target, bool IsHostile, const struct FHitResult& Hit);
	void UpdateCrosshair();
	void WaitInput();
	void WaitShootInput();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_AimMode_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_AimMode_C")
	}
	static class UGA_AimMode_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_AimMode_C>();
	}
};
DUMPER7_ASSERTS_UGA_AimMode_C;

}

