#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BlockNPC_NewBattleSystem

#include "Basic.hpp"

#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GA_FencingDefence_classes.hpp"
#include "AIModule_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BlockNPC_NewBattleSystem.GA_BlockNPC_NewBattleSystem_C
// 0x0100 (0x0610 - 0x0510)
class UGA_BlockNPC_NewBattleSystem_C final : public UGA_FencingDefence_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_BlockNPC_NewBattleSystem_C;      // 0x0510(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            BlockEffectSpec;                                   // 0x0518(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            StartBlockEffectSpec;                              // 0x0520(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         WaitBlockActivatedTask;                            // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         RotateTask;                                        // 0x0530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEffectRemoved* WaitBlockEndTask;                                  // 0x0538(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckBBValue;                                      // 0x0540(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_541[0x7];                                      // 0x0541(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           Montage_to_Play;                                   // 0x0548(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNewBlockActionData_C*                  BlockActionData_0;                                 // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlockActionMontages                   BlockMontages;                                     // 0x0558(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UHitActionDataByTag_C*                  NewVar_0_0;                                        // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Stun;                                              // 0x0600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_601[0x7];                                      // 0x0601(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMotionWarpingComponent*                WarpingComponent_0;                                // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_BlockNPC_NewBattleSystem(int32 EntryPoint);
	void GetParryHitMontage(bool StunParry, TSoftObjectPtr<class UAnimMontage>* PreparingMontage);
	bool IsInstigatorHostile();
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnAttackHitRecieved(const struct FAttackHitData& AttackHitData);
	void RotateNPCToFacePlayer();
	void SetDebugAIState(EBattleNPCState BattleState);
	void StartBlock(double BlockDuration);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_BlockNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_BlockNPC_NewBattleSystem_C")
	}
	static class UGA_BlockNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BlockNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_BlockNPC_NewBattleSystem_C;

}

