#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BaseElimination

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BaseElimination.GA_BaseElimination_C
// 0x00B0 (0x0510 - 0x0460)
#pragma pack(push, 0x1)
class alignas(0x10) UGA_BaseElimination_C : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Target;                                            // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             KillPlaceTransform;                                // 0x0470(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AnimPlayerOffset;                                  // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            PlayerMontage;                                     // 0x04D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UClass*                                 NPCAbility;                                        // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CameraAnimation();
	void ExecuteUbergraph_GA_BaseElimination(int32 EntryPoint);
	void FindAvailablePlaceForKill(struct FTransform* Transform, bool* Result);
	void Get_Player_Transform_in_Place(struct FTransform* PlayerTransform);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_0169995045D4C339CB6E75A52796BDE5(class FName NotifyName);
	void OnCompleted_0169995045D4C339CB6E75A52796BDE5(class FName NotifyName);
	void OnInterrupted_0169995045D4C339CB6E75A52796BDE5(class FName NotifyName);
	void OnNotifyBegin_0169995045D4C339CB6E75A52796BDE5(class FName NotifyName);
	void OnNotifyEnd_0169995045D4C339CB6E75A52796BDE5(class FName NotifyName);
	void OnNotifyTriggered(class FName Name_0);
	void PlayCharactersAnimation();
	void PreAnimationExecution();
	void Teleport_Player_And_Target_to_Kill_Place();
	void TurnOffTargetLogic();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_BaseElimination_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_BaseElimination_C")
	}
	static class UGA_BaseElimination_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BaseElimination_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UGA_BaseElimination_C;

}

