#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_BaseTraversal

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_BaseTraversal.GA_BaseTraversal_C
// 0x0030 (0x0490 - 0x0460)
class UGA_BaseTraversal_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ADefaultCharacter*                      OwnerCharacter;                                    // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ATraversalInteraction*                  InteractedTraversal;                               // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            DuringAbilityEffect;                               // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            ActiveEffectHandle;                                // 0x0480(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RevertCapsuleRadius;                               // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_BaseTraversal(int32 EntryPoint);
	void GetGrantedTag(struct FGameplayTag* Tag);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_9F2EF42E4395D2B1974E57B7A54EA26D(class FName NotifyName);
	void OnCompleted_9F2EF42E4395D2B1974E57B7A54EA26D(class FName NotifyName);
	void OnInterrupted_9F2EF42E4395D2B1974E57B7A54EA26D(class FName NotifyName);
	void OnNotifyBegin_9F2EF42E4395D2B1974E57B7A54EA26D(class FName NotifyName);
	void OnNotifyEnd_9F2EF42E4395D2B1974E57B7A54EA26D(class FName NotifyName);
	void RevertTraversalMovementMode();
	void SetTraversalMovementMode();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_BaseTraversal_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_BaseTraversal_C")
	}
	static class UGA_BaseTraversal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_BaseTraversal_C>();
	}
};
DUMPER7_ASSERTS_UGA_BaseTraversal_C;

}

