#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Block_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Block_NewBattleSystem.GA_Block_NewBattleSystem_C
// 0x00F0 (0x0550 - 0x0460)
class UGA_Block_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            BlockEffectSpec;                                   // 0x0468(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage_to_Play;                                   // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          isBlocking;                                        // 0x0478(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_479[0x7];                                      // 0x0479(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNewBlockActionData_C*                  BlockActionData;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FBlockActionMontages                   BlockMontages;                                     // 0x0488(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterEquipmentComponent*           CharacterEquipment;                                // 0x0528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UAbilityTask*>                   WaitInputTasks;                                    // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityTask_WaitGameplayTagRemoved*    WaitHitRemoveTask;                                 // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            BlockEffectHandle;                                 // 0x0548(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActivateBlock();
	void ExecuteUbergraph_GA_Block_NewBattleSystem(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnRelease_FEB744534AF8D1334E495A89CC14286E(float TimeHeld);
	void OnTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void Removed_874776A84D339A08BD5FB793A13B23FA();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Block_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Block_NewBattleSystem_C")
	}
	static class UGA_Block_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Block_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_Block_NewBattleSystem_C;

}

