#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ComboAttackNPC_Counter

#include "Basic.hpp"

#include "InventorySystemModule_structs.hpp"


namespace SDK::Params
{

// Function GA_ComboAttackNPC_Counter.GA_ComboAttackNPC_Counter_C.GetCombo
// 0x0020 (0x0020 - 0x0000)
struct GA_ComboAttackNPC_Counter_C_GetCombo final
{
public:
	class UNPCComboActionData*                    InputActionData;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UComboDescription*                      Combo_0;                                           // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EEquipmentType                                CallFunc_GetEquipmentType_ReturnValue;             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UComboDescription*                      CallFunc_GetCounterCombo_ReturnValue;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ComboAttackNPC_Counter_C_GetCombo;

}

