#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ComboAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ComboAttack.GA_ComboAttack_C
// 0x01C8 (0x0628 - 0x0460)
class UGA_ComboAttack_C : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UActionDataAsset*                       Action_Data_Asset;                                 // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UComboActionData*                       ActionData;                                        // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CurrentAttackAnimation;                            // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	EAttackType                                   NextAttackType;                                    // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackType                                   PreviousAttackType;                                // 0x04A9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComboType                                    CurrentComboType;                                  // 0x04AA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4AB[0x5];                                      // 0x04AB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAbilityTask*>                   WaitInputTasks;                                    // 0x04B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ComboAttackIndex;                                  // 0x04C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FCharacterStand                        PreviousStand;                                     // 0x04C4(0x0002)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_4C6[0x2];                                      // 0x04C6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AActor*>                           DamagedActors;                                     // 0x04C8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	double                                        AttackDamage;                                      // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttackType                                   CurrentAttackType;                                 // 0x0520(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_521[0x3];                                      // 0x0521(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilitySpecHandle             GivenAbility;                                      // 0x0524(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<EAttackType, struct FGameplayTag>        ComboAttackTriggerTags;                            // 0x0528(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityTask_WaitGameplayEvent*         WaitAbilityEndedEvent;                             // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsFinisher;                                       // 0x0580(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_581[0x7];                                      // 0x0581(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EAttackType, EEquipmentSlotType>         AttackTypeToEquipmentSlotMap;                      // 0x0588(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          bEquipmentSlotChanged;                             // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCurrentInputReleased;                             // 0x05D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5DA[0x6];                                      // 0x05DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAbilityTask*>                   WaitAttackStageTasks;                              // 0x05E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	EAttackStage                                  CurrentAttackStage;                                // 0x05F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bRequestComboEnd;                                  // 0x05F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5F2[0x6];                                      // 0x05F2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            PreviousAttackAnimation;                           // 0x05F8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UBPC_TargetLock_C*                      TargetLockComponent;                               // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Added_A1A05EE441DDBFA92CC5B4945474E9E5();
	void Added_AE25F8C6446E2B2B8E5974B932F9E7A3();
	void Added_F03E72E7459E44E6C72DD880F4D0AD82();
	void ChangeAttackStage(EAttackStage NewAttackStage);
	bool CheckCanUseCurrentAttackType(EAttackType AttackType);
	void ClearWaitInputTasks();
	void ExecuteUbergraph_GA_ComboAttack(int32 EntryPoint);
	void FindProperNextAnim(TSoftObjectPtr<class UAnimMontage> PreviousMontage, TSoftObjectPtr<class UAnimMontage>* NextMontage);
	void FindProperRangeMontage(TSoftObjectPtr<class UAnimMontage>* Animation);
	void FindProperStarterAnim(class UComboActionData* ActionData_0, TSoftObjectPtr<class UAnimMontage>* Starter);
	void FinishCombo();
	class UComboActionData* GetAnimationData(class UActionDataAsset* ActionDataAsset);
	void GetCharacterMovementState(class ACharacter* Target, EEnterCondition* Result);
	void GetEssentialComponents(class AActor* Target, bool* Result);
	void GetNextAttackType(EEnterCondition* Result);
	void GetStarterType(EEnterCondition* StarterType);
	void IsCounterAttack(bool* Result);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnComboAbilityEnded(EAttackAbilityEndReason Reason, class UComboAttackDataPayload_C* Payload);
	void OnComboContinueEvent(EAttackType NextAttackType_0);
	void OnPress_8DE1008E4B587DD811B46E82252C48A0(float TimeWaited);
	void OnPress_8DE1008E4B587DD811B46E827483464D(float TimeWaited);
	void OnPress_8DE1008E4B587DD811B46E82D0AFE834(float TimeWaited);
	void OnPress_A1B2E0ED42DC5DE3701D1BBB1D412C1F(float TimeWaited);
	void OnPress_A1B2E0ED42DC5DE3701D1BBBB96D8266(float TimeWaited);
	void OnPress_A1B2E0ED42DC5DE3701D1BBBE8C28C8B(float TimeWaited);
	void PlayAttack(TSoftObjectPtr<class UAnimMontage> Animation);
	void PlayBackToStanceAnimation();
	void ReturnProperEquipmentSlot();
	void ShowDebugText(const class FText& InText);
	void StartAttackAbility();
	void SwitchToProperEquipmentSlot();
	void TryToContinueCombo();
	void UpdateComboType();
	void WaitAttackStageTags();
	void WaitComboContinueEvents();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ComboAttack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ComboAttack_C")
	}
	static class UGA_ComboAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ComboAttack_C>();
	}
};
DUMPER7_ASSERTS_UGA_ComboAttack_C;

}

