#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_CameraTracking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_CameraTracking.GA_CameraTracking_C
// 0x0050 (0x0408 - 0x03B8)
class UGA_CameraTracking_C final : public UGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Focus_to_Actor;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Tracking_Time;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             Ability_Handle;                                    // 0x03D0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_Repeat*                    FirstTask;                                         // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_Repeat*                    SecondTask;                                        // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        StartPitchOffset;                                  // 0x03E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartYawOffset;                                    // 0x03F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InPitchOffset;                                     // 0x03F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        InYawOffset;                                       // 0x0400(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ClearAsyncTask();
	void ExecuteUbergraph_GA_CameraTracking(int32 EntryPoint);
	void InvestigationCamera(class AActor* FocusToActor, double TrackingTime, const struct FGameplayAbilitySpecHandle& AbilityHandle, EInvestigationTrackingMode TrackingMode);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinished_0D8E500540828298474E2DA7E951F470(int32 ActionNumber);
	void OnFinished_36E1E1D24503FA0E61FC9899A6E76085(int32 ActionNumber);
	void OnPerformAction_0D8E500540828298474E2DA7E951F470(int32 ActionNumber);
	void OnPerformAction_36E1E1D24503FA0E61FC9899A6E76085(int32 ActionNumber);
	void Set_View_Yaw_Min_Max(float YawRotationToTarget, float MinMaxValue);
	void TrackingCamera(class AActor* FocusToActor, double TrackingTime, const struct FGameplayAbilitySpecHandle& AbilityHandle, double StartPitchOffset_0, double StartYawOffset_0, double InPitchOffset_0, double InYawOffset_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_CameraTracking_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_CameraTracking_C")
	}
	static class UGA_CameraTracking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_CameraTracking_C>();
	}
};
DUMPER7_ASSERTS_UGA_CameraTracking_C;

}

