#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Combo_DodgeNPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_Combo_DodgeNPC.GA_Combo_DodgeNPC_C.ExecuteUbergraph_GA_Combo_DodgeNPC
// 0x0020 (0x0020 - 0x0000)
struct GA_Combo_DodgeNPC_C_ExecuteUbergraph_GA_Combo_DodgeNPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue_1; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Combo_DodgeNPC_C_ExecuteUbergraph_GA_Combo_DodgeNPC;

// Function GA_Combo_DodgeNPC.GA_Combo_DodgeNPC_C.GetMontage
// 0x0020 (0x0020 - 0x0000)
struct GA_Combo_DodgeNPC_C_GetMontage final
{
public:
	class UAnimMontage*                           MontageToPlay_0;                                   // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UComboAttackDataPayload_C*              ComboAttackDataPayload;                            // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UComboAttackDataPayload_C*              K2Node_DynamicCast_AsCombo_Attack_Data_Payload;    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Combo_DodgeNPC_C_GetMontage;

// Function GA_Combo_DodgeNPC.GA_Combo_DodgeNPC_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_Combo_DodgeNPC_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_Combo_DodgeNPC_C_K2_OnEndAbility;

}

