#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ComboAttackNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ComboAttackNPC.GA_ComboAttackNPC_C
// 0x00C0 (0x0520 - 0x0460)
class UGA_ComboAttackNPC_C : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UActionDataAsset*                       Action_Data_Asset;                                 // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNPCComboActionData*                    ActionData;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            CurrentAttackAnimation;                            // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         WaitAbilityEndedEvent;                             // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<ENPCAttackType, struct FGameplayTag>     ComboAttackTriggerTags;                            // 0x04B0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	ENPCAttackType                                CurrentAttackType;                                 // 0x0500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ComboAttackIndex;                                  // 0x0504(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBaseEquipmentSet*                      Equipment;                                         // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UComboDescription*                      Combo;                                             // 0x0510(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UComboOptionalAbilityObject*            Combo_Optional_Ability_Object;                     // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_10AD506D46AE0A4686D2DD8D4D738E1A(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_ComboAttackNPC(int32 EntryPoint);
	void FindProperNextAnim(TSoftObjectPtr<class UAnimMontage> PreviousMontage, TSoftObjectPtr<class UAnimMontage>* NextMontage);
	class UNPCComboActionData* Get_Animation_Data(class UActionDataAsset* ActionDataAsset);
	void GetCombo(class UNPCComboActionData* InputActionData, class UComboDescription** Combo_0);
	void GetMaxComboLength(class UComboDescription* Combo_0, int32* Length);
	void GetNextComboAnimationData(class UComboDescription* InputActionData, class UNPCMontageDescription** NewParam);
	void GetStarterAnimationData(class UComboDescription* InputActionData, class UNPCMontageDescription** AnimationData);
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void PlayAttack(class UNPCMontageDescription* AttackData);
	void StartAttackAbility();
	void TryGetCurrentEquipment(class AActor* Actor, bool* IsValid, class UBaseEquipmentSet** Equipment_0);
	void TryToContinueCombo();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ComboAttackNPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ComboAttackNPC_C")
	}
	static class UGA_ComboAttackNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ComboAttackNPC_C>();
	}
};
DUMPER7_ASSERTS_UGA_ComboAttackNPC_C;

}

