#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DeathNPC_Corpse_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DeathNPC_Corpse_NewBattleSystem.GA_DeathNPC_Corpse_NewBattleSystem_C
// 0x00B0 (0x0510 - 0x0460)
class UGA_DeathNPC_Corpse_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Direction;                                         // 0x0470(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNewDeathActionData_C*                  DeathActionData;                                   // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDeathActionMontages                   DeathMontages;                                     // 0x0498(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAnimMontage>            MontageToPlay;                                     // 0x04E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_DeathNPC_Corpse_NewBattleSystem(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void OnBlendOut_3FF30EFE47147346213630BEE83CB8F0(class FName NotifyName);
	void OnCompleted_3FF30EFE47147346213630BEE83CB8F0(class FName NotifyName);
	void OnInterrupted_3FF30EFE47147346213630BEE83CB8F0(class FName NotifyName);
	void OnNotifyBegin_3FF30EFE47147346213630BEE83CB8F0(class FName NotifyName);
	void OnNotifyEnd_3FF30EFE47147346213630BEE83CB8F0(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DeathNPC_Corpse_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DeathNPC_Corpse_NewBattleSystem_C")
	}
	static class UGA_DeathNPC_Corpse_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DeathNPC_Corpse_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_DeathNPC_Corpse_NewBattleSystem_C;

}

