#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DodgeRestoreStacks

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DodgeRestoreStacks.GA_DodgeRestoreStacks_C
// 0x0020 (0x0480 - 0x0460)
class UGA_DodgeRestoreStacks_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBaseAbilitiesComponent*                ASC_Ref;                                           // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RestoreTimerHandle;                                // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         RestoreTimeMax;                                    // 0x0478(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         NumEffects;                                        // 0x047C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CustomEvent();
	void ExecuteUbergraph_GA_DodgeRestoreStacks(int32 EntryPoint);
	void GetTimeToRestore(double* Time);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnTagChanged_Event(const struct FGameplayTag& UpdatedTag, bool Exists);
	void SetTimer();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DodgeRestoreStacks_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DodgeRestoreStacks_C")
	}
	static class UGA_DodgeRestoreStacks_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DodgeRestoreStacks_C>();
	}
};
DUMPER7_ASSERTS_UGA_DodgeRestoreStacks_C;

}

