#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Defence_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Defence_NewBattleSystem.GA_Defence_NewBattleSystem_C
// 0x0038 (0x0498 - 0x0460)
class UGA_Defence_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayer_CH_NewBattle_C*                 PlayerRef;                                         // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAbilityTask*>                   WaitInputTasks;                                    // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        DefaultCapsuleRadius;                              // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DodgeCapsuleRadius;                                // 0x0488(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagRemoved*    WaitHitRemoveTask;                                 // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EndAllWaitInputTasks();
	void ExecuteUbergraph_GA_Defence_NewBattleSystem(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void NotifyCallback(class FName NotifyName, bool End_);

	float GetCostValue() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Defence_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Defence_NewBattleSystem_C")
	}
	static class UGA_Defence_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Defence_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_Defence_NewBattleSystem_C;

}

