#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_DodgeNPC_NewBattleSystem

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_DodgeNPC_NewBattleSystem.GA_DodgeNPC_NewBattleSystem_C
// 0x01C8 (0x0628 - 0x0460)
class UGA_DodgeNPC_NewBattleSystem_C : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            RootMotionEffect;                                  // 0x0468(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           MontageToPlay;                                     // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            PostDodgeEffect;                                   // 0x0478(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNewDodgeActionData_C*                  DodgeActionData;                                   // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x0488(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FDodgeActionMontages                   DodgeMontages;                                     // 0x04B0(0x00A0)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          DodgeDirection;                                    // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_559[0x7];                                      // 0x0559(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     Event_Data;                                        // 0x0560(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           DodgeWarpingTimerHandle;                           // 0x0610(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WarpOffset;                                        // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                WarpComponent;                                     // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void Can_Enter_Warp_State(bool* Can);
	void CanWarp(class ACharacter* WarpTarget_0, double Offset, bool* bCan);
	void ClearWarpingTimers();
	void ClearWarpTargets();
	void DodgeWarp();
	void ExecuteUbergraph_GA_DodgeNPC_NewBattleSystem(int32 EntryPoint);
	void GetDodgeMontage(bool DodgeDirectionValue, TSoftObjectPtr<class UAnimMontage>* OutputPin);
	void GetMontage(class UAnimMontage** MontageToPlay_0);
	void GetWarpLocationAndRotaion(class ACharacter* Target, struct FVector* WarpLocation, struct FRotator* WarpRotation);
	void GetWarpTarget(class ACharacter** WarpTarget_0);
	void HandleWarping();
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_9CE1DF1C4014CDBB43D01FAFEA360656(class FName NotifyName);
	void OnCompleted_9CE1DF1C4014CDBB43D01FAFEA360656(class FName NotifyName);
	void OnInterrupted_9CE1DF1C4014CDBB43D01FAFEA360656(class FName NotifyName);
	void OnNotifyBegin_9CE1DF1C4014CDBB43D01FAFEA360656(class FName NotifyName);
	void OnNotifyEnd_9CE1DF1C4014CDBB43D01FAFEA360656(class FName NotifyName);
	void SetDebugAIState(EBattleNPCState BattleState);
	void WarpTarget(class FName WarpTargetName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_DodgeNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_DodgeNPC_NewBattleSystem_C")
	}
	static class UGA_DodgeNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_DodgeNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_DodgeNPC_NewBattleSystem_C;

}

