#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_EnchantedShirt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_EnchantedShirt.GA_EnchantedShirt_C
// 0x0030 (0x0490 - 0x0460)
class UGA_EnchantedShirt_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            ImmortalityEffectHandle;                           // 0x0468(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            ImmortalityEffect;                                 // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            HealEffect;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAbilityTask_WaitAttributeChange*       WaitAttributeChangedTask;                          // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityAsync_WaitGameplayTagRemoved*   WaitEscapeFromBattleTask;                          // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_EnchantedShirt(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnPreZeroHealth_Event();
	void Removed_192F2C2F4C34FE33F2CB3182F6D74E5F();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_EnchantedShirt_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_EnchantedShirt_C")
	}
	static class UGA_EnchantedShirt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_EnchantedShirt_C>();
	}
};
DUMPER7_ASSERTS_UGA_EnchantedShirt_C;

}

