#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_GiveUpNPC_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_GiveUpNPC_NewBattleSystem.GA_GiveUpNPC_NewBattleSystem_C
// 0x0060 (0x04C0 - 0x0460)
class UGA_GiveUpNPC_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNewGiveUpActionData_C*                 GiveUpActionData;                                  // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UAnimMontage>>    GiveUpMontages;                                    // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ANPC_CH_NewBattleSystem_C*              Character;                                         // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            MontageToPlay;                                     // 0x0490(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                         OldCapsuleRadius;                                  // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_GiveUpNPC_NewBattleSystem(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_04CA37E14E438621666D0BA2329B20E4(class FName NotifyName);
	void OnCompleted_04CA37E14E438621666D0BA2329B20E4(class FName NotifyName);
	void OnInterrupted_04CA37E14E438621666D0BA2329B20E4(class FName NotifyName);
	void OnNotifyBegin_04CA37E14E438621666D0BA2329B20E4(class FName NotifyName);
	void OnNotifyEnd_04CA37E14E438621666D0BA2329B20E4(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_GiveUpNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_GiveUpNPC_NewBattleSystem_C")
	}
	static class UGA_GiveUpNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_GiveUpNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_GiveUpNPC_NewBattleSystem_C;

}

