#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HeavyAttack_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HeavyAttack_NewBattleSystem.GA_HeavyAttack_NewBattleSystem_C
// 0x0168 (0x05C8 - 0x0460)
class UGA_HeavyAttack_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayer_CH_NewBattle_C*                 PlayerRef;                                         // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DamageTickTimerHandle;                             // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class AActor*>                           DamagedActors;                                     // 0x0478(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         AttackDistance;                                    // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackSphereRadius;                                // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttackDamage;                                      // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNewAttackActionData_C*                 AttackActionData;                                  // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAttackActionMontages                  AttackMontages;                                    // 0x04E0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x0530(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DirectionTag;                                      // 0x0558(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         AttacksToDo;                                       // 0x0578(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57C[0x4];                                      // 0x057C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputPress*            WaitInputTask;                                     // 0x0580(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterEquipmentComponent*           CharacterEquipment;                                // 0x0588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WeaponTrail;                                    // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Trail_2;                                       // 0x0598(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599[0x7];                                      // 0x0599(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      BloodSplash;                                       // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<bool>                                  HadSuccessfulHits;                                 // 0x05A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          CanStackCombo;                                     // 0x05B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5B9[0x7];                                      // 0x05B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitGameplayTagAdded*      WaitFriendlyTagTask;                               // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AddComboStack();
	void Added_E8B8EDAC45B2687AE758E7AAA2D48FE5();
	double CalculateCritChance();
	void CalculateDamage();
	void DealDamage(class AActor* Target);
	void ExecuteUbergraph_GA_HeavyAttack_NewBattleSystem(int32 EntryPoint);
	void FilterBlockingHits(TArray<struct FHitResult>& Hits, bool* Hit, TArray<struct FHitResult>* SuccesfulHits);
	void GetComboMultiplier(int32 ComboAmount, double* Output);
	bool IsCritHit();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void ManageBloodSplashes(class AActor* HitActor);
	void ManageWeaponTrail(bool Spawn, bool UseTrail2);
	void NotifyCallback(class FName Selection, const class UAnimNotifyState* AnimNotifyState, bool End_);
	void OnBlendOut_4AA96CBA4011B106500E1198864653DB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_4AA96CBA4011B106500E1198864653DB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_4AA96CBA4011B106500E1198864653DB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_4AA96CBA4011B106500E1198864653DB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_4AA96CBA4011B106500E1198864653DB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnOwnerWeaponOverlap(class AActor* OverlapedActor);
	void OnPress_2AD6593E4262562B14C300A80E7F1E35(float TimeWaited);
	void ResetComboStacks();
	void SetComboInputOffset();
	void ShowComboWidget(bool SuccessCombo, bool SuccessStatus);

	void GetDamageEffect(class UClass** DamageEffect) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_HeavyAttack_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_HeavyAttack_NewBattleSystem_C")
	}
	static class UGA_HeavyAttack_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HeavyAttack_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_HeavyAttack_NewBattleSystem_C;

}

