#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_InvestigationTracking

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_InvestigationTracking.GA_InvestigationTracking_C
// 0x0030 (0x03E8 - 0x03B8)
class UGA_InvestigationTracking_C final : public UGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AActor*                                 Focus_to_Actor;                                    // 0x03C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Tracking_Time;                                     // 0x03C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayAbilitySpecHandle             Ability_Handle;                                    // 0x03D0(0x0004)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EInvestigationTrackingMode                    Tracking_Mode;                                     // 0x03D4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D5[0x3];                                      // 0x03D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_Repeat*                    FirstTask;                                         // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_Repeat*                    SecondTask;                                        // 0x03E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ClearAsyncTask();
	void ExecuteUbergraph_GA_InvestigationTracking(int32 EntryPoint);
	void InvestigationCamera(class AActor* FocusToActor, double TrackingTime, const struct FGameplayAbilitySpecHandle& AbilityHandle, EInvestigationTrackingMode TrackingMode);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinished_032F18A44CCC792B135EEF8F66665D34(int32 ActionNumber);
	void OnFinished_FBD9D62D4A0856DFED9F24AA9E10CB0C(int32 ActionNumber);
	void OnPerformAction_032F18A44CCC792B135EEF8F66665D34(int32 ActionNumber);
	void OnPerformAction_FBD9D62D4A0856DFED9F24AA9E10CB0C(int32 ActionNumber);
	void Set_View_Yaw_Min_Max(float YawRotationToTarget, float MinMaxValue);
	void TrackingCamera(class AActor* FocusToActor, double TrackingTime, const struct FGameplayAbilitySpecHandle& AbilityHandle, double StartPitchOffset, double StartYawOffset, double InPitchOffset, double InYawOffset);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_InvestigationTracking_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_InvestigationTracking_C")
	}
	static class UGA_InvestigationTracking_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_InvestigationTracking_C>();
	}
};
DUMPER7_ASSERTS_UGA_InvestigationTracking_C;

}

