#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_InRunAttack_NewBattleSystem_NPC

#include "Basic.hpp"

#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_InRunAttack_NewBattleSystem_NPC.GA_InRunAttack_NewBattleSystem_NPC_C
// 0x01A8 (0x0608 - 0x0460)
class UGA_InRunAttack_NewBattleSystem_NPC_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSet<class AActor*>                           DamagedActors;                                     // 0x0468(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         AttackSphereRadius;                                // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AttackDamage;                                      // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DamageTickTimerHandle;                             // 0x04C8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x04D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         ComboCount;                                        // 0x04F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FC[0x4];                                      // 0x04FC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNewAttackActionData_C*                 AttackActionData;                                  // 0x0500(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAttackActionMontages                  AttackMontages;                                    // 0x0508(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  DirectionTag;                                      // 0x0558(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0578(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  ActionHitType;                                     // 0x0580(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Enemy;                                             // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AttackDistance;                                    // 0x05A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5AC[0x4];                                      // 0x05AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      NS_WeaponTrail;                                    // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 NPCOwnerRef;                                       // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Use_Trail_2;                                       // 0x05C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C1[0x7];                                      // 0x05C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      BloodSplash;                                       // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                WarpComponent;                                     // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WeaponTrail2;                                   // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          NotifyEnd_;                                        // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E1[0x3];                                      // 0x05E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   NotifyName;                                        // 0x05E4(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5EC[0x4];                                      // 0x05EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimNotifyState*                       Anim_Notify_State;                                 // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           WarpTickTimerHandle;                               // 0x05F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAITraitsBase*                          AITraits;                                          // 0x0600(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CalculateDamage();
	void DealDamage(class AActor* Target);
	void ExecuteUbergraph_GA_InRunAttack_NewBattleSystem_NPC(int32 EntryPoint);
	void GetWarpLocationAndRotation(class AActor* Sefl, class AActor* Target, double Distance, struct FVector* Location, struct FRotator* Rotation);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void ManageBloodSplashes(class AActor* HitActor);
	void ManageWeaponTrail(bool Spawn, bool UseTrail2);
	void NotifyCallback(class FName Selection, const class UAnimNotifyState* AnimNotyfyState, bool End_);
	void OnBlendOut_2D95E0D340D0FC43650DC1B3B577CE0E(class FName NotifyName_0, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_2D95E0D340D0FC43650DC1B3B577CE0E(class FName NotifyName_0, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_2D95E0D340D0FC43650DC1B3B577CE0E(class FName NotifyName_0, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_2D95E0D340D0FC43650DC1B3B577CE0E(class FName NotifyName_0, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_2D95E0D340D0FC43650DC1B3B577CE0E(class FName NotifyName_0, const class UAnimNotifyState* AnimNotifyState);
	void OnOwnerWeaponOverlap(class AActor* OverlapedActor);
	void SetDebugAIState(EBattleNPCState BattleState);
	void SetWarpLocation(class AActor* TargetActor, double Distance);
	void WarpCharacter();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_InRunAttack_NewBattleSystem_NPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_InRunAttack_NewBattleSystem_NPC_C")
	}
	static class UGA_InRunAttack_NewBattleSystem_NPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_InRunAttack_NewBattleSystem_NPC_C>();
	}
};
DUMPER7_ASSERTS_UGA_InRunAttack_NewBattleSystem_NPC_C;

}

