#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_KickNPC_NewBattleSystem

#include "Basic.hpp"

#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GA_MeleeAttack_Base_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_KickNPC_NewBattleSystem.GA_KickNPC_NewBattleSystem_C
// 0x0190 (0x0798 - 0x0608)
class UGA_KickNPC_NewBattleSystem_C final : public UGA_MeleeAttack_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_KickNPC_NewBattleSystem_C;       // 0x0608(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSet<class AActor*>                           DamagedActors_0;                                   // 0x0610(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAbilityTask_Repeat*                    DamageTickTask;                                    // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AttackDistance_0;                                  // 0x0668(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackSphereRadius;                                // 0x066C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AttackDamage_0;                                    // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           DamageTickTimerHandle;                             // 0x0678(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           KickTickTimerHandle;                               // 0x0680(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNewKickActionData_C*                   KickActionData;                                    // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FKickActionMontages                    KickMontages;                                      // 0x0690(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x06E0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FGameplayTagContainer>          AttackTags;                                        // 0x0708(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   DirectionNotify;                                   // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0720(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DirectionTag_0;                                    // 0x0728(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  ActionHitType;                                     // 0x0748(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          RollKickType;                                      // 0x0768(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_769[0x7];                                      // 0x0769(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Enemy;                                             // 0x0770(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 NPCOwnerRef;                                       // 0x0778(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WeaponTrail;                                    // 0x0780(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      BloodSplash;                                       // 0x0788(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMotionWarpingComponent*                WarpComponent_0;                                   // 0x0790(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void CalculateDamage();
	void CalculateKick();
	void ExecuteUbergraph_GA_KickNPC_NewBattleSystem(int32 EntryPoint);
	void Get_Direction_Tag(struct FGameplayTagContainer* Output);
	void GetWarpLocationAndRotation(class AActor* Sefl, class AActor* Target, double Distance, struct FVector* Location, struct FRotator* Rotation);
	void K2_ActivateAbility();
	void ManageWeaponTrail(bool Spawn, bool UseTrail2);
	void NotifyCallback(class FName Selection, const class UAnimNotifyState* AnimNotify, bool End_);
	void OnBlendOut_4A2131FD4790408027F76B80684D024E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_4A2131FD4790408027F76B80684D024E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_4A2131FD4790408027F76B80684D024E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_4A2131FD4790408027F76B80684D024E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_4A2131FD4790408027F76B80684D024E(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void SetDebugAIState(EBattleNPCState BattleState);
	void SetWarpLocation(class AActor* TargetActor, double Distance);
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_KickNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_KickNPC_NewBattleSystem_C")
	}
	static class UGA_KickNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_KickNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_KickNPC_NewBattleSystem_C;

}

