#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ListenForEvent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ListenForEvent.GA_ListenForEvent_C
// 0x0040 (0x03F8 - 0x03B8)
class UGA_ListenForEvent_C final : public UGameplayAbility
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FGameplayTag>                   Event_Tags;                                        // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         Event_Magnitude;                                   // 0x03D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D4[0x4];                                      // 0x03D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            Gameplay_Effect_Class;                             // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FGameplayEffectSpecHandle              Spec;                                              // 0x03E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           Event_Tag;                                         // 0x03F0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_CD2986CF426E0768C17B96B62FB74610(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_ListenForEvent(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ListenForEvent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ListenForEvent_C")
	}
	static class UGA_ListenForEvent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ListenForEvent_C>();
	}
};
DUMPER7_ASSERTS_UGA_ListenForEvent_C;

}

