#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MeleeAttack_Heavy_Base

#include "Basic.hpp"

#include "Smuta_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function GA_MeleeAttack_Heavy_Base.GA_MeleeAttack_Heavy_Base_C.ApplyFeelingEffects
// 0x0020 (0x0020 - 0x0000)
struct GA_MeleeAttack_Heavy_Base_C_ApplyFeelingEffects final
{
public:
	class UBaseAbilitiesComponent*                CallFunc_GetAttackerAbilityComponent_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBaseAbilitiesComponent*                CallFunc_GetAttackerAbilityComponent_ReturnValue_1; // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGameplayEffectByClass_ReturnValue;   // 0x0010(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            CallFunc_ApplyGameplayEffectByClass_ReturnValue_1; // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_MeleeAttack_Heavy_Base_C_ApplyFeelingEffects;

// Function GA_MeleeAttack_Heavy_Base.GA_MeleeAttack_Heavy_Base_C.ApplyVFXEffects
// 0x0218 (0x0218 - 0x0000)
struct GA_MeleeAttack_Heavy_Base_C_ApplyVFXEffects final
{
public:
	struct FAttackHitData                         HitData;                                           // 0x0000(0x0210)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_MeleeAttack_Heavy_Base_C_ApplyVFXEffects;

// Function GA_MeleeAttack_Heavy_Base.GA_MeleeAttack_Heavy_Base_C.DealDamageToActor
// 0x0040 (0x0040 - 0x0000)
struct GA_MeleeAttack_Heavy_Base_C_DealDamageToActor final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DirectionTag;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                L_TargetASC;                                       // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilitySystemComponent*                CallFunc_GetAbilitySystemComponent_ReturnValue;    // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetAvatarActorFromActorInfo_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ApplyDamage_ReturnValue;                  // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_ApplyDamage_BaseDamage_ImplicitCast;      // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_MeleeAttack_Heavy_Base_C_DealDamageToActor;

// Function GA_MeleeAttack_Heavy_Base.GA_MeleeAttack_Heavy_Base_C.GetAttackHitTag
// 0x0088 (0x0088 - 0x0000)
struct GA_MeleeAttack_Heavy_Base_C_GetAttackHitTag final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Temp_struct_Variable;                              // 0x0028(0x0020)()
	struct FGameplayTagContainer                  Temp_struct_Variable_1;                            // 0x0048(0x0020)()
	struct FGameplayTagContainer                  K2Node_Select_Default;                             // 0x0068(0x0020)()
};
DUMPER7_ASSERTS_GA_MeleeAttack_Heavy_Base_C_GetAttackHitTag;

// Function GA_MeleeAttack_Heavy_Base.GA_MeleeAttack_Heavy_Base_C.GetDamageEffect
// 0x0008 (0x0008 - 0x0000)
struct GA_MeleeAttack_Heavy_Base_C_GetDamageEffect final
{
public:
	class UClass*                                 DamageEffect;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_MeleeAttack_Heavy_Base_C_GetDamageEffect;

// Function GA_MeleeAttack_Heavy_Base.GA_MeleeAttack_Heavy_Base_C.GetFinisherDamageEffect
// 0x0010 (0x0010 - 0x0000)
struct GA_MeleeAttack_Heavy_Base_C_GetFinisherDamageEffect final
{
public:
	class UClass*                                 DamageEffect;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetDamageEffect_DamageEffect;             // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_MeleeAttack_Heavy_Base_C_GetFinisherDamageEffect;

}

