#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MeleeAttack_Unparry

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_MeleeAttack_Base_NPC_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_MeleeAttack_Unparry.GA_MeleeAttack_Unparry_C
// 0x0040 (0x0658 - 0x0618)
class UGA_MeleeAttack_Unparry_C final : public UGA_MeleeAttack_Base_NPC_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_MeleeAttack_Unparry_C;           // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UMaterialInstanceDynamic*               DynamicMaterial;                                   // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        OffsetTImer;                                       // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OpacityTImer;                                      // 0x0630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OffsetTimerHandle;                                 // 0x0638(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           OpacityTimerHandle;                                // 0x0640(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            OpacityCurve;                                      // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            OffsetCurve;                                       // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void DealDamageToActor(class AActor* Actor);
	void DisableVFXOverlayMaterial();
	void EnableVFXOverlayMaterial();
	void ExecuteUbergraph_GA_MeleeAttack_Unparry(int32 EntryPoint);
	void SetMaterialParameters(class UMaterialInstanceDynamic* Material);
	void SetOffset();
	void SetOpacity();
	struct FGameplayTagContainer GetAttackHitTag();
	void GetDamageEffect(class UClass** DamageEffect);
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_MeleeAttack_Unparry_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_MeleeAttack_Unparry_C")
	}
	static class UGA_MeleeAttack_Unparry_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_MeleeAttack_Unparry_C>();
	}
};
DUMPER7_ASSERTS_UGA_MeleeAttack_Unparry_C;

}

