#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_NPCFinishingOffDefeat

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_NPCFinishingOffDefeat.GA_NPCFinishingOffDefeat_C.ExecuteUbergraph_GA_NPCFinishingOffDefeat
// 0x00C8 (0x00C8 - 0x0000)
struct GA_NPCFinishingOffDefeat_C_ExecuteUbergraph_GA_NPCFinishingOffDefeat final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_NPCFinishingOffDefeat_C_ExecuteUbergraph_GA_NPCFinishingOffDefeat;

// Function GA_NPCFinishingOffDefeat.GA_NPCFinishingOffDefeat_C.GetMontage
// 0x0058 (0x0058 - 0x0000)
struct GA_NPCFinishingOffDefeat_C_GetMontage final
{
public:
	TSoftObjectPtr<class UAnimMontage>            Montage_0;                                         // 0x0000(0x0028)(Parm, OutParm, HasGetValueTypeHash)
	bool                                          bDirectionFound;                                   // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0030(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_NPCFinishingOffDefeat_C_GetMontage;

// Function GA_NPCFinishingOffDefeat.GA_NPCFinishingOffDefeat_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_NPCFinishingOffDefeat_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_NPCFinishingOffDefeat_C_K2_ActivateAbilityFromEvent;

}

