#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Parry_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Parry_NewBattleSystem.GA_Parry_NewBattleSystem_C
// 0x0240 (0x06A0 - 0x0460)
class UGA_Parry_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityTask_WaitInputPress*            WaitInputTask;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x0470(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FParryActionMontages                   ParryMontages;                                     // 0x0498(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            ParryingEffectSpec;                                // 0x0588(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         WaitParryTask;                                     // 0x0590(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     ParriedAttackPayload;                              // 0x0598(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  EnemyAttackTags;                                   // 0x0648(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Attacker;                                          // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Parried;                                           // 0x0670(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_671[0x7];                                      // 0x0671(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTagContainer>          AttackTags;                                        // 0x0678(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UCharacterEquipmentComponent*           OwnerEquipmentComponent;                           // 0x0688(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNewParryActionData_C*                  ParryActionData;                                   // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sparkles;                                       // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_7582506C465306CF015A299F855DD736(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_Parry_NewBattleSystem(int32 EntryPoint);
	void Get_Direction_Tag(struct FGameplayTagContainer* Output);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void ManageSparks(bool Spawn);
	void OnBlendOut_8E0FB62B45A89F70BD85418E26699F40(class FName NotifyName);
	void OnBlendOut_9317A9BF4350D8D3A32AF695D12B5578(class FName NotifyName);
	void OnCompleted_8E0FB62B45A89F70BD85418E26699F40(class FName NotifyName);
	void OnCompleted_9317A9BF4350D8D3A32AF695D12B5578(class FName NotifyName);
	void OnInterrupted_8E0FB62B45A89F70BD85418E26699F40(class FName NotifyName);
	void OnInterrupted_9317A9BF4350D8D3A32AF695D12B5578(class FName NotifyName);
	void OnNotifyBegin_8E0FB62B45A89F70BD85418E26699F40(class FName NotifyName);
	void OnNotifyBegin_9317A9BF4350D8D3A32AF695D12B5578(class FName NotifyName);
	void OnNotifyEnd_8E0FB62B45A89F70BD85418E26699F40(class FName NotifyName);
	void OnNotifyEnd_9317A9BF4350D8D3A32AF695D12B5578(class FName NotifyName);
	void ParryWindowEnd();
	void ParryWindowStart();
	void RotateAvatarActorToAttacker(class AActor* Enemy, class AActor* Attacker_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Parry_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Parry_NewBattleSystem_C")
	}
	static class UGA_Parry_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Parry_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_Parry_NewBattleSystem_C;

}

