#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PairCritNPC_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_PairCritNPC_NewBattleSystem.GA_PairCritNPC_NewBattleSystem_C
// 0x0058 (0x04B8 - 0x0460)
class UGA_PairCritNPC_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNewPairCritActionData_C*               FinisherActionData;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FFinisherActionMontages                FinisherMontages;                                  // 0x0470(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  DirectionTag;                                      // 0x0480(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTag                           FinisherActionTag;                                 // 0x04A0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Instigator;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_PairCritNPC_NewBattleSystem(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void NotifyCallback(class FName Selection, const class UAnimNotifyState* AnimNotifyState, bool End_);
	void OnBlendOut_A827751449744DCF32E4F185F431A82C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_A827751449744DCF32E4F185F431A82C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_A827751449744DCF32E4F185F431A82C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_A827751449744DCF32E4F185F431A82C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_A827751449744DCF32E4F185F431A82C(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void SetColissionOnCapsules(ECollisionResponse NewResponse);
	void SetRotationToInstigator(class AActor* TargetActor);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_PairCritNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_PairCritNPC_NewBattleSystem_C")
	}
	static class UGA_PairCritNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_PairCritNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_PairCritNPC_NewBattleSystem_C;

}

