#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_PlayerVigorousAttack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Smuta_structs.hpp"
#include "GA_MeleeAttack_Player_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_PlayerVigorousAttack.GA_PlayerVigorousAttack_C
// 0x0128 (0x0740 - 0x0618)
class UGA_PlayerVigorousAttack_C final : public UGA_MeleeAttack_Player_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_PlayerVigorousAttack_C;          // 0x0618(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTimerHandle                           DamageTickTimerHandle;                             // 0x0620(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class AActor*>                           DamagedActors_0;                                   // 0x0628(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                         AttackSphereRadius;                                // 0x0678(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_67C[0x4];                                      // 0x067C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UNewAttackActionData_C*                 AttackActionData;                                  // 0x0680(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAttackActionMontages                  AttackMontages;                                    // 0x0688(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x06D8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTagContainer                  DirectionTag_0;                                    // 0x0700(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         AttacksToDo;                                       // 0x0720(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_724[0x4];                                      // 0x0724(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputPress*            WaitInputTask;                                     // 0x0728(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCharacterEquipmentComponent*           CharacterEquipment;                                // 0x0730(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayTagAdded*      WaitFriendlyTagTask;                               // 0x0738(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyDamageToEnemy(class UAbilitySystemComponent* DamageTarget);
	void ApplySoundEffect(const struct FAttackHitData& HitData);
	void DealDamageToActor(class AActor* Actor);
	void ExecuteUbergraph_GA_PlayerVigorousAttack(int32 EntryPoint);
	struct FGameplayTagContainer GetAttackHitTag();
	void GetAttackMontage(class UAnimMontage** NewParam);
	void GetDamageEffect(class UClass** DamageEffect);
	void GetFinisherDamageEffect(class UClass** DamageEffect);
	void IsVigorEnough(bool* bIsEnough);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_PlayerVigorousAttack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_PlayerVigorousAttack_C")
	}
	static class UGA_PlayerVigorousAttack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_PlayerVigorousAttack_C>();
	}
};
DUMPER7_ASSERTS_UGA_PlayerVigorousAttack_C;

}

