#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ParryNPC_NewBattleSystem

#include "Basic.hpp"

#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ParryNPC_NewBattleSystem.GA_ParryNPC_NewBattleSystem_C
// 0x0240 (0x06A0 - 0x0460)
class UGA_ParryNPC_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityTask_WaitInputPress*            WaitInputTask;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x0470(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UNewParryActionData_C*                  ParryActionData;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FParryActionMontages                   ParryMontages;                                     // 0x04A0(0x00F0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            ParryingEffectSpec;                                // 0x0590(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitGameplayEvent*         WaitParryTask;                                     // 0x0598(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     ParriedAttackPayload;                              // 0x05A0(0x00B0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FGameplayTagContainer                  EnemyAttackTags;                                   // 0x0650(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AActor*                                 Attacker;                                          // 0x0670(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Parried;                                           // 0x0678(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_679[0x7];                                      // 0x0679(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FGameplayTagContainer>          AttackTags;                                        // 0x0680(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0690(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_Sparkles;                                       // 0x0698(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void EventReceived_950DDD8C4415922298C85995CDBEC7B3(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_GA_ParryNPC_NewBattleSystem(int32 EntryPoint);
	void Get_Direction_Tag(struct FGameplayTagContainer* Output);
	void GetParryMontages();
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void ManageSparks(bool Spawn);
	void OnBlendOut_4F39FD8749BF023D302F3288DEF12730(class FName NotifyName);
	void OnBlendOut_74D63F71444AB1F64F6D5C80A49E02D3(class FName NotifyName);
	void OnCompleted_4F39FD8749BF023D302F3288DEF12730(class FName NotifyName);
	void OnCompleted_74D63F71444AB1F64F6D5C80A49E02D3(class FName NotifyName);
	void OnInterrupted_4F39FD8749BF023D302F3288DEF12730(class FName NotifyName);
	void OnInterrupted_74D63F71444AB1F64F6D5C80A49E02D3(class FName NotifyName);
	void OnNotifyBegin_4F39FD8749BF023D302F3288DEF12730(class FName NotifyName);
	void OnNotifyBegin_74D63F71444AB1F64F6D5C80A49E02D3(class FName NotifyName);
	void OnNotifyEnd_4F39FD8749BF023D302F3288DEF12730(class FName NotifyName);
	void OnNotifyEnd_74D63F71444AB1F64F6D5C80A49E02D3(class FName NotifyName);
	void ParryWindowEnd();
	void ParryWindowStart();
	void RotateAvatarActorToAttacker(class AActor* Enemy, class AActor* Attacker_0);
	void SetDebugAIState(EBattleNPCState BattleState);
	void StartParry(const struct FGameplayEventData& GameplayEventData);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ParryNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ParryNPC_NewBattleSystem_C")
	}
	static class UGA_ParryNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ParryNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_ParryNPC_NewBattleSystem_C;

}

