#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ReloadRangeWeapon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ReloadRangeWeapon.GA_ReloadRangeWeapon_C
// 0x0068 (0x04C8 - 0x0460)
class UGA_ReloadRangeWeapon_C : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URangeWeaponItem*                       ActiveRangeWeapon;                                 // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAimActionData*                         AnimationData;                                     // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            ReloadAnimation;                                   // 0x0480(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UAnimMontage*                           ReloadAnimationRef;                                // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        NeedToRestoreAmmo;                                 // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurrentAmmo;                                       // 0x04B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bSlotChanged;                                      // 0x04BC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4BD[0x3];                                      // 0x04BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundWave*                             ReloadSound;                                       // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)

public:
	void CheckCanReload(bool* Result);
	void ExecuteUbergraph_GA_ReloadRangeWeapon(int32 EntryPoint);
	class UAimActionData* GetAnimationData(class UActionDataAsset* ActionDataAsset);
	void GetReloadAnimation(TSoftObjectPtr<class UAnimMontage>* Value);
	void Initialize(bool* Result);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_EC2D995D44D0DD2DC40596AADC0364CB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_EC2D995D44D0DD2DC40596AADC0364CB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_EC2D995D44D0DD2DC40596AADC0364CB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnLoaded_39C36A0349B8DCB92F13BA8877FF40DA(class UObject* Loaded);
	void OnMontageInterrupted(class UAnimMontage* Montage);
	void OnMontageStarted(class UAnimMontage* Montage);
	void OnNotifyBegin_EC2D995D44D0DD2DC40596AADC0364CB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_EC2D995D44D0DD2DC40596AADC0364CB(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void PlayReloadAnimation();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ReloadRangeWeapon_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ReloadRangeWeapon_C")
	}
	static class UGA_ReloadRangeWeapon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ReloadRangeWeapon_C>();
	}
};
DUMPER7_ASSERTS_UGA_ReloadRangeWeapon_C;

}

