#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ReloadRangeWeapon_Player

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_ReloadRangeWeapon_classes.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ReloadRangeWeapon_Player.GA_ReloadRangeWeapon_Player_C
// 0x0028 (0x04F0 - 0x04C8)
class UGA_ReloadRangeWeapon_Player_C final : public UGA_ReloadRangeWeapon_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_ReloadRangeWeapon_Player_C;      // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAbilityTask_WaitInputRelease*          WaitInputReleasedTask;                             // 0x04D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           InputHoldTimerHandle;                              // 0x04D8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUI_CharacterHUD_C*                     Character_HUD;                                     // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_UsableItemsPanel_C*                Usable_Items_Panel;                                // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_ReloadRangeWeapon_Player(int32 EntryPoint);
	void InitUI();
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnInputHoldEnd();
	void OnMontageInterrupted(class UAnimMontage* Montage);
	void OnMontageStarted(class UAnimMontage* Montage);
	void OnRelease_10FFB07F41314196CFF3E1AA2BE12ECB(float TimeHeld);
	void OnTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void PlayReloadAnimation();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ReloadRangeWeapon_Player_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ReloadRangeWeapon_Player_C")
	}
	static class UGA_ReloadRangeWeapon_Player_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ReloadRangeWeapon_Player_C>();
	}
};
DUMPER7_ASSERTS_UGA_ReloadRangeWeapon_Player_C;

}

