#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ReloadRangeWeapon_NPC

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Smuta_structs.hpp"


namespace SDK::Params
{

// Function GA_ReloadRangeWeapon_NPC.GA_ReloadRangeWeapon_NPC_C.ExecuteUbergraph_GA_ReloadRangeWeapon_NPC
// 0x00B8 (0x00B8 - 0x0000)
struct GA_ReloadRangeWeapon_NPC_C_ExecuteUbergraph_GA_ReloadRangeWeapon_NPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_Event_EventData;                            // 0x0008(0x00B0)(ConstParm)
};
DUMPER7_ASSERTS_GA_ReloadRangeWeapon_NPC_C_ExecuteUbergraph_GA_ReloadRangeWeapon_NPC;

// Function GA_ReloadRangeWeapon_NPC.GA_ReloadRangeWeapon_NPC_C.GetReloadAnimation
// 0x00A8 (0x00A8 - 0x0000)
struct GA_ReloadRangeWeapon_NPC_C_GetReloadAnimation final
{
public:
	TSoftObjectPtr<class UAnimMontage>            Value;                                             // 0x0000(0x0028)(Parm, OutParm, UObjectWrapper, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 CallFunc_GetOwningComponentFromActorInfo_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMesh*                          CallFunc_GetSkeletalMeshAsset_ReturnValue;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	const class USkeleton*                        CallFunc_GetSkeleton_ReturnValue;                  // 0x0038(0x0008)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UNPCShootActionData*                    CallFunc_GetActionData_ReturnValue;                // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCShootMontages                      CallFunc_Map_Find_Value;                           // 0x0050(0x0050)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ReloadRangeWeapon_NPC_C_GetReloadAnimation;

// Function GA_ReloadRangeWeapon_NPC.GA_ReloadRangeWeapon_NPC_C.K2_ActivateAbilityFromEvent
// 0x00B0 (0x00B0 - 0x0000)
struct GA_ReloadRangeWeapon_NPC_C_K2_ActivateAbilityFromEvent final
{
public:
	struct FGameplayEventData                     EventData;                                         // 0x0000(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_GA_ReloadRangeWeapon_NPC_C_K2_ActivateAbilityFromEvent;

// Function GA_ReloadRangeWeapon_NPC.GA_ReloadRangeWeapon_NPC_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_ReloadRangeWeapon_NPC_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_GA_ReloadRangeWeapon_NPC_C_K2_OnEndAbility;

}

