#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_RangeAttack_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_RangeAttack_NewBattleSystem.GA_RangeAttack_NewBattleSystem_C
// 0x0230 (0x0690 - 0x0460)
class UGA_RangeAttack_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNewAttackActionData_C*                 AttackActionData;                                  // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FAttackActionMontages                  AttackMontages;                                    // 0x0470(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAnimMontage>            Montage_to_Play;                                   // 0x04C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UEquipmentData*                         EquipmentData;                                     // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 DamageEffect;                                      // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ADefaultCharacter*                      OwnerRef;                                          // 0x04F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RotationTimer;                                     // 0x0500(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           AimingTimer;                                       // 0x0508(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         FindAttackTargetDistance;                          // 0x0510(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                AimWidgetRef;                                      // 0x0518(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Out_Hit;                                           // 0x0520(0x00E8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                PointToRotate;                                     // 0x0608(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAiming;                                          // 0x0620(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_621[0x7];                                      // 0x0621(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_CH_C*                              As_NPC_CH;                                         // 0x0628(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               LookAtRot;                                         // 0x0630(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class UCharacterEquipmentComponent*           EquipmentComponent;                                // 0x0648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      NS_WeaponTrail;                                    // 0x0650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ARangeWeaponProjectile*                 Projectile;                                        // 0x0658(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WeaponMesh;                                        // 0x0660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class URangeEquipmentSet*                     EquipmentSet;                                      // 0x0668(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  TargetTag;                                         // 0x0670(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Aiming();
	void ExecuteUbergraph_GA_RangeAttack_NewBattleSystem(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void ManageWeaponTrail(bool Spawn);
	void NotifyCallback(class FName Selection, const class UAnimNotifyState* AnimNotifyState, bool End_);
	void OnBlendOut_848B13094120B97940BC2284E993F5B8(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnCompleted_848B13094120B97940BC2284E993F5B8(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnInterrupted_848B13094120B97940BC2284E993F5B8(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyBegin_848B13094120B97940BC2284E993F5B8(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void OnNotifyEnd_848B13094120B97940BC2284E993F5B8(class FName NotifyName, const class UAnimNotifyState* AnimNotifyState);
	void ProjectileHit(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void RotationTick();
	void SetRangeTargetNPC(bool IsTarget);
	void SpawnWeaponProjectile(class USceneComponent* WeaponMesh_0, class URangeEquipmentSet* RangeWeaponEquipmentSet);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_RangeAttack_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_RangeAttack_NewBattleSystem_C")
	}
	static class UGA_RangeAttack_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_RangeAttack_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_RangeAttack_NewBattleSystem_C;

}

