#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SimpleDeathNPC_NewBattleSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SimpleDeathNPC_NewBattleSystem.GA_SimpleDeathNPC_NewBattleSystem_C
// 0x0090 (0x04F0 - 0x0460)
class UGA_SimpleDeathNPC_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  Direction;                                         // 0x0470(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UNewDeathActionData_C*                  DeathActionData;                                   // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDeathActionMontages                   DeathMontages;                                     // 0x0498(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FActiveGameplayEffectHandle            GE_Handle;                                         // 0x04E8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_SimpleDeathNPC_NewBattleSystem(int32 EntryPoint);
	void GetMontagesFromHitDirection(class UAnimMontage** Output, bool* Return);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_4BB0A0C34E9BC6F74C9CEB910AEE156C(class FName NotifyName);
	void OnCompleted_4BB0A0C34E9BC6F74C9CEB910AEE156C(class FName NotifyName);
	void OnInterrupted_4BB0A0C34E9BC6F74C9CEB910AEE156C(class FName NotifyName);
	void OnNotifyBegin_4BB0A0C34E9BC6F74C9CEB910AEE156C(class FName NotifyName);
	void OnNotifyEnd_4BB0A0C34E9BC6F74C9CEB910AEE156C(class FName NotifyName);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_SimpleDeathNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_SimpleDeathNPC_NewBattleSystem_C")
	}
	static class UGA_SimpleDeathNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SimpleDeathNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_SimpleDeathNPC_NewBattleSystem_C;

}

