#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Stealth_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Stealth_BP.GA_Stealth_BP_C
// 0x0060 (0x04C0 - 0x0460)
class UGA_Stealth_BP_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayer_CH_C*                           As_Player_CH;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_StackGeneratorHandle;                           // 0x0470(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GEClass;                                           // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        SoundStat;                                         // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            PeriodicGameplay_Effect_Class;                     // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UAbilitySystemComponent*                ASCRef;                                            // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            Remove_Gameplay_Effect_Class;                      // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          EndedAbility;                                      // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitAttributeChange*       Async_Task;                                        // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentRangePercent;                               // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OldRangePercent;                                   // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Ability_Sound(class USoundBase* PlaySound);
	struct FActiveGameplayEffectHandle ApplyEffectToSelf(TSubclassOf<class UGameplayEffect> GameplayEffectClass);
	void CastomCrouch(bool Crouch);
	bool CheckStealthMaxCharge();
	bool CheckStealthMinCharge();
	void ExecuteUbergraph_GA_Stealth_BP(int32 EntryPoint);
	void GetNoiseRangeForStealthRange(double StealthRangePercent, double* NoiseRange);
	void HandleStealthRangeChanged(double CurrentValue, double OldValue);
	void InvalidHandle_DD91B94E40A4EC9BAD3A2DA954520EB0(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnChange_969603CC4E7B4C1F5C51F4B91688EFAA();
	void OnRemoved_DD91B94E40A4EC9BAD3A2DA954520EB0(const struct FGameplayEffectRemovalInfo& GameplayEffectRemovalInfo);
	void PlaySoundOnLevelChange(int32 PercentLevel);
	void Stealth_Indicator(bool Show);
	void UpdateStealth();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_Stealth_BP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_Stealth_BP_C")
	}
	static class UGA_Stealth_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Stealth_BP_C>();
	}
};
DUMPER7_ASSERTS_UGA_Stealth_BP_C;

}

