#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_TeaseNPC_NewBattleSystem

#include "Basic.hpp"

#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "InventorySystemModule_structs.hpp"
#include "GameDifficultyModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_TeaseNPC_NewBattleSystem.GA_TeaseNPC_NewBattleSystem_C
// 0x0078 (0x04D8 - 0x0460)
class UGA_TeaseNPC_NewBattleSystem_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           Montage_to_Play;                                   // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UNewTeaseActionData_C*                  TeaseActionData;                                   // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTeaseActionMontages                   TeaseMontages;                                     // 0x0478(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UEquipmentComponent*                    Equipment_Component;                               // 0x04C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          SetAggroTease;                                     // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_TeaseNPC_NewBattleSystem(int32 EntryPoint);
	void InitEssentialRefs();
	void K2_ActivateAbility();
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData);
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_12236755435E70CE52F62CB8FC15CFE1(class FName NotifyName);
	void OnCompleted_12236755435E70CE52F62CB8FC15CFE1(class FName NotifyName);
	void OnInterrupted_12236755435E70CE52F62CB8FC15CFE1(class FName NotifyName);
	void OnNotifyBegin_12236755435E70CE52F62CB8FC15CFE1(class FName NotifyName);
	void OnNotifyEnd_12236755435E70CE52F62CB8FC15CFE1(class FName NotifyName);
	void PlayMontage(TSoftObjectPtr<class UAnimMontage> Montage_to_Play_0);
	void SetDebugAIState(EBattleNPCState BattleState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_TeaseNPC_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_TeaseNPC_NewBattleSystem_C")
	}
	static class UGA_TeaseNPC_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_TeaseNPC_NewBattleSystem_C>();
	}
};
DUMPER7_ASSERTS_UGA_TeaseNPC_NewBattleSystem_C;

}

