#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_ThrowStone

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"
#include "AIModule_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "CommonInput_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_ThrowStone.GA_ThrowStone_C
// 0x00E0 (0x0540 - 0x0460)
class UGA_ThrowStone_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class AA_ThrowableStone_C*                    SpawnedStone;                                      // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        ThrowSpeed;                                        // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bDebug;                                            // 0x0480(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputRelease*          Release_Async_Task;                                // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          bStoneThrown;                                      // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        AdditionalAngle;                                   // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bStoneSpawned;                                     // 0x04A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A1[0x7];                                      // 0x04A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                FinalThrowDirection;                               // 0x04A8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitInputActionPressed*    ThrowInputAction;                                  // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class ADefaultCharacter*>              OutlinedCharacters;                                // 0x04C8(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UNiagaraComponent*                      TraceEffect;                                       // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsAiming;                                          // 0x04E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x3];                                      // 0x04E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           NeutralTraceColor;                                 // 0x04E4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           EnemyTraceColor;                                   // 0x04F4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHitCharacter;                                    // 0x0504(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_505[0x3];                                      // 0x0505(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ThrowTargetLocation;                               // 0x0508(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ThrowStartLocation;                                // 0x0520(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ThrowTraceDictance;                                // 0x0538(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InputReleased;                                     // 0x053C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AimTick(double DeltaTime);
	struct FActiveGameplayEffectHandle ApplyEffectToSelf(TSubclassOf<class UGameplayEffect> GameplayEffectClass);
	void CancelThrow();
	void CheckMovement();
	void ExecuteUbergraph_GA_ThrowStone(int32 EntryPoint);
	void GetMontageToPlay(EShootAnimationType Type, class UAnimMontage** Montage);
	void GetStoneClassToSpawn(TSoftClassPtr<class UClass>* StoneClass);
	void GetThrowDirection(struct FVector* Direction);
	void GetThrowRotation(struct FRotator* Rotator);
	void GetThrowStartPoint(struct FVector* Result);
	void GetTraceEnd(struct FVector* Location);
	void HasMovementInput(bool* Result);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnBlendOut_40C0AA354E86BE59DBBCE28E0EB70241(class FName NotifyName);
	void OnBlendOut_7656FD8A42EB0CBD8BD215B4EF3BB86C(class FName NotifyName);
	void OnBlendOut_F56ED76140F61F8CA1ABAE98F4B1D111(class FName NotifyName);
	void OnCompleted_40C0AA354E86BE59DBBCE28E0EB70241(class FName NotifyName);
	void OnCompleted_7656FD8A42EB0CBD8BD215B4EF3BB86C(class FName NotifyName);
	void OnCompleted_F56ED76140F61F8CA1ABAE98F4B1D111(class FName NotifyName);
	void OnInterrupted_40C0AA354E86BE59DBBCE28E0EB70241(class FName NotifyName);
	void OnInterrupted_7656FD8A42EB0CBD8BD215B4EF3BB86C(class FName NotifyName);
	void OnInterrupted_F56ED76140F61F8CA1ABAE98F4B1D111(class FName NotifyName);
	void OnNotifyBegin_40C0AA354E86BE59DBBCE28E0EB70241(class FName NotifyName);
	void OnNotifyBegin_7656FD8A42EB0CBD8BD215B4EF3BB86C(class FName NotifyName);
	void OnNotifyBegin_F56ED76140F61F8CA1ABAE98F4B1D111(class FName NotifyName);
	void OnNotifyEnd_40C0AA354E86BE59DBBCE28E0EB70241(class FName NotifyName);
	void OnNotifyEnd_7656FD8A42EB0CBD8BD215B4EF3BB86C(class FName NotifyName);
	void OnNotifyEnd_F56ED76140F61F8CA1ABAE98F4B1D111(class FName NotifyName);
	void OnNotifyTriggered(class FName Name_0);
	void OnPress_29BF327B4473F0044B8FA1ACC5E6862F(float TimeWaited);
	void OnPress_A817AC7842D350ED80AF50A6FEAE5865(float TimeWaited);
	void OnRelease_21CB34FC45118755AE150986B55666BB(float TimeHeld);
	void OnRelease_E88D8C654004E63EBFA17E870300DAB3(float TimeHeld);
	void OnTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void RotationTick();
	void SetTraceColor();
	void ShiftTrajectory(double Shift, TArray<struct FVector>& Trajectory, TArray<struct FVector>* OutTrajectory);
	void SpawnStoneActor(class UClass* StoneClass);
	void StartAiming();
	void StartThrow();
	void StopAiming();
	void Throw_Stone();
	void Update_Outlined_Characters(TArray<class ADefaultCharacter*>& NewCharacters);
	void UpdatePredictedFallLocation();

	void GetStandingMaterial(EPhysicalSurface* PhysMat) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_ThrowStone_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_ThrowStone_C")
	}
	static class UGA_ThrowStone_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_ThrowStone_C>();
	}
};
DUMPER7_ASSERTS_UGA_ThrowStone_C;

}

