#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_UseHealthPotionNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GA_UseConsumableNPC_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_UseHealthPotionNPC.GA_UseHealthPotionNPC_C
// 0x0030 (0x04A8 - 0x0478)
class UGA_UseHealthPotionNPC_C : public UGA_UseConsumableNPC_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_UseHealthPotionNPC_C;            // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSubclassOf<class UGameplayEffect>            PotionEffect;                                      // 0x0480(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UEquipmentComponent*                    EquipmentComponent;                                // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 ConsumableActor;                                   // 0x0490(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 PotionActor;                                       // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   HiddenWeapon;                                      // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_UseHealthPotionNPC(int32 EntryPoint);
	void GetConsumableType(EEquipmentType* NewParam);
	void GetConsumableUseType(EConsumableUseType* NewParam);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnNotifyBegin(class FName NotifyName);
	void Remember_and_Hide_Weapon(bool UseLeftHand);
	void RemoveConsumableAndShowWeapon();
	void SpawnConsumableActor(bool LeftHand);
	void UseConsumable();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("GA_UseHealthPotionNPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"GA_UseHealthPotionNPC_C")
	}
	static class UGA_UseHealthPotionNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_UseHealthPotionNPC_C>();
	}
};
DUMPER7_ASSERTS_UGA_UseHealthPotionNPC_C;

}

