#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GameDifficultyModule

#include "Basic.hpp"

#include "GameDifficultyModule_structs.hpp"


namespace SDK::Params
{

// Function GameDifficultyModule.GameDifficultyComponent.OnDifficultyChanged
// 0x0001 (0x0001 - 0x0000)
struct GameDifficultyComponent_OnDifficultyChanged final
{
public:
	EGameDifficulty                               NewDifficulty;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameDifficultyComponent_OnDifficultyChanged;

// Function GameDifficultyModule.GameDifficultySubsystem.GetGameDifficulty
// 0x0010 (0x0010 - 0x0000)
struct GameDifficultySubsystem_GetGameDifficulty final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameDifficulty                               ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_GameDifficultySubsystem_GetGameDifficulty;

// Function GameDifficultyModule.GameDifficultySubsystem.CanChangeDifficulty
// 0x0001 (0x0001 - 0x0000)
struct GameDifficultySubsystem_CanChangeDifficulty final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameDifficultySubsystem_CanChangeDifficulty;

// Function GameDifficultyModule.GameDifficultySubsystem.ChangeDifficulty
// 0x0001 (0x0001 - 0x0000)
struct GameDifficultySubsystem_ChangeDifficulty final
{
public:
	EGameDifficulty                               NewDifficulty;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameDifficultySubsystem_ChangeDifficulty;

// Function GameDifficultyModule.GameDifficultySubsystem.GetCurrentDifficulty
// 0x0001 (0x0001 - 0x0000)
struct GameDifficultySubsystem_GetCurrentDifficulty final
{
public:
	EGameDifficulty                               ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GameDifficultySubsystem_GetCurrentDifficulty;

}

