#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HashSHA256

#include "Basic.hpp"

#include "HashSHA256_structs.hpp"


namespace SDK::Params
{

// Function HashSHA256.HashSHA256BPLibrary.FromArray
// 0x0020 (0x0020 - 0x0000)
struct HashSHA256BPLibrary_FromArray final
{
public:
	struct FSHA256Hash                            SHA256;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<uint8>                                 Arr;                                               // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HashSHA256BPLibrary_FromArray;

// Function HashSHA256.HashSHA256BPLibrary.FromFile
// 0x0020 (0x0020 - 0x0000)
struct HashSHA256BPLibrary_FromFile final
{
public:
	struct FSHA256Hash                            SHA256;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Filename;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HashSHA256BPLibrary_FromFile;

// Function HashSHA256.HashSHA256BPLibrary.FromString
// 0x0020 (0x0020 - 0x0000)
struct HashSHA256BPLibrary_FromString final
{
public:
	struct FSHA256Hash                            SHA256;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 Str;                                               // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HashSHA256BPLibrary_FromString;

// Function HashSHA256.HashSHA256BPLibrary.GetHash
// 0x0020 (0x0020 - 0x0000)
struct HashSHA256BPLibrary_GetHash final
{
public:
	struct FSHA256Hash                            SHA256;                                            // 0x0000(0x0010)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HashSHA256BPLibrary_GetHash;

}

