#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: horse_test

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "horse_test_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass horse_test.horse_test_C
// 0x2150 (0x2540 - 0x03F0)
class Uhorse_test_C final : public UFirstPersonAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct horse_test::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                   // 0x03F8(0x00C4)(HasGetValueTypeHash)
	uint8                                         Pad_4BC[0x4];                                      // 0x04BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x04C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x04C8(0x0008)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x04D0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_19;                 // 0x04F0(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x0560(0x00C8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0628(0x00C8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x06F0(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics;                        // 0x0710(0x0520)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C30(0x0020)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0C50(0x00C8)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0D18(0x0048)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x0D60(0x0110)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0E70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x0E98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x0EC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0EE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0F10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0F38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0F60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0F88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0FB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0FD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x1000(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x1028(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x1050(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x1078(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x10A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x10C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x10F0(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x1118(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x1160(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x1180(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x11C8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x11E8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x1230(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_18;                 // 0x1250(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x12C0(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_17;                 // 0x12E0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1350(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1370(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x1398(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_16;                 // 0x13C0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1430(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0x1450(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_15;                 // 0x1518(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_14;                 // 0x1588(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x15F8(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4;                       // 0x1640(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_13;                 // 0x1708(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_12;                 // 0x1778(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x17E8(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1808(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1828(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x18F0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1910(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0x1958(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_11;                 // 0x1A20(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x1A90(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1B00(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x1B48(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x1C10(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x1C80(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1CF0(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x1D38(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x1E00(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x1E70(0x0070)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1EE0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x1FA8(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x2018(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x2088(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x20A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x20D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x20F8(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x2120(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x2190(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x21B0(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x2220(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x2240(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x22B0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x22D0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x2398(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x23B8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x2480(0x0070)()
	bool                                          IsRunning;                                         // 0x24F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24F1[0x7];                                     // 0x24F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        transition_phase;                                  // 0x24F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          start_walk_transition;                             // 0x2500(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2501[0x7];                                     // 0x2501(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        gallop_stop_phase_offset;                          // 0x2508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InTown;                                            // 0x2510(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UnMount;                                           // 0x2511(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2512[0x6];                                     // 0x2512(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnUnMount;                                         // 0x2518(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          UnMountFromBattle;                                 // 0x2528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UnMountFall;                                       // 0x2529(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_252A[0x2];                                     // 0x252A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VertOffset;                                        // 0x252C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Look_Along_Camera;                                 // 0x2530(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_center_05();
	void AnimNotify_center_1();
	void AnimNotify_phase_0();
	void AnimNotify_phase_025();
	void AnimNotify_phase_05();
	void AnimNotify_phase_075();
	void AnimNotify_reset_start_walk_transition();
	void AnimNotify_to_start_transition();
	void AnimNotify_Unmount();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_BlendSpacePlayer_46F537234F6B61166938E7AE57B64980();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_BlendSpacePlayer_4B0E669243200947E0B622B376175FF8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_BlendSpacePlayer_4C29394341D8045EB7C87E99B7FA5DFD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_BlendSpacePlayer_867905BB40277E8E23667C9981171C86();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_BlendSpacePlayer_A590F8DA44EDADAB5A7FB4AFE5E25843();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_BlendSpacePlayer_CD7EA2084D4976737FE786B79567645F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_BlendSpacePlayer_D08C605240D5CBE8B619F5BEF057D230();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_44A8739045864AE7E21A729ABF388829();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_44CB23E746B0EA3BFF0353A0CDB9D9D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_56FDEDC34F0F5EA0C6289E88EDF92A2A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_593503AF420A236A0050789727B63072();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_6366598B4A7814D270C0D3A5B0144C9A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_805C78C34A992E404D08D19F881EF269();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_A7AC136F4DF36C5770388DA8B0A8A06C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_AF97896F49C45CB84628C080898A63C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_B7F49F824E720955055B11B956DC23B5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_C0F25C974F6B2C9BD753B399F3DAFAA2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_CA557B24417FF8588FABAEAB8D7BADAF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_CE72216C4CC5EEC3EBB704A449CB293E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TransitionResult_DBFC84C74CEF04DB3974DDA1B567826F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TwoWayBlend_3BE6B37546FC234D12E9539ABA80F34D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TwoWayBlend_4500A34841E5A8A0B50714A02E916D3E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TwoWayBlend_4902005B41090A7CACA0B580DB2EF0D0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TwoWayBlend_B6B6A3274E229A3EF0D4689320C4AE60();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TwoWayBlend_BE64F5014AB8A5A40FA5A4A8DA0D8FF6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_horse_test_AnimGraphNode_TwoWayBlend_F7E6C85E42D25E31D6E098BB6F7E71C4();
	void ExecuteUbergraph_horse_test(int32 EntryPoint);
	struct FVector2D GetGroundSlopes();
	float GetStartSyncCurveValue();
	float GetSyncCurveValue();
	bool has_input();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("horse_test_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"horse_test_C")
	}
	static class Uhorse_test_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uhorse_test_C>();
	}
};
DUMPER7_ASSERTS_Uhorse_test_C;

}

