#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InteractionSystem

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function InteractionSystem.Interaction.InteractEvent
// 0x0010 (0x0010 - 0x0000)
struct Interaction_InteractEvent final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInteractionComponent*                  InteractComponent;                                 // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Interaction_InteractEvent;

// Function InteractionSystem.InteractionComponent.HandleConditionsUpdated
// 0x0010 (0x0010 - 0x0000)
struct InteractionComponent_HandleConditionsUpdated final
{
public:
	class UInteractionCondition*                  Condition;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InteractionComponent_HandleConditionsUpdated;

// Function InteractionSystem.InteractionComponent.InteractionAreaBeginOverlapResponse
// 0x0108 (0x0108 - 0x0000)
struct InteractionComponent_InteractionAreaBeginOverlapResponse final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_InteractionAreaBeginOverlapResponse;

// Function InteractionSystem.InteractionComponent.InteractionAreaEndOverlapResponse
// 0x0020 (0x0020 - 0x0000)
struct InteractionComponent_InteractionAreaEndOverlapResponse final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InteractionComponent_InteractionAreaEndOverlapResponse;

// Function InteractionSystem.InteractionComponent.LookOnAreaCursorEnter
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_LookOnAreaCursorEnter final
{
public:
	class UPrimitiveComponent*                    TouchedComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_LookOnAreaCursorEnter;

// Function InteractionSystem.InteractionComponent.LookOnAreaCursorLeave
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_LookOnAreaCursorLeave final
{
public:
	class UPrimitiveComponent*                    TouchedComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_LookOnAreaCursorLeave;

// Function InteractionSystem.InteractionComponent.OnInteractionInputHandle
// 0x0020 (0x0020 - 0x0000)
struct InteractionComponent_OnInteractionInputHandle final
{
public:
	struct FInputActionValue                      Value;                                             // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_OnInteractionInputHandle;

// Function InteractionSystem.InteractionComponent.PlayForceFeedbackEffect
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_PlayForceFeedbackEffect final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_PlayForceFeedbackEffect;

// Function InteractionSystem.InteractionComponent.PlayInteractionSound
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_PlayInteractionSound final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_PlayInteractionSound;

// Function InteractionSystem.InteractionComponent.PostInteract
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_PostInteract final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_PostInteract;

// Function InteractionSystem.InteractionComponent.ToggleOutline
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_ToggleOutline final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_ToggleOutline;

// Function InteractionSystem.InteractionComponent.TryInteract
// 0x0008 (0x0008 - 0x0000)
struct InteractionComponent_TryInteract final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_TryInteract;

// Function InteractionSystem.InteractionComponent.IsInteractionAllowed
// 0x0001 (0x0001 - 0x0000)
struct InteractionComponent_IsInteractionAllowed final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionComponent_IsInteractionAllowed;

// Function InteractionSystem.InteractionCondition.ChangeStatus
// 0x0001 (0x0001 - 0x0000)
struct InteractionCondition_ChangeStatus final
{
public:
	bool                                          NewStatus;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCondition_ChangeStatus;

// Function InteractionSystem.InteractionCondition.StartCondition
// 0x0008 (0x0008 - 0x0000)
struct InteractionCondition_StartCondition final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionCondition_StartCondition;

// Function InteractionSystem.InteractionPlayerSubsystem.IsActivated
// 0x0001 (0x0001 - 0x0000)
struct InteractionPlayerSubsystem_IsActivated final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionPlayerSubsystem_IsActivated;

// Function InteractionSystem.InteractionWidget.ShowWidget
// 0x0002 (0x0002 - 0x0000)
struct InteractionWidget_ShowWidget final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInteractIsActive;                                 // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InteractionWidget_ShowWidget;

}

