#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Intuition_GA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Intuition_GA.Intuition_GA_C
// 0x0048 (0x04A8 - 0x0460)
class UIntuition_GA_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APlayer_CH_C*                           PlayerRef;                                         // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               PP_IntuitionMat;                                   // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UAbilityTask_WaitInputPress*>    RunningTasks;                                      // 0x0478(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUserWidget*                            Widget;                                            // 0x0488(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          AbilityUnfold_;                                    // 0x0490(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     TL_Radius;                                         // 0x0498(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         Duration;                                          // 0x04A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_403A599F4BB27DC7E9880494446AD107();
	void Added_A5F7067C4FA6440D90D4E1904ECED0D8();
	void Added_D7887078424CC656681F5FB47CEA527A();
	void ExecuteUbergraph_Intuition_GA(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnPress_C85D215347407CFA74923987E411CDFE(float TimeWaited);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Intuition_GA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Intuition_GA_C")
	}
	static class UIntuition_GA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UIntuition_GA_C>();
	}
};
DUMPER7_ASSERTS_UIntuition_GA_C;

}

