#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: InventorySystemModule

#include "Basic.hpp"

#include "InventorySystemModule_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function InventorySystemModule.ActorsOwnedItem.BP_OnInitialized
// 0x0008 (0x0008 - 0x0000)
struct ActorsOwnedItem_BP_OnInitialized final
{
public:
	class AActor*                                 NewOwner;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorsOwnedItem_BP_OnInitialized;

// Function InventorySystemModule.ActorsOwnedItem.Initialize
// 0x0008 (0x0008 - 0x0000)
struct ActorsOwnedItem_Initialize final
{
public:
	class AActor*                                 NewOwner;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorsOwnedItem_Initialize;

// Function InventorySystemModule.BaseEquipmentSet.CanBeActive
// 0x0001 (0x0001 - 0x0000)
struct BaseEquipmentSet_CanBeActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_CanBeActive;

// Function InventorySystemModule.BaseEquipmentSet.GetAvailableEquipmentItems
// 0x0010 (0x0010 - 0x0000)
struct BaseEquipmentSet_GetAvailableEquipmentItems final
{
public:
	TArray<class UEquipmentItem*>                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_GetAvailableEquipmentItems;

// Function InventorySystemModule.BaseEquipmentSet.GetEquipmentParameters
// 0x0010 (0x0010 - 0x0000)
struct BaseEquipmentSet_GetEquipmentParameters final
{
public:
	struct FEquipmentParameters                   ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_GetEquipmentParameters;

// Function InventorySystemModule.BaseEquipmentSet.GetItemEquipInfo
// 0x0048 (0x0048 - 0x0000)
struct BaseEquipmentSet_GetItemEquipInfo final
{
public:
	EHand                                         Hand;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipInfo                             ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_GetItemEquipInfo;

// Function InventorySystemModule.BaseEquipmentSet.GetAttackDistance
// 0x0004 (0x0004 - 0x0000)
struct BaseEquipmentSet_GetAttackDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_GetAttackDistance;

// Function InventorySystemModule.BaseEquipmentSet.GetEquipmentItem
// 0x0008 (0x0008 - 0x0000)
struct BaseEquipmentSet_GetEquipmentItem final
{
public:
	TSubclassOf<class UEquipmentItem>             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_GetEquipmentItem;

// Function InventorySystemModule.BaseEquipmentSet.GetEquipmentType
// 0x0001 (0x0001 - 0x0000)
struct BaseEquipmentSet_GetEquipmentType final
{
public:
	EEquipmentType                                ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_GetEquipmentType;

// Function InventorySystemModule.BaseEquipmentSet.HasItemInHand
// 0x0002 (0x0002 - 0x0000)
struct BaseEquipmentSet_HasItemInHand final
{
public:
	EHand                                         Hand;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseEquipmentSet_HasItemInHand;

// Function InventorySystemModule.AppearanceItem.SwapItem
// 0x0018 (0x0018 - 0x0000)
struct AppearanceItem_SwapItem final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHand                                         Hand;                                              // 0x0001(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentItem*                         Item;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEquipmentItem*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_SwapItem;

// Function InventorySystemModule.AppearanceItem.GetEquipInfo
// 0x0048 (0x0048 - 0x0000)
struct AppearanceItem_GetEquipInfo final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHand                                         Hand;                                              // 0x0001(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FEquipInfo                             ReturnValue;                                       // 0x0008(0x0040)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_GetEquipInfo;

// Function InventorySystemModule.AppearanceItem.GetEquipInfoMap
// 0x0058 (0x0058 - 0x0000)
struct AppearanceItem_GetEquipInfoMap final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EHand, struct FEquipInfo>                ResultEquipInfoMap;                                // 0x0008(0x0050)(Parm, OutParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_GetEquipInfoMap;

// Function InventorySystemModule.AppearanceItem.GetEquipmentSet
// 0x0010 (0x0010 - 0x0000)
struct AppearanceItem_GetEquipmentSet final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseEquipmentSet*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_GetEquipmentSet;

// Function InventorySystemModule.AppearanceItem.GetEquipmentSetsByClass
// 0x0018 (0x0018 - 0x0000)
struct AppearanceItem_GetEquipmentSetsByClass final
{
public:
	TSubclassOf<class UBaseEquipmentSet>          Class_0;                                           // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UBaseEquipmentSet*>              ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_GetEquipmentSetsByClass;

// Function InventorySystemModule.AppearanceItem.GetItem
// 0x0010 (0x0010 - 0x0000)
struct AppearanceItem_GetItem final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHand                                         Hand;                                              // 0x0001(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentItem*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_GetItem;

// Function InventorySystemModule.AppearanceItem.GetSlotOfEquipmentSet
// 0x0010 (0x0010 - 0x0000)
struct AppearanceItem_GetSlotOfEquipmentSet final
{
public:
	class UBaseEquipmentSet*                      Set;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEquipmentSlotType                            ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AppearanceItem_GetSlotOfEquipmentSet;

// Function InventorySystemModule.AppearanceItem.IsContainSlot
// 0x0002 (0x0002 - 0x0000)
struct AppearanceItem_IsContainSlot final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_IsContainSlot;

// Function InventorySystemModule.AppearanceItem.IsSlotCanBeActive
// 0x0002 (0x0002 - 0x0000)
struct AppearanceItem_IsSlotCanBeActive final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceItem_IsSlotCanBeActive;

// Function InventorySystemModule.EquipmentItem.CanBeEquiped
// 0x0010 (0x0010 - 0x0000)
struct EquipmentItem_CanBeEquiped final
{
public:
	class UInventoryComponent*                    InventoryComponent;                                // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentItem_CanBeEquiped;

// Function InventorySystemModule.EquipmentItem.GetAttributes
// 0x0050 (0x0050 - 0x0000)
struct EquipmentItem_GetAttributes final
{
public:
	TMap<class FString, float>                    ReturnValue;                                       // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentItem_GetAttributes;

// Function InventorySystemModule.ConsumableItem.AddAmount
// 0x0004 (0x0004 - 0x0000)
struct ConsumableItem_AddAmount final
{
public:
	int32                                         AmountToAdd;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConsumableItem_AddAmount;

// Function InventorySystemModule.ConsumableItem.SetCurrentAmount
// 0x0004 (0x0004 - 0x0000)
struct ConsumableItem_SetCurrentAmount final
{
public:
	int32                                         NewAmount;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConsumableItem_SetCurrentAmount;

// Function InventorySystemModule.ConsumableItem.CanUse
// 0x0001 (0x0001 - 0x0000)
struct ConsumableItem_CanUse final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConsumableItem_CanUse;

// Function InventorySystemModule.ConsumableItem.GetCurrentAmount
// 0x0004 (0x0004 - 0x0000)
struct ConsumableItem_GetCurrentAmount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConsumableItem_GetCurrentAmount;

// Function InventorySystemModule.ConsumableItem.GetMaxAmount
// 0x0004 (0x0004 - 0x0000)
struct ConsumableItem_GetMaxAmount final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ConsumableItem_GetMaxAmount;

// Function InventorySystemModule.EquipmentComponent.AddAbilitySlotUsage
// 0x0010 (0x0010 - 0x0000)
struct EquipmentComponent_AddAbilitySlotUsage final
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEquipmentSlotType                            Slot;                                              // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentComponent_AddAbilitySlotUsage;

// Function InventorySystemModule.EquipmentComponent.CanUseOverlapDetection
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_CanUseOverlapDetection final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_CanUseOverlapDetection;

// Function InventorySystemModule.EquipmentComponent.ChangeActiveSlot
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_ChangeActiveSlot final
{
public:
	EEquipmentSlotType                            NewSlot;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_ChangeActiveSlot;

// Function InventorySystemModule.EquipmentComponent.ChangeAppearance
// 0x0010 (0x0010 - 0x0000)
struct EquipmentComponent_ChangeAppearance final
{
public:
	class UAppearanceItem*                        NewAppearance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentComponent_ChangeAppearance;

// Function InventorySystemModule.EquipmentComponent.ChangeOverrideSlot
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_ChangeOverrideSlot final
{
public:
	EEquipmentSlotType                            NewOverrideSlot;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_ChangeOverrideSlot;

// Function InventorySystemModule.EquipmentComponent.ChangeWeaponsVisibility
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_ChangeWeaponsVisibility final
{
public:
	bool                                          NewVisibility;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_ChangeWeaponsVisibility;

// Function InventorySystemModule.EquipmentComponent.ChangeWeaponsVisibilityByHand
// 0x0018 (0x0018 - 0x0000)
struct EquipmentComponent_ChangeWeaponsVisibilityByHand final
{
public:
	TArray<EHand>                                 Hands;                                             // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          NewVisibility;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentComponent_ChangeWeaponsVisibilityByHand;

// Function InventorySystemModule.EquipmentComponent.DoChangeAppearanceInstantly
// 0x0010 (0x0010 - 0x0000)
struct EquipmentComponent_DoChangeAppearanceInstantly final
{
public:
	class UAppearanceItem*                        NewAppearance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentComponent_DoChangeAppearanceInstantly;

// Function InventorySystemModule.EquipmentComponent.DoChangeSlotInstantly
// 0x0002 (0x0002 - 0x0000)
struct EquipmentComponent_DoChangeSlotInstantly final
{
public:
	EEquipmentSlotType                            NewSlot;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_DoChangeSlotInstantly;

// Function InventorySystemModule.EquipmentComponent.GetCurrentActiveAbilitySlot
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_GetCurrentActiveAbilitySlot final
{
public:
	EEquipmentSlotType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetCurrentActiveAbilitySlot;

// Function InventorySystemModule.EquipmentComponent.GetCurrentActiveEquipment
// 0x0008 (0x0008 - 0x0000)
struct EquipmentComponent_GetCurrentActiveEquipment final
{
public:
	class UBaseEquipmentSet*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetCurrentActiveEquipment;

// Function InventorySystemModule.EquipmentComponent.GetCurrentActiveMeleeSlot
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_GetCurrentActiveMeleeSlot final
{
public:
	EEquipmentSlotType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetCurrentActiveMeleeSlot;

// Function InventorySystemModule.EquipmentComponent.GetEffectiveAttackDistance
// 0x0004 (0x0004 - 0x0000)
struct EquipmentComponent_GetEffectiveAttackDistance final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetEffectiveAttackDistance;

// Function InventorySystemModule.EquipmentComponent.GetWeaponMeshComponent
// 0x0010 (0x0010 - 0x0000)
struct EquipmentComponent_GetWeaponMeshComponent final
{
public:
	EHand                                         Hand;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetWeaponMeshComponent;

// Function InventorySystemModule.EquipmentComponent.K2_GrantEquipment
// 0x0018 (0x0018 - 0x0000)
struct EquipmentComponent_K2_GrantEquipment final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentSetInfo*                      Info;                                              // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentComponent_K2_GrantEquipment;

// Function InventorySystemModule.EquipmentComponent.K2_RemoveEquipment
// 0x0002 (0x0002 - 0x0000)
struct EquipmentComponent_K2_RemoveEquipment final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_K2_RemoveEquipment;

// Function InventorySystemModule.EquipmentComponent.LockOnMeleeEquipmentSet
// 0x0008 (0x0008 - 0x0000)
struct EquipmentComponent_LockOnMeleeEquipmentSet final
{
public:
	TSubclassOf<class UMeleeEquipmentSet>         SelectedSet;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_LockOnMeleeEquipmentSet;

// Function InventorySystemModule.EquipmentComponent.OnWeaponBeginOverlap
// 0x0108 (0x0108 - 0x0000)
struct EquipmentComponent_OnWeaponBeginOverlap final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_OnWeaponBeginOverlap;

// Function InventorySystemModule.EquipmentComponent.RemoveAbilitySlotUsage
// 0x0008 (0x0008 - 0x0000)
struct EquipmentComponent_RemoveAbilitySlotUsage final
{
public:
	class UGameplayAbility*                       Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_RemoveAbilitySlotUsage;

// Function InventorySystemModule.EquipmentComponent.SetCurrentAppearance
// 0x0008 (0x0008 - 0x0000)
struct EquipmentComponent_SetCurrentAppearance final
{
public:
	class UAppearanceItem*                        NewAppearance;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_SetCurrentAppearance;

// Function InventorySystemModule.EquipmentComponent.SetOverlapDetection
// 0x0014 (0x0014 - 0x0000)
struct EquipmentComponent_SetOverlapDetection final
{
public:
	bool                                          bShouldDetect;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AActor* OverlapedActor)> Callback;                                          // 0x0004(0x0010)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_SetOverlapDetection;

// Function InventorySystemModule.EquipmentComponent.CollectGameplayDebuggerData
// 0x0010 (0x0010 - 0x0000)
struct EquipmentComponent_CollectGameplayDebuggerData final
{
public:
	TArray<struct FHitResult>                     DebugHitData;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_CollectGameplayDebuggerData;

// Function InventorySystemModule.EquipmentComponent.GetBodyPartTypeByBoneName
// 0x0010 (0x0010 - 0x0000)
struct EquipmentComponent_GetBodyPartTypeByBoneName final
{
public:
	class FName                                   BoneName;                                          // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetBodyPartTypeByBoneName;

// Function InventorySystemModule.EquipmentComponent.GetCharacter
// 0x0008 (0x0008 - 0x0000)
struct EquipmentComponent_GetCharacter final
{
public:
	class ACharacter*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetCharacter;

// Function InventorySystemModule.EquipmentComponent.GetCurrentActiveSlot
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_GetCurrentActiveSlot final
{
public:
	EEquipmentSlotType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetCurrentActiveSlot;

// Function InventorySystemModule.EquipmentComponent.GetCurrentAppearance
// 0x0008 (0x0008 - 0x0000)
struct EquipmentComponent_GetCurrentAppearance final
{
public:
	class UAppearanceItem*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetCurrentAppearance;

// Function InventorySystemModule.EquipmentComponent.GetCurrentEquipmentTypeInHand
// 0x0002 (0x0002 - 0x0000)
struct EquipmentComponent_GetCurrentEquipmentTypeInHand final
{
public:
	EHand                                         Hand;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEquipmentType                                ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetCurrentEquipmentTypeInHand;

// Function InventorySystemModule.EquipmentComponent.GetEquipmentDefenceStyle
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_GetEquipmentDefenceStyle final
{
public:
	EEquipmentDefenceStyle                        ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetEquipmentDefenceStyle;

// Function InventorySystemModule.EquipmentComponent.GetEquipmentHandType
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_GetEquipmentHandType final
{
public:
	EEquipmentHandType                            ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetEquipmentHandType;

// Function InventorySystemModule.EquipmentComponent.GetEquipmentSetsByClass
// 0x0020 (0x0020 - 0x0000)
struct EquipmentComponent_GetEquipmentSetsByClass final
{
public:
	TSubclassOf<class UBaseEquipmentSet>          SlotClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UBaseEquipmentSet*>              OutSets;                                           // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentComponent_GetEquipmentSetsByClass;

// Function InventorySystemModule.EquipmentComponent.GetEquipmentTypeAtSlot
// 0x0003 (0x0003 - 0x0000)
struct EquipmentComponent_GetEquipmentTypeAtSlot final
{
public:
	EEquipmentSlotType                            Slot;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHand                                         Hand;                                              // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEquipmentType                                ReturnValue;                                       // 0x0002(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetEquipmentTypeAtSlot;

// Function InventorySystemModule.EquipmentComponent.GetFirstEquipmentSetByClass
// 0x0010 (0x0010 - 0x0000)
struct EquipmentComponent_GetFirstEquipmentSetByClass final
{
public:
	TSubclassOf<class UBaseEquipmentSet>          SlotClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseEquipmentSet*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetFirstEquipmentSetByClass;

// Function InventorySystemModule.EquipmentComponent.GetIsNeedToShowEquipment
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_GetIsNeedToShowEquipment final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_GetIsNeedToShowEquipment;

// Function InventorySystemModule.EquipmentComponent.IsWeaponVisible
// 0x0001 (0x0001 - 0x0000)
struct EquipmentComponent_IsWeaponVisible final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentComponent_IsWeaponVisible;

// Function InventorySystemModule.InventoryComponent.AddItemToInventory
// 0x0010 (0x0010 - 0x0000)
struct InventoryComponent_AddItemToInventory final
{
public:
	class UBaseInventoryItem*                     Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InventoryComponent_AddItemToInventory;

// Function InventorySystemModule.InventoryComponent.AddItemToInventoryByClass
// 0x0010 (0x0010 - 0x0000)
struct InventoryComponent_AddItemToInventoryByClass final
{
public:
	TSubclassOf<class UBaseInventoryItem>         ItemClass;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseInventoryItem*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryComponent_AddItemToInventoryByClass;

// Function InventorySystemModule.InventoryComponent.ChangeMoneyValue
// 0x0008 (0x0008 - 0x0000)
struct InventoryComponent_ChangeMoneyValue final
{
public:
	int32                                         Value;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InventoryComponent_ChangeMoneyValue;

// Function InventorySystemModule.InventoryComponent.GetEquipmentItemsOfType
// 0x0020 (0x0020 - 0x0000)
struct InventoryComponent_GetEquipmentItemsOfType final
{
public:
	TSubclassOf<class UEquipmentItem>             Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAvailableInImagery                           Availability;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEquipmentType                                Type;                                              // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UEquipmentItem*>                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryComponent_GetEquipmentItemsOfType;

// Function InventorySystemModule.InventoryComponent.GetInventoryItemsOfType
// 0x0018 (0x0018 - 0x0000)
struct InventoryComponent_GetInventoryItemsOfType final
{
public:
	TSubclassOf<class UBaseInventoryItem>         Type;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UBaseInventoryItem*>             ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryComponent_GetInventoryItemsOfType;

// Function InventorySystemModule.InventoryComponent.GetMoneyValue
// 0x0004 (0x0004 - 0x0000)
struct InventoryComponent_GetMoneyValue final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryComponent_GetMoneyValue;

// Function InventorySystemModule.InventoryComponent.RemoveItemFromInventory
// 0x0010 (0x0010 - 0x0000)
struct InventoryComponent_RemoveItemFromInventory final
{
public:
	class UBaseInventoryItem*                     Item;                                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_InventoryComponent_RemoveItemFromInventory;

// Function InventorySystemModule.InventoryComponent.SetInventoryItems
// 0x0010 (0x0010 - 0x0000)
struct InventoryComponent_SetInventoryItems final
{
public:
	TArray<class UBaseInventoryItem*>             NewInventoryItems;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryComponent_SetInventoryItems;

// Function InventorySystemModule.InventoryComponent.SwapInventoryItems
// 0x0020 (0x0020 - 0x0000)
struct InventoryComponent_SwapInventoryItems final
{
public:
	TArray<class UBaseInventoryItem*>             NewInventoryItems;                                 // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class UBaseInventoryItem*>             ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryComponent_SwapInventoryItems;

// Function InventorySystemModule.InventoryComponent.GetInventoryItems
// 0x0010 (0x0010 - 0x0000)
struct InventoryComponent_GetInventoryItems final
{
public:
	TArray<class UBaseInventoryItem*>             ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_InventoryComponent_GetInventoryItems;

// Function InventorySystemModule.RangeEquipmentSet.GetActiveRangeWeapon
// 0x0008 (0x0008 - 0x0000)
struct RangeEquipmentSet_GetActiveRangeWeapon final
{
public:
	class URangeWeaponItem*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RangeEquipmentSet_GetActiveRangeWeapon;

// Function InventorySystemModule.RangeEquipmentSet.SetActiveRangeWeaponIndex
// 0x0004 (0x0004 - 0x0000)
struct RangeEquipmentSet_SetActiveRangeWeaponIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RangeEquipmentSet_SetActiveRangeWeaponIndex;

// Function InventorySystemModule.RangeEquipmentSet.GetActiveRangeWeaponIndex
// 0x0004 (0x0004 - 0x0000)
struct RangeEquipmentSet_GetActiveRangeWeaponIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RangeEquipmentSet_GetActiveRangeWeaponIndex;

}

