#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LightAttack_GA

#include "Basic.hpp"

#include "EComboAttack_structs.hpp"
#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "AIModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass LightAttack_GA.LightAttack_GA_C
// 0x0088 (0x04E8 - 0x0460)
class ULightAttack_GA_C : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAnimMontage*                           AttackMontage;                                     // 0x0468(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSet<class AActor*>                           DamagedActors;                                     // 0x0470(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class UAbilityTask_Repeat*                    DamageTickTask;                                    // 0x04C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         AttackDistance;                                    // 0x04C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AttackSphereRadius;                                // 0x04CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EComboAttack                                  AttackType;                                        // 0x04D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          DebugMode;                                         // 0x04D1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             AttackingActor;                                    // 0x04D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        AttackDamage;                                      // 0x04E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CalculateDamage();
	void EventReceived_5566CE874C25F3CB341810919BE0401A(const struct FGameplayEventData& Payload);
	void EventReceived_5B9CA7524CF057C0C59D8698F032F97C(const struct FGameplayEventData& Payload);
	void EventReceived_895FFBE5411CC02E9566938F0B3293CA(const struct FGameplayEventData& Payload);
	void EventReceived_DD6C219A48DA9658867D128C6ACE4AFD(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_LightAttack_GA(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnFinished_801439844CD2437C0E4213BA657D81FD(int32 ActionNumber);
	void OnPerformAction_801439844CD2437C0E4213BA657D81FD(int32 ActionNumber);

	float GetCostValue() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LightAttack_GA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LightAttack_GA_C")
	}
	static class ULightAttack_GA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULightAttack_GA_C>();
	}
};
DUMPER7_ASSERTS_ULightAttack_GA_C;

}

