#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: LoadLevelButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LoadLevelButton.LoadLevelButton_C
// 0x0078 (0x0338 - 0x02C0)
class ULoadLevelButton_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_0;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_78;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                 LevelName;                                         // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	TMap<class FString, class FText>              LevelMap;                                          // 0x02E8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BndEvt__LoadLevelButton_Button_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void ExecuteUbergraph_LoadLevelButton(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("LoadLevelButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"LoadLevelButton_C")
	}
	static class ULoadLevelButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULoadLevelButton_C>();
	}
};
DUMPER7_ASSERTS_ULoadLevelButton_C;

}

