#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MainPlayerController_PC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayAbilities_structs.hpp"
#include "E_HUDStates_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass MainPlayerController_PC.MainPlayerController_PC_C
// 0x0078 (0x0918 - 0x08A0)
class AMainPlayerController_PC_C : public AMainPlayerController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class FString, int32>                    inkGlobal;                                         // 0x08A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         ConsumableID;                                      // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBattle;                                          // 0x08FC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8FD[0x3];                                      // 0x08FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           OnDeathTimerHandle;                                // 0x0900(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         DeathScreenDelay;                                  // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            PauseEffectHandle;                                 // 0x090C(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void CheckCons(int32 ID, bool* CanUse);
	void ExecuteUbergraph_MainPlayerController_PC(int32 EntryPoint);
	class UCommonActivatableWidget* GetCurrentActiveMenu();
	void InpActEvt_IA_MiniMapZoom_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_OpenCodexMenu_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_OpenGlobalMap_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_OpenPauseMenu_K2Node_EnhancedInputActionEvent_10(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_OpenQuestLog_K2Node_EnhancedInputActionEvent_9(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_OpenSkillTree_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_OpenTabMenu_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_ShowHUD_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_ToggleShowMinimap_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UseConsumable1_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_UseConsumable2_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void LoadPauseMenu(bool IsPaused);
	void LoadTabMenu(bool Show);
	void ManageAfterDialogueInputs();
	void OnChangeBattleState(bool InBattle_0);
	void OnDeath();
	void OnRangeAttackCooldown(bool Start);
	void ReceivePossess(class APawn* PossessedPawn);
	void Show_Demo_Endgame();
	void TagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("MainPlayerController_PC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MainPlayerController_PC_C")
	}
	static class AMainPlayerController_PC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMainPlayerController_PC_C>();
	}
};
DUMPER7_ASSERTS_AMainPlayerController_PC_C;

}

