#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Map_in_2D

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Map_in_2D.Map_in_2D_C
// 0x0078 (0x0348 - 0x02D0)
class AMap_in_2D_C final : public AWorldMapBorderActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USplineComponent*                       Spline;                                            // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneCaptureComponent2D*               SceneCaptureComponent2D;                           // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             MapImage;                                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              sizeMap;                                           // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           refreshRender_Handle;                              // 0x0308(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        MapRotation;                                       // 0x0310(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              MapOrientation;                                    // 0x0318(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 MapName;                                           // 0x0328(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	double                                        XSizeMap;                                          // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoPositionXY;                                    // 0x0340(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoPositionInvertX;                               // 0x0341(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoPositionInvertY;                               // 0x0342(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InvertX;                                           // 0x0343(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          AutoPositionSwapXY;                                // 0x0344(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void CaptureMapToTextures();
	void Convert_Location_World_to_Map(const struct FVector& WorldLocation, struct FVector2D* MapLocation);
	void ConvertAxisToOrientation(const struct FVector2D& Vector, struct FVector2D* Result);
	void ExecuteUbergraph_Map_in_2D(int32 EntryPoint);
	struct FVector Get_Center();
	struct FVector Get_Correct_Left_Top_Point();
	void Get_Size_Map(struct FVector2D* sizeMap_0);
	void GetDiagonalPoints(struct FVector* Point1, struct FVector* Point2);
	void GetImage(class UTexture2D** MapImage_0);
	void GetMapOrientationVector(struct FVector2D* Orientation);
	void GetMapRotation(double* Rotation);
	struct FVector2D GetMapSize();
	void OnLoaded_9AF0DA9D4C20660E1E4C8D8610508386(class UObject* Loaded);
	void ReceiveBeginPlay();
	void refreshRender();
	void ResizeRenderTarget();
	void SetCaptureCameraToCenter();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Map_in_2D_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Map_in_2D_C")
	}
	static class AMap_in_2D_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMap_in_2D_C>();
	}
};
DUMPER7_ASSERTS_AMap_in_2D_C;

}

