#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MasterHttpRequest

#include "Basic.hpp"


namespace SDK
{

// Enum MasterHttpRequest.E_RequestType_CPP
// NumValues: 0x0006
enum class E_RequestType_CPP : uint8
{
	GET                                      = 0,
	POST                                     = 1,
	PUT                                      = 2,
	DELETE_0                                 = 3,
	PATCH                                    = 4,
	E_RequestType_MAX                        = 5,
};

// ScriptStruct MasterHttpRequest.ResponseData
// 0x0030 (0x0030 - 0x0000)
struct FResponseData final
{
public:
	bool                                          bSuccess;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Data;                                              // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         StatusCode;                                        // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ErrorMessage;                                      // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FResponseData;

// ScriptStruct MasterHttpRequest.KeyValuePair
// 0x0020 (0x0020 - 0x0000)
struct FKeyValuePair final
{
public:
	class FString                                 Key;                                               // 0x0000(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Value;                                             // 0x0010(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FKeyValuePair;

// ScriptStruct MasterHttpRequest.NestedJson
// 0x0038 (0x0038 - 0x0000)
struct FNestedJson final
{
public:
	struct FKeyValuePair                          KeyValuePair;                                      // 0x0000(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                          bIsNested;                                         // 0x0020(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 NestedKey;                                         // 0x0028(0x0010)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FNestedJson;

}

