#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MediaFrameworkUtilities

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "OpenCVLensDistortion_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "TimeManagement_classes.hpp"
#include "MediaIOCore_classes.hpp"
#include "MediaAssets_classes.hpp"


namespace SDK
{

// Class MediaFrameworkUtilities.MediaBundle
// 0x00F0 (0x0118 - 0x0028)
class UMediaBundle final : public UObject
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0028(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoClear, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLoopMediaSource;                                  // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReopenSourceOnError;                              // 0x0031(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaPlayer*                           MediaPlayer;                                       // 0x0038(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMediaTexture*                          MediaTexture;                                      // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                     Material;                                          // 0x0048(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FOpenCVLensDistortionParameters        LensParameters;                                    // 0x0050(0x0048)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FOpenCVCameraViewInfo                  UndistortedCameraViewInfo;                         // 0x0098(0x000C)(Edit, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FOpenCVLensDistortionParameters        CurrentLensParameters;                             // 0x00A8(0x0048)(Transient, NonTransactional, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UTextureRenderTarget2D*                 LensDisplacementMap;                               // 0x00F0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ReferenceCount;                                    // 0x00F8(0x0004)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, EditConst, DuplicateTransient, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_FC[0x1C];                                      // 0x00FC(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UTextureRenderTarget2D* GetLensDisplacementTexture();
	class UMaterialInterface* GetMaterial();
	class UMediaPlayer* GetMediaPlayer();
	class UMediaSource* GetMediaSource();
	class UMediaTexture* GetMediaTexture();
	struct FOpenCVCameraViewInfo GetUndistortedCameraViewInfo();
	void OnMediaClosed();
	void OnMediaOpenFailed(const class FString& DeviceUrl);
	void OnMediaOpenOpened(const class FString& DeviceUrl);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaBundle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaBundle")
	}
	static class UMediaBundle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaBundle>();
	}
};
DUMPER7_ASSERTS_UMediaBundle;

// Class MediaFrameworkUtilities.MediaBundleActorBase
// 0x0040 (0x02D8 - 0x0298)
class AMediaBundleActorBase final : public AActor
{
public:
	class UTextureRenderTarget2D*                 GarbageMatteMask;                                  // 0x0298(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaBundle*                           MediaBundle;                                       // 0x02A0(0x0008)(Edit, ZeroConstructor, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAutoPlay;                                         // 0x02A8(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPlayWhileEditing;                                 // 0x02A9(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2AA[0x6];                                      // 0x02AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    PrimitiveCmp;                                      // 0x02B0(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMediaSoundComponent*                   MediaSoundCmp;                                     // 0x02B8(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoClear, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*               Material;                                          // 0x02C0(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         PrimitiveMaterialIndex;                            // 0x02C8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2CC[0xC];                                      // 0x02CC(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class UMediaBundle* GetMediaBundle();
	void RequestCloseMediaSource();
	bool RequestOpenMediaSource();
	void SetComponent(class UPrimitiveComponent* InPrimitive, class UMediaSoundComponent* InMediaSound);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaBundleActorBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaBundleActorBase")
	}
	static class AMediaBundleActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMediaBundleActorBase>();
	}
};
DUMPER7_ASSERTS_AMediaBundleActorBase;

// Class MediaFrameworkUtilities.MediaBundleTimeSynchronizationSource
// 0x0030 (0x0060 - 0x0030)
class UMediaBundleTimeSynchronizationSource final : public UTimeSynchronizationSource
{
public:
	class UMediaBundle*                           MediaBundle;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_38[0x28];                                      // 0x0038(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaBundleTimeSynchronizationSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaBundleTimeSynchronizationSource")
	}
	static class UMediaBundleTimeSynchronizationSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaBundleTimeSynchronizationSource>();
	}
};
DUMPER7_ASSERTS_UMediaBundleTimeSynchronizationSource;

// Class MediaFrameworkUtilities.MediaPlayerTimeSynchronizationSource
// 0x0038 (0x0068 - 0x0030)
class UMediaPlayerTimeSynchronizationSource final : public UTimeSynchronizationSource
{
public:
	class UMediaSource*                           MediaSource;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMediaTexture*                          MediaTexture;                                      // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x28];                                      // 0x0040(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaPlayerTimeSynchronizationSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaPlayerTimeSynchronizationSource")
	}
	static class UMediaPlayerTimeSynchronizationSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaPlayerTimeSynchronizationSource>();
	}
};
DUMPER7_ASSERTS_UMediaPlayerTimeSynchronizationSource;

// Class MediaFrameworkUtilities.MediaProfile
// 0x0070 (0x0098 - 0x0028)
class UMediaProfile final : public UObject
{
public:
	TArray<class UMediaSource*>                   MediaSources;                                      // 0x0028(0x0010)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<class UMediaOutput*>                   MediaOutputs;                                      // 0x0038(0x0010)(Edit, ExportObject, EditFixedSize, ZeroConstructor, ContainsInstancedReference, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                          bOverrideTimecodeProvider;                         // 0x0048(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimecodeProvider*                      TimecodeProvider;                                  // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOverrideCustomTimeStep;                           // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UEngineCustomTimeStep*                  CustomTimeStep;                                    // 0x0060(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_68[0x8];                                       // 0x0068(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimecodeProvider*                      AppliedTimecodeProvider;                           // 0x0070(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTimecodeProvider*                      PreviousTimecodeProvider;                          // 0x0078(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_80[0x8];                                       // 0x0080(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UEngineCustomTimeStep*                  AppliedCustomTimeStep;                             // 0x0088(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UEngineCustomTimeStep*                  PreviousCustomTimeStep;                            // 0x0090(0x0008)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaProfile")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaProfile")
	}
	static class UMediaProfile* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaProfile>();
	}
};
DUMPER7_ASSERTS_UMediaProfile;

// Class MediaFrameworkUtilities.MediaProfileBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UMediaProfileBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static TArray<class UProxyMediaOutput*> GetAllMediaOutputProxy();
	static TArray<class UProxyMediaSource*> GetAllMediaSourceProxy();
	static class UMediaProfile* GetMediaProfile();
	static void SetMediaProfile(class UMediaProfile* MediaProfile);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaProfileBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaProfileBlueprintLibrary")
	}
	static class UMediaProfileBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaProfileBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UMediaProfileBlueprintLibrary;

// Class MediaFrameworkUtilities.MediaProfileSettings
// 0x0050 (0x0078 - 0x0028)
class UMediaProfileSettings final : public UObject
{
public:
	bool                                          bApplyInCommandlet;                                // 0x0028(0x0001)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class UProxyMediaSource>> MediaSourceProxy;                                // 0x0030(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TSoftObjectPtr<class UProxyMediaOutput>> MediaOutputProxy;                                // 0x0040(0x0010)(Edit, ZeroConstructor, Config, AdvancedDisplay, UObjectWrapper, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMediaProfile>           StartupMediaProfile;                               // 0x0050(0x0028)(Edit, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaProfileSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaProfileSettings")
	}
	static class UMediaProfileSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaProfileSettings>();
	}
};
DUMPER7_ASSERTS_UMediaProfileSettings;

// Class MediaFrameworkUtilities.MediaProfileEditorSettings
// 0x0000 (0x0028 - 0x0028)
class UMediaProfileEditorSettings final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MediaProfileEditorSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MediaProfileEditorSettings")
	}
	static class UMediaProfileEditorSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMediaProfileEditorSettings>();
	}
};
DUMPER7_ASSERTS_UMediaProfileEditorSettings;

// Class MediaFrameworkUtilities.ProxyMediaOutput
// 0x0018 (0x0048 - 0x0030)
class UProxyMediaOutput final : public UMediaOutput
{
public:
	class UMediaOutput*                           DynamicProxy;                                      // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaOutput*                           Proxy;                                             // 0x0038(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_40[0x8];                                       // 0x0040(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsProxyValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProxyMediaOutput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProxyMediaOutput")
	}
	static class UProxyMediaOutput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyMediaOutput>();
	}
};
DUMPER7_ASSERTS_UProxyMediaOutput;

// Class MediaFrameworkUtilities.ProxyMediaSource
// 0x0018 (0x0098 - 0x0080)
class UProxyMediaSource final : public UMediaSource
{
public:
	class UMediaSource*                           DynamicProxy;                                      // 0x0080(0x0008)(ZeroConstructor, Transient, DuplicateTransient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMediaSource*                           Proxy;                                             // 0x0088(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsProxyValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ProxyMediaSource")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ProxyMediaSource")
	}
	static class UProxyMediaSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<UProxyMediaSource>();
	}
};
DUMPER7_ASSERTS_UProxyMediaSource;

}

