#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCaptureData

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "MetaHumanCaptureData_structs.hpp"


namespace SDK
{

// Class MetaHumanCaptureData.CaptureData
// 0x0018 (0x0040 - 0x0028)
class UCaptureData : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CaptureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CaptureData")
	}
	static class UCaptureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCaptureData>();
	}
};
DUMPER7_ASSERTS_UCaptureData;

// Class MetaHumanCaptureData.MeshCaptureData
// 0x0008 (0x0048 - 0x0040)
class UMeshCaptureData final : public UCaptureData
{
public:
	class UObject*                                TargetMesh;                                        // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MeshCaptureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MeshCaptureData")
	}
	static class UMeshCaptureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMeshCaptureData>();
	}
};
DUMPER7_ASSERTS_UMeshCaptureData;

// Class MetaHumanCaptureData.FootageCaptureData
// 0x0068 (0x00A8 - 0x0040)
class UFootageCaptureData final : public UCaptureData
{
public:
	TArray<struct FFootageCaptureView>            Views;                                             // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class USoundWave*                             Audio;                                             // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAudioTimecodePresent;                             // 0x0058(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimecode                              AudioTimecode;                                     // 0x005C(0x0014)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             AudioTimecodeRate;                                 // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanCameraCalibration*            CameraCalibration;                                 // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFootageCaptureMetadata                MetaData;                                          // 0x0080(0x0028)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("FootageCaptureData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"FootageCaptureData")
	}
	static class UFootageCaptureData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UFootageCaptureData>();
	}
};
DUMPER7_ASSERTS_UFootageCaptureData;

}

