#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCore

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "LiveLinkInterface_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Enum MetaHumanCore.EFrameAnimationQuality
// NumValues: 0x0005
enum class EFrameAnimationQuality : uint8
{
	Undefined                                = 0,
	Preview                                  = 1,
	Final                                    = 2,
	PostFiltered                             = 3,
	EFrameAnimationQuality_MAX               = 4,
};

// Enum MetaHumanCore.EMetaHumanLiveLinkSensorOrientation
// NumValues: 0x0006
enum class EMetaHumanLiveLinkSensorOrientation : uint8
{
	Unknown                                  = 0,
	Portrait                                 = 1,
	PortraitUpsideDown                       = 2,
	LandscapeRight                           = 3,
	LandscapeLeft                            = 4,
	EMetaHumanLiveLinkSensorOrientation_MAX  = 5,
};

// Enum MetaHumanCore.EABImageViewMode
// NumValues: 0x0007
enum class EABImageViewMode : uint32
{
	A                                        = 0,
	B                                        = 1,
	ABSplit                                  = 2,
	ABSide                                   = 3,
	Current                                  = 4,
	Any                                      = 5,
	EABImageViewMode_MAX                     = 6,
};

// Enum MetaHumanCore.EABImageNavigationMode
// NumValues: 0x0003
enum class EABImageNavigationMode : uint8
{
	ThreeD                                   = 0,
	TwoD                                     = 1,
	EABImageNavigationMode_MAX               = 2,
};

// Enum MetaHumanCore.EABImageMouseSide
// NumValues: 0x0004
enum class EABImageMouseSide : uint8
{
	NotApplicable                            = 0,
	A                                        = 1,
	B                                        = 2,
	EABImageMouseSide_MAX                    = 3,
};

// ScriptStruct MetaHumanCore.DepthMapDiagnosticsResult
// 0x000C (0x000C - 0x0000)
struct FDepthMapDiagnosticsResult final
{
public:
	int32                                         NumFacePixels;                                     // 0x0000(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NumFaceValidDepthMapPixels;                        // 0x0004(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FaceWidthInPixels;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDepthMapDiagnosticsResult;

// ScriptStruct MetaHumanCore.MeshData
// 0x0040 (0x0040 - 0x0000)
struct FMeshData final
{
public:
	TArray<float>                                 FaceMeshVertData;                                  // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 TeethMeshVertData;                                 // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 LeftEyeMeshVertData;                               // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 RightEyeMeshVertData;                              // 0x0030(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMeshData;

// ScriptStruct MetaHumanCore.FrameAnimationData
// 0x0160 (0x0160 - 0x0000)
struct FFrameAnimationData final
{
public:
	struct FTransform                             Pose;                                              // 0x0000(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 RawPoseData;                                       // 0x0060(0x0010)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TMap<class FString, float>                    AnimationData;                                     // 0x0070(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FString, float>                    RawAnimationData;                                  // 0x00C0(0x0050)(Transient, NativeAccessSpecifierPublic)
	struct FMeshData                              MeshData;                                          // 0x0110(0x0040)(Transient, NativeAccessSpecifierPublic)
	EFrameAnimationQuality                        AnimationQuality;                                  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_151[0xF];                                      // 0x0151(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FFrameAnimationData;

// ScriptStruct MetaHumanCore.FrameTrackingConfidenceData
// 0x0008 (0x0008 - 0x0000)
struct FFrameTrackingConfidenceData final
{
public:
	double                                        Value;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFrameTrackingConfidenceData;

// ScriptStruct MetaHumanCore.MarkerCurveState
// 0x0003 (0x0003 - 0x0000)
struct FMarkerCurveState final
{
public:
	bool                                          bVisible;                                          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActive;                                           // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSelected;                                         // 0x0002(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMarkerCurveState;

// ScriptStruct MetaHumanCore.TrackingContour
// 0x0048 (0x0048 - 0x0000)
struct FTrackingContour final
{
public:
	TArray<struct FVector2D>                      DensePoints;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 DensePointsConfidence;                             // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                 StartPointName;                                    // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EndPointName;                                      // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMarkerCurveState                      State;                                             // 0x0040(0x0003)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_43[0x5];                                       // 0x0043(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FTrackingContour;

// ScriptStruct MetaHumanCore.FrameTrackingContourData
// 0x0060 (0x0060 - 0x0000)
struct FFrameTrackingContourData final
{
public:
	class FString                                 Camera;                                            // 0x0000(0x0010)(Edit, EditFixedSize, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FTrackingContour>  TrackingContours;                                  // 0x0010(0x0050)(Edit, EditFixedSize, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FFrameTrackingContourData;

// ScriptStruct MetaHumanCore.TrackingContour3D
// 0x0010 (0x0010 - 0x0000)
struct FTrackingContour3D final
{
public:
	TArray<struct FVector3d>                      DensePoints;                                       // 0x0000(0x0010)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTrackingContour3D;

// ScriptStruct MetaHumanCore.Dimensions
// 0x0008 (0x0008 - 0x0000)
struct FDimensions final
{
public:
	int32                                         Width;                                             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FDimensions;

// ScriptStruct MetaHumanCore.LiveLinkFaceCalibrationData
// 0x0080 (0x0080 - 0x0000)
struct FLiveLinkFaceCalibrationData final
{
public:
	class FString                                 Version;                                           // 0x0000(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 DeviceModel;                                       // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDimensions                            VideoDimensions;                                   // 0x0020(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	struct FDimensions                            DepthDimensions;                                   // 0x0028(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              LensDistortionCenter;                              // 0x0030(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<double>                                IntrinsicMatrix;                                   // 0x0040(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                LensDistortionLookupTable;                         // 0x0050(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<double>                                InverseLensDistortionLookupTable;                  // 0x0060(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	double                                        PixelSize;                                         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDimensions                            IntrinsicMatrixReferenceDimensions;                // 0x0078(0x0008)(NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FLiveLinkFaceCalibrationData;

// ScriptStruct MetaHumanCore.ExtendedLensFile
// 0x0020 (0x0020 - 0x0000)
struct FExtendedLensFile final
{
public:
	class FString                                 Name;                                              // 0x0000(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsDepthCamera;                                     // 0x0010(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULensFile*                              LensFile;                                          // 0x0018(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FExtendedLensFile;

// ScriptStruct MetaHumanCore.StereoPair
// 0x0008 (0x0008 - 0x0000)
struct FStereoPair final
{
public:
	uint32                                        CameraIndex1;                                      // 0x0000(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CameraIndex2;                                      // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStereoPair;

// ScriptStruct MetaHumanCore.ControlVertex
// 0x0038 (0x0038 - 0x0000)
struct FControlVertex final
{
public:
	struct FVector2D                              PointPosition;                                     // 0x0000(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      LinePoints;                                        // 0x0010(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         CurveNames;                                        // 0x0020(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         PointId;                                           // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsSinglePointCurve;                               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FControlVertex;

// ScriptStruct MetaHumanCore.ReducedContour
// 0x0010 (0x0010 - 0x0000)
struct FReducedContour final
{
public:
	TArray<struct FControlVertex>                 ControlVertices;                                   // 0x0000(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FReducedContour;

// ScriptStruct MetaHumanCore.MetaHumanLiveLinkPipelineTimingData
// 0x0050 (0x0050 - 0x0000)
struct FMetaHumanLiveLinkPipelineTimingData final
{
public:
	TMap<class FString, double>                   Times;                                             // 0x0000(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaHumanLiveLinkPipelineTimingData;

// ScriptStruct MetaHumanCore.MetaHumanLiveLinkFrameData
// 0x0210 (0x02B0 - 0x00A0)
struct FMetaHumanLiveLinkFrameData final : public FLiveLinkBaseFrameData
{
public:
	int32                                         CompressedVideoBytes;                              // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompressedDepthBytes;                              // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AudioSamples;                                      // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<uint8>                                 CompressedVideoData;                               // 0x00B0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 DecompressedVideoData;                             // 0x00C0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                 CompressedDepthData;                               // 0x00D0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 DecompressedDepthData;                             // 0x00E0(0x0010)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int16>                                 AudioData;                                         // 0x00F0(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FFrameTrackingContourData              ContourData;                                       // 0x0100(0x0060)(NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0160(0x0060)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReadStartTime;                                     // 0x01C0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ReadEndTime;                                       // 0x01C8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ProcessStartTime;                                  // 0x01D0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        ProcessEndTime;                                    // 0x01D8(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaHumanLiveLinkPipelineTimingData   PipelineTimingData;                                // 0x01E0(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	double                                        BlueprintArrivalTime;                              // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NetworkQueueSize;                                  // 0x0238(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LoadNodeQueueSize;                                 // 0x023C(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bProcessFrame;                                     // 0x0240(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        InstantaneousProcessedFrameRate;                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AverageProcessedFrameRate;                         // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaximumProcessedFrameRate;                         // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinimumProcessedFrameRate;                         // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InstantaneousUpdateFrameRate;                      // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AverageUpdateFrameRate;                            // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaximumUpdateFrameRate;                            // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinimumUpdateFrameRate;                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        InstantaneousLatency;                              // 0x0288(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        AverageLatency;                                    // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MaximumLatency;                                    // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	double                                        MinimumLatency;                                    // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A8[0x8];                                      // 0x02A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMetaHumanLiveLinkFrameData;

// ScriptStruct MetaHumanCore.MetaHumanLiveLinkStaticData
// 0x0058 (0x0068 - 0x0010)
struct FMetaHumanLiveLinkStaticData final : public FLiveLinkBaseStaticData
{
public:
	struct FFrameRate                             VideoFrameRate;                                    // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompressedVideoWidth;                              // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompressedVideoHeight;                             // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DecompressedVideoWidth;                            // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DecompressedVideoHeight;                           // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FFrameRate                             DepthFrameRate;                                    // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompressedDepthWidth;                              // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         CompressedDepthHeight;                             // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DecompressedDepthWidth;                            // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DecompressedDepthHeight;                           // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SampleRate;                                        // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         AudioChannels;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EMetaHumanLiveLinkSensorOrientation           SensorOrientation;                                 // 0x0048(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x17];                                      // 0x0049(0x0017)(Fixing Size After Last Property [ Dumper-7 ])
	class USkeletalMesh*                          RealtimePerformerMesh;                             // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaHumanLiveLinkStaticData;

// ScriptStruct MetaHumanCore.MetaHumanLiveLinkBlueprintData
// 0x0318 (0x0320 - 0x0008)
struct FMetaHumanLiveLinkBlueprintData final : public FLiveLinkBaseBlueprintData
{
public:
	struct FMetaHumanLiveLinkStaticData           StaticData;                                        // 0x0008(0x0068)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMetaHumanLiveLinkFrameData            FrameData;                                         // 0x0070(0x02B0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaHumanLiveLinkBlueprintData;

// ScriptStruct MetaHumanCore.TrackerOpticalFlowConfiguration
// 0x0003 (0x0003 - 0x0000)
struct FTrackerOpticalFlowConfiguration final
{
public:
	bool                                          bUseOpticalFlow;                                   // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseConfidence;                                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseForwardFlow;                                   // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FTrackerOpticalFlowConfiguration;

// ScriptStruct MetaHumanCore.MetaHumanViewportState
// 0x0008 (0x0008 - 0x0000)
struct FMetaHumanViewportState final
{
public:
	uint8                                         bShowCurves : 1;                                   // 0x0000(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowControlVertices : 1;                          // 0x0000(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowSkeletalMesh : 1;                             // 0x0000(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowFootage : 1;                                  // 0x0000(0x0001)(BitIndex: 0x03, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowDepthMesh : 1;                                // 0x0000(0x0001)(BitIndex: 0x04, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShowUndistorted : 1;                              // 0x0000(0x0001)(BitIndex: 0x05, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	EViewModeIndex                                ViewModeIndex;                                     // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FixedEV100;                                        // 0x0004(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMetaHumanViewportState;

// ScriptStruct MetaHumanCore.MetaHumanViewportCameraState
// 0x0058 (0x0058 - 0x0000)
struct FMetaHumanViewportCameraState final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x0018(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LookAt;                                            // 0x0030(0x0018)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ViewFOV;                                           // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SpeedSetting;                                      // 0x004C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SpeedScalar;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMetaHumanViewportCameraState;

}

