#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanFaceAnimationSolver

#include "Basic.hpp"

#include "MetaHumanFaceAnimationSolver_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MetaHumanFaceAnimationSolver.MetaHumanFaceAnimationSolver
// 0x0038 (0x0060 - 0x0028)
class UMetaHumanFaceAnimationSolver final : public UObject
{
public:
	bool                                          bOverrideDeviceConfig;                             // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetaHumanConfig*                       DeviceConfig;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideDepthMapInfluence;                        // 0x0038(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDepthMapInfluenceValue                       DepthMapInfluence;                                 // 0x0039(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideEyeSolveSmoothness;                       // 0x003A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B[0x1];                                       // 0x003B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EyeSolveSmoothness;                                // 0x003C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideTeethMode;                                // 0x0040(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ETeethMode                                    TeethMode;                                         // 0x0041(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_42[0x1E];                                      // 0x0042(0x001E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanFaceAnimationSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanFaceAnimationSolver")
	}
	static class UMetaHumanFaceAnimationSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanFaceAnimationSolver>();
	}
};
DUMPER7_ASSERTS_UMetaHumanFaceAnimationSolver;

}

