#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanCore

#include "Basic.hpp"

#include "MetaHumanCore_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "LiveLinkInterface_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// Class MetaHumanCore.MetaHumanCameraCalibration
// 0x0020 (0x0048 - 0x0028)
class UMetaHumanCameraCalibration final : public UObject
{
public:
	TArray<struct FExtendedLensFile>              CameraCalibrations;                                // 0x0028(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStereoPair>                    StereoPairs;                                       // 0x0038(0x0010)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanCameraCalibration")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanCameraCalibration")
	}
	static class UMetaHumanCameraCalibration* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanCameraCalibration>();
	}
};
DUMPER7_ASSERTS_UMetaHumanCameraCalibration;

// Class MetaHumanCore.MetaHumanContourData
// 0x01B0 (0x01D8 - 0x0028)
class UMetaHumanContourData final : public UObject
{
public:
	struct FFrameTrackingContourData              FrameTrackingContourData;                          // 0x0028(0x0060)(NativeAccessSpecifierPublic)
	TMap<class FString, struct FReducedContour>   ReducedContourData;                                // 0x0088(0x0050)(NativeAccessSpecifierPublic)
	TSet<class FString>                           ManuallyModifiedCurves;                            // 0x00D8(0x0050)(NativeAccessSpecifierPublic)
	class FString                                 ContourDataConfigVersion;                          // 0x0128(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_138[0xA0];                                     // 0x0138(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanContourData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanContourData")
	}
	static class UMetaHumanContourData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanContourData>();
	}
};
DUMPER7_ASSERTS_UMetaHumanContourData;

// Class MetaHumanCore.MetaHumanLiveLinkRole
// 0x0000 (0x0028 - 0x0028)
class UMetaHumanLiveLinkRole final : public ULiveLinkBasicRole
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanLiveLinkRole")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanLiveLinkRole")
	}
	static class UMetaHumanLiveLinkRole* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanLiveLinkRole>();
	}
};
DUMPER7_ASSERTS_UMetaHumanLiveLinkRole;

// Class MetaHumanCore.MetaHumanProcessingAsset
// 0x0000 (0x0028 - 0x0028)
class UMetaHumanProcessingAsset final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanProcessingAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanProcessingAsset")
	}
	static class UMetaHumanProcessingAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanProcessingAsset>();
	}
};
DUMPER7_ASSERTS_UMetaHumanProcessingAsset;

// Class MetaHumanCore.MetaHumanViewportSettings
// 0x00D0 (0x00F8 - 0x0028)
class UMetaHumanViewportSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	EABImageViewMode                              CurrentViewMode;                                   // 0x0040(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthNear;                                         // 0x0044(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DepthFar;                                          // 0x0048(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMetaHumanViewportCameraState          CameraState;                                       // 0x0050(0x0058)(Edit, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	TMap<EABImageViewMode, struct FMetaHumanViewportState> ViewportState;                            // 0x00A8(0x0050)(Edit, EditConst, Protected, NativeAccessSpecifierProtected)

public:
	float GetEV100(EABImageViewMode InView);
	EViewModeIndex GetViewModeIndex(EABImageViewMode InView);
	bool IsFootageVisible(EABImageViewMode InView);
	void SetEV100(EABImageViewMode InView, float InValue, bool bInNotify);
	void SetViewModeIndex(EABImageViewMode InView, EViewModeIndex InViewModeIndex, bool bInNotify);
	void ToggleDepthMeshVisibility(EABImageViewMode InView);
	void ToggleDistortion(EABImageViewMode InView);
	void ToggleFootageVisibility(EABImageViewMode InView);
	void ToggleShowControlVertices(EABImageViewMode InView);
	void ToggleShowCurves(EABImageViewMode InView);
	void ToggleSkeletalMeshVisibility(EABImageViewMode InView);

	bool IsDepthMeshVisible(EABImageViewMode InView) const;
	bool IsShowingControlVertices(EABImageViewMode InView) const;
	bool IsShowingCurves(EABImageViewMode InView) const;
	bool IsShowingSingleView() const;
	bool IsShowingUndistorted(EABImageViewMode InView) const;
	bool IsSkeletalMeshVisible(EABImageViewMode InView) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanViewportSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanViewportSettings")
	}
	static class UMetaHumanViewportSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanViewportSettings>();
	}
};
DUMPER7_ASSERTS_UMetaHumanViewportSettings;

}

