#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanConfig

#include "Basic.hpp"

#include "MetaHumanConfig_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MetaHumanConfig.MetaHumanConfig
// 0x0510 (0x0538 - 0x0028)
class UMetaHumanConfig final : public UObject
{
public:
	EMetaHumanConfigType                          Type;                                              // 0x0028(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, AssetRegistrySearchable, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Name_0;                                            // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Version;                                           // 0x0040(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InternalVersion;                                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_54[0x4E4];                                     // 0x0054(0x04E4)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool ReadFromDirectory(const class FString& InPath);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanConfig")
	}
	static class UMetaHumanConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanConfig>();
	}
};
DUMPER7_ASSERTS_UMetaHumanConfig;

}

