#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MetaHumanFaceFittingSolver

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class MetaHumanFaceFittingSolver.MetaHumanFaceFittingSolver
// 0x0038 (0x0060 - 0x0028)
class UMetaHumanFaceFittingSolver final : public UObject
{
public:
	bool                                          bOverrideDeviceConfig;                             // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMetaHumanConfig*                       DeviceConfig;                                      // 0x0030(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanFaceAnimationSolver*          FaceAnimationSolver;                               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMetaHumanConfig*                       PredictiveSolver;                                  // 0x0040(0x0008)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_48[0x18];                                      // 0x0048(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MetaHumanFaceFittingSolver")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MetaHumanFaceFittingSolver")
	}
	static class UMetaHumanFaceFittingSolver* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMetaHumanFaceFittingSolver>();
	}
};
DUMPER7_ASSERTS_UMetaHumanFaceFittingSolver;

}

