#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ND_DialogueSystem_Quest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ETypeQuestNode_structs.hpp"
#include "EStatQuestNode_structs.hpp"
#include "DlgSystem_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ND_DialogueSystem_Quest.ND_DialogueSystem_Quest_C
// 0x0068 (0x0090 - 0x0028)
class UND_DialogueSystem_Quest_C final : public UDlgNodeData
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0028(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	ETypeQuestNode                                TypeNode;                                          // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EStatQuestNode                                StatNode;                                          // 0x0031(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, bool>                       Markers;                                           // 0x0038(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Main;                                              // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ND_DialogueSystem_Quest(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("ND_DialogueSystem_Quest_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ND_DialogueSystem_Quest_C")
	}
	static class UND_DialogueSystem_Quest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UND_DialogueSystem_Quest_C>();
	}
};
DUMPER7_ASSERTS_UND_DialogueSystem_Quest_C;

}

