#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_CH_NewBattleSystem

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "Smuta_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "EnchancedSpline_structs.hpp"
#include "NPC_CH_classes.hpp"
#include "GameDifficultyModule_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_CH_NewBattleSystem.NPC_CH_NewBattleSystem_C
// 0x02C0 (0x0D10 - 0x0A50)
#pragma pack(push, 0x1)
class alignas(0x10) ANPC_CH_NewBattleSystem_C : public ANPC_CH_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_CH_NewBattleSystem_C;           // 0x0A50(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDefenceZoneCollisionComponent*         FencingDefenceZone_L;                              // 0x0A58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDefenceZoneCollisionComponent*         FencingDefenceZone_R;                              // 0x0A60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SilentKillsOverlap;                                // 0x0A68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDefenceZoneCollisionComponent*         FencingDefenceZone;                                // 0x0A70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBattleAssistanceComponent*             BattleAssistance;                                  // 0x0A78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  InteractionNonlethalElimination;                   // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionWidgetComponent*            InteractionWidget1;                                // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  InteractionSilentKill;                             // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USmutaNPCEquipmentComponent*            SmutaNPCEquipment;                                 // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTargetPrioritizationComponent*         TargetPrioritization;                              // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDetectionStateWidgetComponent*         DetectionStateWidget;                              // 0x0AA8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEnemyDetectionComponent*               EnemyDetection;                                    // 0x0AB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDamageHistoryComponent*                DamageHistory;                                     // 0x0AB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UZoneFightAiComponent*                  ZoneFightAi;                                       // 0x0AC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_ActionRoll_C*                      BPC_ActionRoll;                                    // 0x0AC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UEnemyAggroController*                  EnemyAggroController;                              // 0x0AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       DebugState;                                        // 0x0AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_GameDifficulty_NPC_C*              BPC_GameDifficulty_NPC;                            // 0x0AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Value_05EF3B3542D16857351160817573B2DF;   // 0x0AE8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline__Direction_05EF3B3542D16857351160817573B2DF; // 0x0AEC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AED[0x3];                                      // 0x0AED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline;                                          // 0x0AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDebugState;                                    // 0x0AF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFraction                                     FractionOverride;                                  // 0x0AF9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          OverrideHelpFractions;                             // 0x0AFA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AFB[0x5];                                      // 0x0AFB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UBehaviorTree*                          StartupBehavior;                                   // 0x0B00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ASpawnerPointZastava*                   SpawnerRef;                                        // 0x0B08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsLeader;                                          // 0x0B10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsFromDarkForest;                                  // 0x0B11(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B12[0x2];                                      // 0x0B12(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FActiveGameplayEffectHandle            DetectedStealthHandle;                             // 0x0B14(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1C[0x4];                                      // 0x0B1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           GunsTimerHandle;                                   // 0x0B20(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        WarpDistanceLimit;                                 // 0x0B28(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AZastavaPOI*>                    SortFreePOI;                                       // 0x0B30(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          IsSeen;                                            // 0x0B40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsHear;                                            // 0x0B41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B42[0x6];                                      // 0x0B42(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           WarningAnimation;                                  // 0x0B48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             WarningSound;                                      // 0x0B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           SkipAnimation;                                     // 0x0B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundWave*                             SkipSound;                                         // 0x0B60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         DistractStones;                                    // 0x0B68(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          HasZastava;                                        // 0x0B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B79[0x7];                                      // 0x0B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<double>                                TimeToAbilities;                                   // 0x0B80(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         NextAbilIndex;                                     // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B94[0x4];                                      // 0x0B94(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        NextAbilTime;                                      // 0x0B98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAITraits_AbilitiesOnTimer>     NewLocalVar;                                       // 0x0BA0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UGameplayTask_WaitDelay*                Async_Task_Ability_Timer;                          // 0x0BB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          HasStealth;                                        // 0x0BB8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BB9[0x7];                                      // 0x0BB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           StealthDetectTimerHandle;                          // 0x0BC0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            GE_SpecStealthToTarget;                            // 0x0BC8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          WeaponLighted;                                     // 0x0BD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BD1[0x7];                                      // 0x0BD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           WeaponEndLightHandle;                              // 0x0BD8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         PatrolIndex;                                       // 0x0BE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsFromAmbush;                                      // 0x0BE4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BE5[0x3];                                      // 0x0BE5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class AActor*>                           FoundDeadBodies;                                   // 0x0BE8(0x0050)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                          DeadBodyWasFound;                                  // 0x0C38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C39[0x7];                                      // 0x0C39(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FNPCAppearanceWrapper                  NPCAppearance;                                     // 0x0C40(0x0018)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, ExposeOnSpawn)
	struct FNPCSmartObjectVars                    SmartSettings;                                     // 0x0C58(0x0088)(Edit, BlueprintVisible)
	TSoftObjectPtr<class UDlgDialogue>            DialogueAsset;                                     // 0x0CE0(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash)

public:
	void ActorLoaded();
	void BndEvt__NPC_CH_NewBattleSystem_AbilitiesComponent_K2Node_ComponentBoundEvent_2_OnTagChanged__DelegateSignature(const struct FGameplayTag& UpdatedTag, bool Exists);
	void BndEvt__NPC_CH_NewBattleSystem_CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void BndEvt__NPC_CH_NewBattleSystem_EnemyAggroController_K2Node_ComponentBoundEvent_3_OnAgroTargetUpdated__DelegateSignature(class AActor* NewAgroTarget);
	void CheckAnyPlayerHearing(const struct FAIStimulus& Stimulus, class AActor* Actor);
	void CheckAttackPerseption(const struct FAIStimulus& Stimulus, class AActor* Actor);
	void CheckBattleTag();
	void CheckCorpsePerception(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void CheckDeathFromPeriodicEffects();
	void CheckDeathPerception(const struct FAIStimulus& Stimulus, class AActor* Actor);
	void CheckDistanceOnStealth(bool* Vis);
	void CheckDistract(class UClass* Stimulus, class UClass* Class_0, class AActor* stone);
	void CheckPlayerTagChange(const class AActor* Target);
	void CheckSilentKillPerseption(const struct FAIStimulus& Stimulus, class AActor* Actor);
	void CheckStealth(class UClass* Stimulus, class UClass* Class_0);
	void ComponentsToSave(TArray<class UActorComponent*>* Components);
	void DEBUG_CreateStateWidget();
	void Die();
	void EndWeaponLight();
	void ExecuteUbergraph_NPC_CH_NewBattleSystem(int32 EntryPoint);
	void GetAbilitiesOnTimer(bool* succes, TArray<struct FAITraits_AbilitiesOnTimer>* res);
	void GetLowestIndex(TArray<double>& Values, int32* Index_0, double* Value);
	void HandleHitPlayerCollision(const struct FHitResult& Hit, class APawn* Player);
	void InitAbilitiesOnTimer(bool Init);
	void InitNPCCharacter_0(class UBehaviorTree* BTAsset);
	void Lay_to_Rest();
	void LightTheWeapon(bool TurnOn);
	void On_Anim_Linked(TSubclassOf<class UAnimInstance> Class_0);
	void OnFinish_EB186B284775BD164F60BF98988BDC71();
	void OnTagChanged_Event(const struct FGameplayTag& UpdatedTag, bool Exists);
	void PlayerOnPossesEvent(class APawn* OldPawn, class APawn* NewPawn);
	void ReceivePossessed(class AController* NewController);
	void ReceiveTick(float DeltaSeconds);
	void ResetGunState();
	void SetAppearance();
	void SetPerceptionRadius_(const struct FGameplayTag& UpdatedTag, bool Exists);
	void SetUPSmartObjectVars();
	void Timeline__FinishedFunc();
	void Timeline__UpdateFunc();
	void UpdatePlayerVisibility(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void getDialogComponent(class UBP_Ink_Dialog_Component_C** Ref_DialigComponent);
	void OnTargetPerceptionUp(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void ReceiveBeginPlay();
	void UserConstructionScript();

	class UFractionComponent* GetFractionComponent() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NPC_CH_NewBattleSystem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPC_CH_NewBattleSystem_C")
	}
	static class ANPC_CH_NewBattleSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_CH_NewBattleSystem_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_ANPC_CH_NewBattleSystem_C;

}

