#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_CH_Cangiveup

#include "Basic.hpp"


namespace SDK::Params
{

// Function NPC_CH_Cangiveup.NPC_CH_CanGiveUp_C.BndEvt__NPC_CH_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct NPC_CH_CanGiveUp_C_BndEvt__NPC_CH_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NPC_CH_CanGiveUp_C_BndEvt__NPC_CH_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature;

// Function NPC_CH_Cangiveup.NPC_CH_CanGiveUp_C.ExecuteUbergraph_NPC_CH_CanGiveUp
// 0x0020 (0x0020 - 0x0000)
struct NPC_CH_CanGiveUp_C_ExecuteUbergraph_NPC_CH_CanGiveUp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_RunBehaviorTree_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_InteractedActor;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NPC_CH_CanGiveUp_C_ExecuteUbergraph_NPC_CH_CanGiveUp;

}

