#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_CH_DF_Patrol

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function NPC_CH_DF_Patrol.NPC_CH_DF_Patrol_C.BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct NPC_CH_DF_Patrol_C_BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature final
{
public:
	TArray<class AActor*>                         UpdatedActors;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_NPC_CH_DF_Patrol_C_BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature;

// Function NPC_CH_DF_Patrol.NPC_CH_DF_Patrol_C.BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_2_ActorPerceptionUpdatedDelegate__DelegateSignature
// 0x0060 (0x0060 - 0x0000)
struct NPC_CH_DF_Patrol_C_BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_2_ActorPerceptionUpdatedDelegate__DelegateSignature final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            Stimulus;                                          // 0x0008(0x0058)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_NPC_CH_DF_Patrol_C_BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_2_ActorPerceptionUpdatedDelegate__DelegateSignature;

// Function NPC_CH_DF_Patrol.NPC_CH_DF_Patrol_C.BndEvt__NPC_CH_DF_Patrol_PerceptionComponent_K2Node_ComponentBoundEvent_1_PerceptionUpdatedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct NPC_CH_DF_Patrol_C_BndEvt__NPC_CH_DF_Patrol_PerceptionComponent_K2Node_ComponentBoundEvent_1_PerceptionUpdatedDelegate__DelegateSignature final
{
public:
	TArray<class AActor*>                         UpdatedActors;                                     // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_NPC_CH_DF_Patrol_C_BndEvt__NPC_CH_DF_Patrol_PerceptionComponent_K2Node_ComponentBoundEvent_1_PerceptionUpdatedDelegate__DelegateSignature;

// Function NPC_CH_DF_Patrol.NPC_CH_DF_Patrol_C.ExecuteUbergraph_NPC_CH_DF_Patrol
// 0x00A0 (0x00A0 - 0x0000)
struct NPC_CH_DF_Patrol_C_ExecuteUbergraph_NPC_CH_DF_Patrol final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_ComponentBoundEvent_UpdatedActors_1;        // 0x0010(0x0010)(ConstParm, ReferenceParm)
	TArray<class AActor*>                         K2Node_ComponentBoundEvent_UpdatedActors;          // 0x0020(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_ComponentBoundEvent_Actor;                  // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FAIStimulus                            K2Node_ComponentBoundEvent_Stimulus;               // 0x0040(0x0058)(NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_NPC_CH_DF_Patrol_C_ExecuteUbergraph_NPC_CH_DF_Patrol;

}

