#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_CH_DF_Village

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "EPOIType_structs.hpp"
#include "StatesNPC_structs.hpp"
#include "NPC_InteractPoint_structs.hpp"
#include "NPC_CH_DF_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_CH_DF_Village.NPC_CH_DF_Village_C
// 0x0070 (0x0AF0 - 0x0A80)
class ANPC_CH_DF_Village_C final : public ANPC_CH_DF_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_CH_DF_Village_C;                // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Dialog_Sphere;                                     // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       WidgetVisibilitySphere;                            // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        TorchSlot;                                         // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RightFollowPoint;                                  // 0x0A98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LeftFollowPoint;                                   // 0x0AA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_VillageNPCHome_C*                   SpawnerRef;                                        // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UData_NPC_Village_C*                    VillageNPCData;                                    // 0x0AB0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<EPOIType>                              POIsAvailable;                                     // 0x0AB8(0x0010)(Edit, BlueprintVisible, ExposeOnSpawn)
	class AActor*                                 ActorToSpeakWith;                                  // 0x0AC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EStatesNPC                                    States;                                            // 0x0AD0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ENPC_InteractPoint                            NPC_InteractPoint;                                 // 0x0AD1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_AD2[0x6];                                      // 0x0AD2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        RotationZ;                                         // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DialogueIndex;                                     // 0x0AE0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__NPC_CH_DF_Village_Dialog_Sphere_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__NPC_CH_DF_Village_Dialog_Sphere_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__NPC_CH_DF_Village_WidgetVisibilitySphere_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BndEvt__NPC_CH_DF_Village_WidgetVisibilitySphere_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void CheckIsFreeForDialog(class AActor* Actor, bool* IsFree);
	void ExecuteUbergraph_NPC_CH_DF_Village(int32 EntryPoint);
	void GenIndex(int32* Index_0);
	void GetIndex(int32* Index_0);
	void InitNPC();
	void Introvert();
	void Set_Actor_to_Speak_With_BB(class AActor* ActorToSpeakWith_0, bool SpeakingWithPlayer);
	void ShowSpeakingText(class UObject* Actor, bool Show);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NPC_CH_DF_Village_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPC_CH_DF_Village_C")
	}
	static class ANPC_CH_DF_Village_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_CH_DF_Village_C>();
	}
};
DUMPER7_ASSERTS_ANPC_CH_DF_Village_C;

}

