#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_CH_DF_Patrol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "NPC_CH_DF_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_CH_DF_Patrol.NPC_CH_DF_Patrol_C
// 0x0030 (0x0AB0 - 0x0A80)
class ANPC_CH_DF_Patrol_C final : public ANPC_CH_DF_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_CH_DF_Patrol_C;                 // 0x0A78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        TorchSlot;                                         // 0x0A80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        RightFollowPoint;                                  // 0x0A88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        LeftFollowPoint;                                   // 0x0A90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ABP_OutpostPatrolSpawnerBase_C*         SpawnerRef;                                        // 0x0A98(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsLeader;                                          // 0x0AA0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_AA1[0x3];                                      // 0x0AA1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         IndexInTeam;                                       // 0x0AA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DetectedAsDead;                                    // 0x0AA8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_0_PerceptionUpdatedDelegate__DelegateSignature(const TArray<class AActor*>& UpdatedActors);
	void BndEvt__NPC_CH_DF_Patrol_AIPerception_Night_K2Node_ComponentBoundEvent_2_ActorPerceptionUpdatedDelegate__DelegateSignature(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void BndEvt__NPC_CH_DF_Patrol_PerceptionComponent_K2Node_ComponentBoundEvent_1_PerceptionUpdatedDelegate__DelegateSignature(const TArray<class AActor*>& UpdatedActors);
	void ExecuteUbergraph_NPC_CH_DF_Patrol(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NPC_CH_DF_Patrol_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPC_CH_DF_Patrol_C")
	}
	static class ANPC_CH_DF_Patrol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_CH_DF_Patrol_C>();
	}
};
DUMPER7_ASSERTS_ANPC_CH_DF_Patrol_C;

}

