#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_AI_Traits

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_AI_Traits.NPC_AI_Traits_C
// 0x0028 (0x0058 - 0x0030)
class UNPC_AI_Traits_C final : public UPrimaryDataAsset
{
public:
	double                                        AlertedSenseRadius;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        CalmSenseRadius;                                   // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UBehaviorTree*                          Behaviour;                                         // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        NoiseRadius;                                       // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PursuitRadius;                                     // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NPC_AI_Traits_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPC_AI_Traits_C")
	}
	static class UNPC_AI_Traits_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNPC_AI_Traits_C>();
	}
};
DUMPER7_ASSERTS_UNPC_AI_Traits_C;

}

