#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_CH

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ENPCState_structs.hpp"
#include "GameDifficultyModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_structs.hpp"
#include "Human_CH_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_CH.NPC_CH_C
// 0x0140 (0x0A50 - 0x0910)
class ANPC_CH_C : public AHuman_CH_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_CH_C;                           // 0x0910(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNPCReactionComponent*                  NPCReaction;                                       // 0x0918(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBC_SmutaSplineMovement_C*              BC_SmutaSplineMovement;                            // 0x0920(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPCDialogueComponent*                  NPCDialogue;                                       // 0x0928(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionWidgetComponent*            InteractionWidget;                                 // 0x0930(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNPCStateComponent*                     NPCState;                                          // 0x0938(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USmartObjectHelperComponent*            SmartObjectHelper;                                 // 0x0940(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      InteractionLookOn;                                 // 0x0948(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       W_TargetLock;                                      // 0x0950(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_DialogueSystem_C*                   AC_DialogueSystem;                                 // 0x0958(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractionOverlap;                                // 0x0960(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  InteractionDialogue;                               // 0x0968(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTargetedWidgetComponent*               HealthBar;                                         // 0x0970(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Blend_Face_Emotion_Alpha_AA13438240C5E99F6A076B91A8A7FF41; // 0x0978(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Blend_Face_Emotion__Direction_AA13438240C5E99F6A076B91A8A7FF41; // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_97D[0x3];                                      // 0x097D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Blend_Face_Emotion;                                // 0x0980(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UDA_AITraits_C*                         AITraits;                                          // 0x0988(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          DestroyAfterDeath;                                 // 0x0990(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_991[0x7];                                      // 0x0991(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DestroyAfterDeathDistance;                         // 0x0998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	ENPCState                                     Default_AIState;                                   // 0x09A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_9A1[0x7];                                      // 0x09A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DayNightController_C*               DayNightController;                                // 0x09A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                                DetectedPlace;                                     // 0x09B0(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        BetterDistance;                                    // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          FirstDetected;                                     // 0x09D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9D1[0x7];                                      // 0x09D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                StartupLocation;                                   // 0x09D8(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanStroll;                                         // 0x09F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9F1[0x7];                                      // 0x09F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        WaitIn;                                            // 0x09F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WaitOut;                                           // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AA_PointForNPC_C*>               WayPoints;                                         // 0x0A08(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate, SaveGame)
	class UTextRenderComponent*                   TextComp;                                          // 0x0A18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UTextRenderComponent*>           TextComps;                                         // 0x0A20(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class USoundWave*                             WelcomeWave;                                       // 0x0A30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBehaviorTree*                          StartBehavior;                                     // 0x0A38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash)
	bool                                          CanRotateToPlayer;                                 // 0x0A40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A41[0x7];                                      // 0x0A41(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPeacefulAsset*                         PeacefulLocomotionSettings;                        // 0x0A48(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash)

public:
	void ActorLoaded();
	void Blend_Face_Emotion_NPC(class UAnimInstance* Anim_Instance, bool Linked);
	void Blend_Face_Emotion__FinishedFunc();
	void Blend_Face_Emotion__UpdateFunc();
	void BndEvt__NPC_CH_Interaction_K2Node_ComponentBoundEvent_0_OnInteract__DelegateSignature(class AActor* InteractedActor);
	void CheckDistance();
	void CheckNPCState(bool IsWarning);
	void CheckPlayerInSight(bool* Successfully_Sensed);
	void DebugPath();
	void ExecuteUbergraph_NPC_CH(int32 EntryPoint);
	class UAITraitsBase* GetAITraits();
	void getDialogComponent(class UBP_Ink_Dialog_Component_C** Ref_DialigComponent);
	void hideCorpse();
	bool ModifyBoolValue(class FName ValueName, bool bNewValue);
	bool ModifyFloatValue(class FName ValueName, bool bDelta, float Value);
	bool ModifyIntValue(class FName ValueName, bool bDelta, int32 Value);
	bool ModifyNameValue(class FName ValueName, class FName NameValue);
	bool OnDialogueEvent(class UDlgContext* Context, class FName EventName);
	void OnTargetPerceptionUp(class AActor* Actor, const struct FAIStimulus& Stimulus);
	void PersecutionTarget(class AActor* InputPin, const struct FAIStimulus& Stimulus);
	void ReceiveBeginPlay();
	void RecieveOnGameDifficultyChanged(EGameDifficulty NewDifficulty);
	void ReplaceTargetLockWidget(class UClass* Class_0);
	void SetMovementMode(EGroundMovementMode MovementMode);
	void SetNPCStateBB(ENPCState NPCState_0);
	void SetTargetActorBB(class UObject* ObjectValue);
	void Setup_Peaceful();
	void ShowTargetLockWidget(bool Show, bool HardLock);
	void SwitchPerceptionConfig(bool Day);
	void UpdateMoveSpeedByCurrentMovementMode();
	void UpdateMoveSpeedByMovementMode(EGroundMovementMode Mode);
	void UpdateWaitTime();
	void UserConstructionScript();

	bool CheckCondition(const class UDlgContext* Context, class FName ConditionName) const;
	bool GetBoolValue(class FName ValueName) const;
	float GetFloatValue(class FName ValueName) const;
	int32 GetIntValue(class FName ValueName) const;
	class FName GetNameValue(class FName ValueName) const;
	class FText GetParticipantDisplayName(class FName ActiveSpeaker) const;
	ETextGender GetParticipantGender() const;
	class UTexture2D* GetParticipantIcon(class FName ActiveSpeaker, class FName ActiveSpeakerState) const;
	class FName GetParticipantName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NPC_CH_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NPC_CH_C")
	}
	static class ANPC_CH_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_CH_C>();
	}
};
DUMPER7_ASSERTS_ANPC_CH_C;

}

