#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NS_Attack

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NS_Attack.NS_Attack_C
// 0x0020 (0x0050 - 0x0030)
class UNS_Attack_C final : public UAnimNotifyState
{
public:
	bool                                          ComboEnded;                                        // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           AttackType;                                        // 0x0034(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AttackLevel;                                       // 0x003C(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           AttackSide;                                        // 0x0044(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)

public:
	class FString GetNotifyName() const;
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration, const struct FAnimNotifyEventReference& EventReference) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, const struct FAnimNotifyEventReference& EventReference) const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("NS_Attack_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NS_Attack_C")
	}
	static class UNS_Attack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNS_Attack_C>();
	}
};
DUMPER7_ASSERTS_UNS_Attack_C;

}

