#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: O_GiveAchievement

#include "Basic.hpp"


namespace SDK::Params
{

// Function O_GiveAchievement.O_GiveAchievement_C.ExecuteUbergraph_O_GiveAchievement
// 0x0028 (0x0028 - 0x0000)
struct O_GiveAchievement_C_ExecuteUbergraph_O_GiveAchievement final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_InteractedActor;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  K2Node_Event_InteractComponent;                    // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USmutaOnlineSubsystem*                  CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_GiveAchievement_C_ExecuteUbergraph_O_GiveAchievement;

// Function O_GiveAchievement.O_GiveAchievement_C.InteractEvent
// 0x0010 (0x0010 - 0x0000)
struct O_GiveAchievement_C_InteractEvent final
{
public:
	class AActor*                                 InteractedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInteractionComponent*                  InteractComponent;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_GiveAchievement_C_InteractEvent;

}

