#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: O_GlobalTags

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function O_GlobalTags.O_GlobalTags_C.CheckCondition
// 0x0001 (0x0001 - 0x0000)
struct O_GlobalTags_C_CheckCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_GlobalTags_C_CheckCondition;

// Function O_GlobalTags.O_GlobalTags_C.ExecuteUbergraph_O_GlobalTags
// 0x0048 (0x0048 - 0x0000)
struct O_GlobalTags_C_ExecuteUbergraph_O_GlobalTags final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTagContainer& NewGlobalTags)> K2Node_CreateDelegate_OutputDelegate; // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuestManager*                          CallFunc_GetQuestManager_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  K2Node_CustomEvent_NewGlobalTags;                  // 0x0028(0x0020)(ConstParm)
};
DUMPER7_ASSERTS_O_GlobalTags_C_ExecuteUbergraph_O_GlobalTags;

// Function O_GlobalTags.O_GlobalTags_C.OnGlobalQuestTagsChanged
// 0x0020 (0x0020 - 0x0000)
struct O_GlobalTags_C_OnGlobalQuestTagsChanged final
{
public:
	struct FGameplayTagContainer                  NewGlobalTags;                                     // 0x0000(0x0020)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_O_GlobalTags_C_OnGlobalQuestTagsChanged;

// Function O_GlobalTags.O_GlobalTags_C.StartCondition
// 0x0008 (0x0008 - 0x0000)
struct O_GlobalTags_C_StartCondition final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_GlobalTags_C_StartCondition;

// Function O_GlobalTags.O_GlobalTags_C.UpdateResult
// 0x0030 (0x0030 - 0x0000)
struct O_GlobalTags_C_UpdateResult final
{
public:
	class UQuestManager*                          CallFunc_GetQuestManager_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                  CallFunc_GetGlobalTags_ReturnValue;                // 0x0008(0x0020)(ConstParm)
	bool                                          CallFunc_DoesContainerMatchTagQuery_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_GlobalTags_C_UpdateResult;

}

