#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: O_InteractCondition_FractionAttitude

#include "Basic.hpp"

#include "AIModule_structs.hpp"


namespace SDK::Params
{

// Function O_InteractCondition_FractionAttitude.O_InteractCondition_FractionAttitude_C.ExecuteUbergraph_O_InteractCondition_FractionAttitude
// 0x0020 (0x0020 - 0x0000)
struct O_InteractCondition_FractionAttitude_C_ExecuteUbergraph_O_InteractCondition_FractionAttitude final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ETeamAttitude                                 CallFunc_GetActorsAttitude_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_InteractCondition_FractionAttitude_C_ExecuteUbergraph_O_InteractCondition_FractionAttitude;

// Function O_InteractCondition_FractionAttitude.O_InteractCondition_FractionAttitude_C.StartCondition
// 0x0008 (0x0008 - 0x0000)
struct O_InteractCondition_FractionAttitude_C_StartCondition final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_InteractCondition_FractionAttitude_C_StartCondition;

}

