#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: O_InteractCondition_DialogueIsValid

#include "Basic.hpp"


namespace SDK::Params
{

// Function O_InteractCondition_DialogueIsValid.O_InteractCondition_DialogueIsValid_C.ExecuteUbergraph_O_InteractCondition_DialogueIsValid
// 0x0038 (0x0038 - 0x0000)
struct O_InteractCondition_DialogueIsValid_C_ExecuteUbergraph_O_InteractCondition_DialogueIsValid final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPassportAsset* Passport)> K2Node_CreateDelegate_OutputDelegate;            // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPC_CH_C*                              K2Node_DynamicCast_AsNPC_CH;                       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPassportAsset*                         K2Node_CustomEvent_Passport;                       // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_InteractCondition_DialogueIsValid_C_ExecuteUbergraph_O_InteractCondition_DialogueIsValid;

// Function O_InteractCondition_DialogueIsValid.O_InteractCondition_DialogueIsValid_C.OnPassportChanged
// 0x0008 (0x0008 - 0x0000)
struct O_InteractCondition_DialogueIsValid_C_OnPassportChanged final
{
public:
	class UPassportAsset*                         Passport;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_InteractCondition_DialogueIsValid_C_OnPassportChanged;

// Function O_InteractCondition_DialogueIsValid.O_InteractCondition_DialogueIsValid_C.StartCondition
// 0x0008 (0x0008 - 0x0000)
struct O_InteractCondition_DialogueIsValid_C_StartCondition final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_InteractCondition_DialogueIsValid_C_StartCondition;

// Function O_InteractCondition_DialogueIsValid.O_InteractCondition_DialogueIsValid_C.UpdateStatus
// 0x0068 (0x0068 - 0x0000)
struct O_InteractCondition_DialogueIsValid_C_UpdateStatus final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class FName>                             CallFunc_GetParticipantNames_ReturnValue;          // 0x0008(0x0050)()
	class FName                                   Temp_name_Variable;                                // 0x0058(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_InteractCondition_DialogueIsValid_C_UpdateStatus;

}

