#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: O_NotOnSmartObjectCondition

#include "Basic.hpp"


namespace SDK::Params
{

// Function O_NotOnSmartObjectCondition.O_NotOnSmartObjectCondition_C.CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct O_NotOnSmartObjectCondition_C_CheckCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmartObjectHelperComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentlyInteracting_ReturnValue;       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_NotOnSmartObjectCondition_C_CheckCondition;

// Function O_NotOnSmartObjectCondition.O_NotOnSmartObjectCondition_C.ExecuteUbergraph_O_NotOnSmartObjectCondition
// 0x0010 (0x0010 - 0x0000)
struct O_NotOnSmartObjectCondition_C_ExecuteUbergraph_O_NotOnSmartObjectCondition final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OwnerActor;                           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_NotOnSmartObjectCondition_C_ExecuteUbergraph_O_NotOnSmartObjectCondition;

// Function O_NotOnSmartObjectCondition.O_NotOnSmartObjectCondition_C.StartCondition
// 0x0008 (0x0008 - 0x0000)
struct O_NotOnSmartObjectCondition_C_StartCondition final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_O_NotOnSmartObjectCondition_C_StartCondition;

}

