#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OldBP_Prismatiscape_Draw_Component

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OldBP_Prismatiscape_Draw_Component.OldBP_Prismatiscape_Draw_Component_C.ExecuteUbergraph_OldBP_Prismatiscape_Draw_Component
// 0x0048 (0x0048 - 0x0000)
struct OldBP_Prismatiscape_Draw_Component_C_ExecuteUbergraph_OldBP_Prismatiscape_Draw_Component final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APrismatiscape_Manager_BP_C*            CallFunc_GetActorOfClass_ReturnValue;              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OldBP_Prismatiscape_Draw_Component_C_ExecuteUbergraph_OldBP_Prismatiscape_Draw_Component;

// Function OldBP_Prismatiscape_Draw_Component.OldBP_Prismatiscape_Draw_Component_C.ToggleDrawing
// 0x0001 (0x0001 - 0x0000)
struct OldBP_Prismatiscape_Draw_Component_C_ToggleDrawing final
{
public:
	bool                                          Yas_;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_OldBP_Prismatiscape_Draw_Component_C_ToggleDrawing;

}

