#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OldBP_Prismatiscape_Draw_Component

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass OldBP_Prismatiscape_Draw_Component.OldBP_Prismatiscape_Draw_Component_C
// 0x0020 (0x00C0 - 0x00A0)
class UOldBP_Prismatiscape_Draw_Component_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class APrismatiscape_Manager_BP_C*            Prismatiscape_Manager;                             // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          DrawByDefault_;                                    // 0x00B0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsVisible_;                                        // 0x00B1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B2[0x6];                                       // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        ActorScale;                                        // 0x00B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_OldBP_Prismatiscape_Draw_Component(int32 EntryPoint);
	void ReceiveBeginPlay();
	void ToggleDrawing(bool Yas_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("OldBP_Prismatiscape_Draw_Component_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"OldBP_Prismatiscape_Draw_Component_C")
	}
	static class UOldBP_Prismatiscape_Draw_Component_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UOldBP_Prismatiscape_Draw_Component_C>();
	}
};
DUMPER7_ASSERTS_UOldBP_Prismatiscape_Draw_Component_C;

}

