#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: OpenCVLensDistortion

#include "Basic.hpp"

#include "OpenCVLensDistortion_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function OpenCVLensDistortion.OpenCVLensDistortionBlueprintLibrary.CreateUndistortUVDisplacementMap
// 0x0068 (0x0068 - 0x0000)
struct OpenCVLensDistortionBlueprintLibrary_CreateUndistortUVDisplacementMap final
{
public:
	struct FOpenCVLensDistortionParameters        LensParameters;                                    // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntPoint                              ImageSize;                                         // 0x0048(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CroppingFactor;                                    // 0x0050(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FOpenCVCameraViewInfo                  CameraViewInfo;                                    // 0x0054(0x000C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	class UTexture2D*                             ReturnValue;                                       // 0x0060(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OpenCVLensDistortionBlueprintLibrary_CreateUndistortUVDisplacementMap;

// Function OpenCVLensDistortion.OpenCVLensDistortionBlueprintLibrary.DrawDisplacementMapToRenderTarget
// 0x0018 (0x0018 - 0x0000)
struct OpenCVLensDistortionBlueprintLibrary_DrawDisplacementMapToRenderTarget final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextureRenderTarget2D*                 OutputRenderTarget;                                // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             PreComputedUndistortDisplacementMap;               // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_OpenCVLensDistortionBlueprintLibrary_DrawDisplacementMapToRenderTarget;

// Function OpenCVLensDistortion.OpenCVLensDistortionBlueprintLibrary.EqualEqual_CompareLensDistortionModels
// 0x0098 (0x0098 - 0x0000)
struct OpenCVLensDistortionBlueprintLibrary_EqualEqual_CompareLensDistortionModels final
{
public:
	struct FOpenCVLensDistortionParameters        A;                                                 // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FOpenCVLensDistortionParameters        B;                                                 // 0x0048(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OpenCVLensDistortionBlueprintLibrary_EqualEqual_CompareLensDistortionModels;

// Function OpenCVLensDistortion.OpenCVLensDistortionBlueprintLibrary.NotEqual_CompareLensDistortionModels
// 0x0098 (0x0098 - 0x0000)
struct OpenCVLensDistortionBlueprintLibrary_NotEqual_CompareLensDistortionModels final
{
public:
	struct FOpenCVLensDistortionParameters        A;                                                 // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FOpenCVLensDistortionParameters        B;                                                 // 0x0048(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0090(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_OpenCVLensDistortionBlueprintLibrary_NotEqual_CompareLensDistortionModels;

}

