#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_CH_NewBattle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "STR_HeroLighting_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "ConsumableWidget_structs.hpp"
#include "Player_CH_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Player_CH_NewBattle.Player_CH_NewBattle_C
// 0x01E0 (0x0E00 - 0x0C20)
class APlayer_CH_NewBattle_C : public APlayer_CH_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Player_CH_NewBattle_C;              // 0x0C20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UFightZonesComponent*                   FightZones;                                        // 0x0C28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    RimLight_1;                                        // 0x0C30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    KeyLight_3;                                        // 0x0C38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    KeyLight_2;                                        // 0x0C40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URectLightComponent*                    KeyLight_1;                                        // 0x0C48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        Light_Parent;                                      // 0x0C50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPrismatiscapeInteractionBubbleComponent* PrismatiscapeInteractionBubble;                  // 0x0C58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPrismatiscapeDeformComponentCharacter* PrismatiscapeDeformComponentCharacter;             // 0x0C60(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_SkillTree_C*                        AC_SkillTree;                                      // 0x0C68(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWidgetComponent*                       ComboStatus;                                       // 0x0C70(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_PhotoMode_C*                       BPC_PhotoMode;                                     // 0x0C78(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent*                    Inventory;                                         // 0x0C80(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCharacterEquipmentComponent*           CharacterEquipment;                                // 0x0C88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPlayerBattleStateController*           PlayerBattleStateController;                       // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPC_TargetLock_C*                      BPC_TargetLock;                                    // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UArrowComponent*                        Arrow1;                                            // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Alpha_9FC67B194A0C4FA27AA860BFF4DFECE6; // 0x0CA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_9FC67B194A0C4FA27AA860BFF4DFECE6; // 0x0CAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CAD[0x3];                                      // 0x0CAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0CB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         PlayCameraPP_Blend_CCC06330457A4781B7F3FEB6ACA8C7FE; // 0x0CB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            PlayCameraPP__Direction_CCC06330457A4781B7F3FEB6ACA8C7FE; // 0x0CBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CBD[0x3];                                      // 0x0CBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     PlayCameraPP;                                      // 0x0CC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UFirstPersonAnimInstance*               MiloslavskiyABP;                                   // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         ComboCount;                                        // 0x0CD0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD4[0x4];                                      // 0x0CD4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnPerformAttack;                                   // 0x0CD8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                        ForwardMovementInput;                              // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RightMovementInput;                                // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayAbility>           In_Ability_to_Activate;                            // 0x0CF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                             Icon;                                              // 0x0D00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class FText                                   Tool_Tip_Text;                                     // 0x0D08(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWeaponHitNoiseDataAsset*               WeaponNoiseData;                                   // 0x0D20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            MovementEffectHandle;                              // 0x0D28(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_DayNightController_C*               DayNightController;                                // 0x0D30(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, struct FSTR_HeroLighting> Level_Temperature_Day;                             // 0x0D38(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FSTR_HeroLighting> Level_Temperature_Night;                           // 0x0D88(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          IsPreset;                                          // 0x0DD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD9[0x7];                                      // 0x0DD9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FConsumableWidget>              ActiveConsumableUIEffercts;                        // 0x0DE0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	class ABP_Ultra_Dynamic_Sky_C*                Ultra_Dynamic_Sky;                                 // 0x0DF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class USmutaGameUserSettings*                 As_Smuta_Game_User_Settings;                       // 0x0DF8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ActorPreSave();
	void Added_20CB4D524ABB6F5A4A50CAAE9AA1C981();
	void BndEvt__Human_CH_CharacterMovement_K2Node_ComponentBoundEvent_0_OnMovementStateChanged__DelegateSignature(bool InMove);
	void BndEvt__Player_CH_NewBattle_CharacterEquipment_K2Node_ComponentBoundEvent_0_OnAppearanceChanged__DelegateSignature(class UAppearanceItem* NewAppearance);
	void CancelRegeneration(float DamageAmount);
	void ComponentsToSave(TArray<class UActorComponent*>* Components);
	void Die();
	void ExecuteUbergraph_Player_CH_NewBattle(int32 EntryPoint);
	void Fade_Hero_Lighting();
	void GetMapIconData(struct FVector* Location, class UTexture2D** Icon_0, struct FVector2D* IconSize, double* Angle, class FText* ToolTipText);
	void InpActEvt_IA_HardTargetLockAndStealth_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_HardTargetLockAndStealth_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_HardTargetLockSwitch_K2Node_EnhancedInputActionEvent_8(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_RangetAttackAimedShoot_K2Node_EnhancedInputActionEvent_5(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_RangetAttackAimedShoot_K2Node_EnhancedInputActionEvent_6(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_RangetAttackAimedShootJoystick_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_RangetAttackAimedShootJoystick_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_SpecialAttack_K2Node_EnhancedInputActionEvent_4(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void ActorLoaded();
	void InpActEvt_IA_ToggleHardTargetLock_K2Node_EnhancedInputActionEvent_7(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void Light_Settings(class ULightComponent* Light, double Day_Temperature, double Night_Temperature, double Default_Temperature, const struct FLinearColor& Color, bool Is_Day_);
	void OnAppearanceChanged(class UAppearanceItem* NewAppearance);
	void OnDayTimeChanged_Event(bool IsDay);
	void OnDayTimeChanged_Event_0(bool IsDay);
	void OnHeroLightingChangeValue();
	void OnTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void PlayCameraPP__FinishedFunc();
	void PlayCameraPP__UpdateFunc();
	void PlayPostProcessBlend(double Time);
	void ReceiveBeginPlay();
	void Removed_D18B578448261452895F17AA27598E5C();
	void ReportNoiseFromWeapon(TSoftClassPtr<class UClass> EquipmentClass, EWeaponNoiseAttackType AttackType);
	void Temperature_Presets(const class FString& Level_Name, bool IsDay_);
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Player_CH_NewBattle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Player_CH_NewBattle_C")
	}
	static class APlayer_CH_NewBattle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayer_CH_NewBattle_C>();
	}
};
DUMPER7_ASSERTS_APlayer_CH_NewBattle_C;

}

