#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Player_CH_DLC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Player_CH_NewBattle_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Player_CH_DLC.Player_CH_DLC_C
// 0x0040 (0x0E40 - 0x0E00)
class APlayer_CH_DLC_C final : public APlayer_CH_NewBattle_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Player_CH_DLC_C;                    // 0x0E00(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UDefenceZoneCollisionComponent*         FencingDefenceZone_L;                              // 0x0E08(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDefenceZoneCollisionComponent*         FencingDefenceZone_R;                              // 0x0E10(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAbilityCancelerComponent*              AbilityCanceler;                                   // 0x0E18(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAC_Concentration_C*                    AC_Concentration;                                  // 0x0E20(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDefenceZoneCollisionComponent*         DodgeDefenceZone;                                  // 0x0E28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDefenceZoneCollisionComponent*         FencingDefenceZone;                                // 0x0E30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDialogueStatusViewerComponent*         DialogueStatusViewer;                              // 0x0E38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Player_CH_DLC(int32 EntryPoint);
	void InpActEvt_Equals_K2Node_InputDebugKeyEvent_1(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_Hyphen_K2Node_InputDebugKeyEvent_0(const struct FKey& Key, const struct FInputActionValue& ActionValue);
	void InpActEvt_IA_Torch_K2Node_EnhancedInputActionEvent_3(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_0(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_1(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void InpActEvt_IA_Turn_K2Node_EnhancedInputActionEvent_2(const struct FInputActionValue& ActionValue, float ElapsedTime, float TriggeredTime, const class UInputAction* SourceAction);
	void ReceiveTick(float DeltaSeconds);
	void UpdateClothWeight();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Player_CH_DLC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Player_CH_DLC_C")
	}
	static class APlayer_CH_DLC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APlayer_CH_DLC_C>();
	}
};
DUMPER7_ASSERTS_APlayer_CH_DLC_C;

}

