#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prismatiscape

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Prismatiscape_structs.hpp"


namespace SDK::Params
{

// Function Prismatiscape.PrismatiscapeBPLibrary.PrismatiscapeSampleFunction
// 0x0008 (0x0008 - 0x0000)
struct PrismatiscapeBPLibrary_PrismatiscapeSampleFunction final
{
public:
	float                                         Param;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeBPLibrary_PrismatiscapeSampleFunction;

// Function Prismatiscape.PrismatiscapeDrawComponent.ToggleDrawing
// 0x0001 (0x0001 - 0x0000)
struct PrismatiscapeDrawComponent_ToggleDrawing final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeDrawComponent_ToggleDrawing;

// Function Prismatiscape.PrismatiscapeDeformComponent.BP_GetDeformCapsules
// 0x0040 (0x0040 - 0x0000)
struct PrismatiscapeDeformComponent_BP_GetDeformCapsules final
{
public:
	TArray<struct FVector4>                       StartLocationAndRadius;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndLocationAndRadius;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       StartVelocityAndStrength;                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndVelocityAndStrength;                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeDeformComponent_BP_GetDeformCapsules;

// Function Prismatiscape.PrismatiscapeDeformComponent.GetDeformCapsules
// 0x0040 (0x0040 - 0x0000)
struct PrismatiscapeDeformComponent_GetDeformCapsules final
{
public:
	TArray<struct FVector4>                       StartLocationAndRadius;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndLocationAndRadius;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       StartVelocityAndStrength;                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndVelocityAndStrength;                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeDeformComponent_GetDeformCapsules;

// Function Prismatiscape.PrismatiscapeDeformComponentCharacter.GetActiveBoneProfile
// 0x0018 (0x0018 - 0x0000)
struct PrismatiscapeDeformComponentCharacter_GetActiveBoneProfile final
{
public:
	struct FPrismatiscapeBoneChainNameArray       ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeDeformComponentCharacter_GetActiveBoneProfile;

// Function Prismatiscape.PrismatiscapeDeformComponentCharacter.SetActiveProfile
// 0x0008 (0x0008 - 0x0000)
struct PrismatiscapeDeformComponentCharacter_SetActiveProfile final
{
public:
	class FName                                   NewProfileName;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeDeformComponentCharacter_SetActiveProfile;

// Function Prismatiscape.PrismatiscapeInteractionBubbleComponent.BP_GetInteractionBubbles
// 0x0020 (0x0020 - 0x0000)
struct PrismatiscapeInteractionBubbleComponent_BP_GetInteractionBubbles final
{
public:
	TArray<struct FVector4>                       LocationAndRadius;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       VelocityAndStrength;                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeInteractionBubbleComponent_BP_GetInteractionBubbles;

// Function Prismatiscape.PrismatiscapeInteractionBubbleComponent.GetInteractionBubbles
// 0x0020 (0x0020 - 0x0000)
struct PrismatiscapeInteractionBubbleComponent_GetInteractionBubbles final
{
public:
	TArray<struct FVector4>                       LocationAndRadius;                                 // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       VelocityAndStrength;                               // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeInteractionBubbleComponent_GetInteractionBubbles;

// Function Prismatiscape.PrismatiscapeProfileBase.OnPropertyChange
// 0x0008 (0x0008 - 0x0000)
struct PrismatiscapeProfileBase_OnPropertyChange final
{
public:
	class FName                                   PropertyName;                                      // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeProfileBase_OnPropertyChange;

// Function Prismatiscape.PrismatiscapeSettings.GetPrismatiscapeSettings
// 0x0008 (0x0008 - 0x0000)
struct PrismatiscapeSettings_GetPrismatiscapeSettings final
{
public:
	class UPrismatiscapeSettings*                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeSettings_GetPrismatiscapeSettings;

// Function Prismatiscape.PrismatiscapeSettings.GetDrawDebugShapes
// 0x0001 (0x0001 - 0x0000)
struct PrismatiscapeSettings_GetDrawDebugShapes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeSettings_GetDrawDebugShapes;

// Function Prismatiscape.PrismatiscapeWindComponent.BP_GetWindCapsules
// 0x0040 (0x0040 - 0x0000)
struct PrismatiscapeWindComponent_BP_GetWindCapsules final
{
public:
	TArray<struct FVector4>                       StartLocationAndRadius;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndLocationAndRadius;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       StartVelocityAndStrength;                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndVelocityAndStrength;                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeWindComponent_BP_GetWindCapsules;

// Function Prismatiscape.PrismatiscapeWindComponent.GetWindCapsules
// 0x0040 (0x0040 - 0x0000)
struct PrismatiscapeWindComponent_GetWindCapsules final
{
public:
	TArray<struct FVector4>                       StartLocationAndRadius;                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndLocationAndRadius;                              // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       StartVelocityAndStrength;                          // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector4>                       EndVelocityAndStrength;                            // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeWindComponent_GetWindCapsules;

// Function Prismatiscape.PrismatiscapeWorldSubsystem.GetPrismatiscapeManager
// 0x0010 (0x0010 - 0x0000)
struct PrismatiscapeWorldSubsystem_GetPrismatiscapeManager final
{
public:
	const class UObject*                          WorldContextObject;                                // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APrismatiscapeManager*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PrismatiscapeWorldSubsystem_GetPrismatiscapeManager;

// Function Prismatiscape.PrismatiscapeWorldSubsystem.OnWorldEndPlay
// 0x0010 (0x0010 - 0x0000)
struct PrismatiscapeWorldSubsystem_OnWorldEndPlay final
{
public:
	class UWorld*                                 World;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSessionEnded;                                     // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCleanupResources;                                 // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PrismatiscapeWorldSubsystem_OnWorldEndPlay;

}

