#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prismatiscape_WindStyleProfile

#include "Basic.hpp"

#include "Prismatiscape_StyleProfile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prismatiscape_WindStyleProfile.Prismatiscape_WindStyleProfile_C
// 0x0060 (0x0098 - 0x0038)
class UPrismatiscape_WindStyleProfile_C final : public UPrismatiscape_StyleProfile_C
{
public:
	double                                        WindInputStrength;                                 // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindInputHeightFalloff;                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindCurlNoiseStrength;                             // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindCurlNoiseSize;                                 // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindMaxTravelSpeed;                                // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindDiffusionAmount;                               // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindDecayRate;                                     // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindDisplacementRecoveryRate;                      // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeformCapsuleInputToWindMinSpeed;                  // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeformCapsuleInputToWindMaxSpeed;                  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DeformCapsuleInputToWindStrength;                  // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        WindTemporalSmoothingRate;                         // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyProfile(class UNiagaraComponent* PrismatiscapeNiagaraSystem, bool* Requires_ReInit_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Prismatiscape_WindStyleProfile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Prismatiscape_WindStyleProfile_C")
	}
	static class UPrismatiscape_WindStyleProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrismatiscape_WindStyleProfile_C>();
	}
};
DUMPER7_ASSERTS_UPrismatiscape_WindStyleProfile_C;

}

