#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prismatiscape_PulseStruct

#include "Basic.hpp"

#include "Prismatiscape_Draw_Shape_structs.hpp"


namespace SDK
{

// UserDefinedStruct Prismatiscape_PulseStruct.Prismatiscape_PulseStruct
// 0x00A0 (0x00A0 - 0x0000)
struct FPrismatiscape_PulseStruct final
{
public:
	double                                        Duration_2_729228FD427FFBAE3A88F4BEFD3CC658;       // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        StartTime_4_2F72AA4A45E93A8CE93BE7A61EB046AE;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            StrengthCurve_7_AE4AF2084D8695C180E5D285949F5312;  // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18[0x8];                                       // 0x0018(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPrismatiscape_Draw_Shape              DrawShape_18_21264433415CB8E976839EAA246D50FC;     // 0x0020(0x0080)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPrismatiscape_PulseStruct;

}

