#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prismatiscape_FoliageDeform_StyleProfile

#include "Basic.hpp"

#include "Prismatiscape_StyleProfile_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Prismatiscape_FoliageDeform_StyleProfile.Prismatiscape_FoliageDeform_StyleProfile_C
// 0x0060 (0x0098 - 0x0038)
class UPrismatiscape_FoliageDeform_StyleProfile_C final : public UPrismatiscape_StyleProfile_C
{
public:
	double                                        FolaigeDeformInputStrength;                        // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageDeformDecayRate;                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageDeformVelocityDecayRate;                    // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageDeformInteractionHeight;                    // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FoliageDeformVelocityInteractionHeight;            // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FoliageDeformAdditionalCapsuleRadius;              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageDeformVelocityAdditionalCapsuleRadius;      // 0x0068(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageDeformTrampleProtectionFactor;              // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageBubbleInputStrength;                        // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageBubbleDecayRate;                            // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageBubbleVelocityDecayRate;                    // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        FoliageBubbleInteractionHeight;                    // 0x0090(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ApplyProfile(class UNiagaraComponent* PrismatiscapeNiagaraSystem, bool* Requires_ReInit_);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Prismatiscape_FoliageDeform_StyleProfile_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Prismatiscape_FoliageDeform_StyleProfile_C")
	}
	static class UPrismatiscape_FoliageDeform_StyleProfile_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UPrismatiscape_FoliageDeform_StyleProfile_C>();
	}
};
DUMPER7_ASSERTS_UPrismatiscape_FoliageDeform_StyleProfile_C;

}

