#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Prismatiscape

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct Prismatiscape.PrismatiscapeBoneChainData
// 0x0020 (0x0020 - 0x0000)
struct FPrismatiscapeBoneChainData final
{
public:
	TArray<class FName>                           BoneNamesRootToTip;                                // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 RadiiRootToTip;                                    // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPrismatiscapeBoneChainData;

// ScriptStruct Prismatiscape.PrismatiscapeBoneProfileData
// 0x0010 (0x0010 - 0x0000)
struct FPrismatiscapeBoneProfileData final
{
public:
	TArray<struct FPrismatiscapeBoneChainData>    BoneChains;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPrismatiscapeBoneProfileData;

// ScriptStruct Prismatiscape.PrismatiscapeBoneChainNameArray
// 0x0018 (0x0018 - 0x0000)
struct FPrismatiscapeBoneChainNameArray final
{
public:
	TArray<class FName>                           BoneChainNames;                                    // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                         StrengthMultiplier;                                // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FPrismatiscapeBoneChainNameArray;

// ScriptStruct Prismatiscape.PrismatiscapeDrawShape
// 0x0080 (0x0080 - 0x0000)
struct FPrismatiscapeDrawShape final
{
public:
	struct FVector4                               StartLocationAndRadius;                            // 0x0000(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               EndLocationAndRadius;                              // 0x0020(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               StartVelocityAndStrength;                          // 0x0040(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector4                               EndVelocityAndStrength;                            // 0x0060(0x0020)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPrismatiscapeDrawShape;

}

