#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_AgrOnPlayer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_AgrOnPlayer.QA_AgrOnPlayer_C
// 0x0038 (0x0068 - 0x0030)
class UQA_AgrOnPlayer_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftObjectPtr<class AActor>>          NPCs;                                              // 0x0038(0x0010)(Edit, BlueprintVisible, SaveGame)
	float                                         DelayDuration;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFraction                                     Fraction;                                          // 0x004C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFraction>                             Call_For_Help_Fractions;                           // 0x0050(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame)
	bool                                          Can_Disagro;                                       // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QA_AgrOnPlayer(int32 EntryPoint);
	void RunAction_K2(class UQuestStep* FromQuestStep);
	void UpdateAgroState(class UEnemyAggroController* AgroController, class UFractionComponent* FractionComponent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_AgrOnPlayer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_AgrOnPlayer_C")
	}
	static class UQA_AgrOnPlayer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_AgrOnPlayer_C>();
	}
};
DUMPER7_ASSERTS_UQA_AgrOnPlayer_C;

}

