#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_ApplyEffectOnNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_ApplyEffectOnNPC.QA_ApplyEffectOnNPC_C
// 0x0040 (0x0070 - 0x0030)
class UQA_ApplyEffectOnNPC_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          Apply;                                             // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            Gameplay_Effect_Class;                             // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class ANPC_CH_NewBattleSystem_C> Target;                                          // 0x0048(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QA_ApplyEffectOnNPC(int32 EntryPoint);
	void RunAction_K2(class UQuestStep* FromQuestStep);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_ApplyEffectOnNPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_ApplyEffectOnNPC_C")
	}
	static class UQA_ApplyEffectOnNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_ApplyEffectOnNPC_C>();
	}
};
DUMPER7_ASSERTS_UQA_ApplyEffectOnNPC_C;

}

