#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_FailScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"
#include "E_HUDStates_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_FailScreen.QA_FailScreen_C
// 0x0030 (0x0060 - 0x0030)
class UQA_FailScreen_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Delay;                                             // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDead;                                            // 0x003C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Fail_Reason;                                       // 0x0040(0x0018)(Edit, BlueprintVisible, SaveGame)
	struct FTimerHandle                           CameraMovementHandle;                              // 0x0058(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)

public:
	void DeathCameraMovement();
	void ExecuteUbergraph_QA_FailScreen(int32 EntryPoint);
	void HandleDeathScreenAppears(E_HUDStates NewState, E_HUDStates OldState);
	void RunAction_K2(class UQuestStep* FromQuestStep);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_FailScreen_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_FailScreen_C")
	}
	static class UQA_FailScreen_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_FailScreen_C>();
	}
};
DUMPER7_ASSERTS_UQA_FailScreen_C;

}

