#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_LoadUnloadSublvls

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_LoadUnloadSublvls.QA_LoadUnloadSublvls_C
// 0x0038 (0x0068 - 0x0030)
class UQA_LoadUnloadSublvls_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<TSoftObjectPtr<class UWorld>>          LevelsToLoad;                                      // 0x0038(0x0010)(Edit, BlueprintVisible, SaveGame)
	TArray<TSoftObjectPtr<class UWorld>>          LevelsToUnload;                                    // 0x0048(0x0010)(Edit, BlueprintVisible, SaveGame)
	double                                        UnloadTimeout;                                     // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStreamLevelManager*                    Level_Manager;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QA_LoadUnloadSublvls(int32 EntryPoint);
	void LoadLevels();
	void RunAction_K2(class UQuestStep* FromQuestStep);
	void UnloadLevels();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_LoadUnloadSublvls_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_LoadUnloadSublvls_C")
	}
	static class UQA_LoadUnloadSublvls_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_LoadUnloadSublvls_C>();
	}
};
DUMPER7_ASSERTS_UQA_LoadUnloadSublvls_C;

}

