#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_PlayerMontage_WithWarp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_PlayerMontage_WithWarp.QA_PlayerMontage_WithWarp_C
// 0x0090 (0x00C0 - 0x0030)
class UQA_PlayerMontage_WithWarp_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class UAnimMontage>            Animation;                                         // 0x0038(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
	TSoftObjectPtr<class AActor>                  Target;                                            // 0x0060(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
	EWarpUpdate                                   WarpSettings;                                      // 0x0088(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x3];                                       // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WarpTargetName;                                    // 0x008C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableInputInEnd;                                  // 0x0094(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class APlayer_CH_C>            Player;                                            // 0x0098(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QA_PlayerMontage_WithWarp(int32 EntryPoint);
	void OnBlendOut_9B0DC5314BC79727DB78DA82D080F8F6(class FName NotifyName);
	void OnCompleted_9B0DC5314BC79727DB78DA82D080F8F6(class FName NotifyName);
	void OnInterrupted_9B0DC5314BC79727DB78DA82D080F8F6(class FName NotifyName);
	void OnLoaded_43DF58AA446AE0B4FF20EE9F817950DA(class UObject* Loaded);
	void OnNotifyBegin_9B0DC5314BC79727DB78DA82D080F8F6(class FName NotifyName);
	void OnNotifyEnd_9B0DC5314BC79727DB78DA82D080F8F6(class FName NotifyName);
	void RunAction_K2(class UQuestStep* FromQuestStep);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_PlayerMontage_WithWarp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_PlayerMontage_WithWarp_C")
	}
	static class UQA_PlayerMontage_WithWarp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_PlayerMontage_WithWarp_C>();
	}
};
DUMPER7_ASSERTS_UQA_PlayerMontage_WithWarp_C;

}

