#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_PlayerSayPhrase

#include "Basic.hpp"


namespace SDK::Params
{

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.ExecuteUbergraph_QA_PlayerSayPhrase
// 0x00E8 (0x00E8 - 0x0000)
struct QA_PlayerSayPhrase_C_ExecuteUbergraph_QA_PlayerSayPhrase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0074(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_AsAnim_Montage;                 // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestStep*                             K2Node_Event_FromQuestStep;                        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayer_CH_C*                           K2Node_DynamicCast_AsPlayer_CH;                    // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x3];                                       // 0x00B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_5;            // 0x00BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x3];                                       // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x00DC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_ExecuteUbergraph_QA_PlayerSayPhrase;

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.OnBlendOut_EA499A364584F3E73FA0A78D7A1CF792
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayerSayPhrase_C_OnBlendOut_EA499A364584F3E73FA0A78D7A1CF792 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_OnBlendOut_EA499A364584F3E73FA0A78D7A1CF792;

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.OnCompleted_EA499A364584F3E73FA0A78D7A1CF792
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayerSayPhrase_C_OnCompleted_EA499A364584F3E73FA0A78D7A1CF792 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_OnCompleted_EA499A364584F3E73FA0A78D7A1CF792;

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.OnInterrupted_EA499A364584F3E73FA0A78D7A1CF792
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayerSayPhrase_C_OnInterrupted_EA499A364584F3E73FA0A78D7A1CF792 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_OnInterrupted_EA499A364584F3E73FA0A78D7A1CF792;

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.OnLoaded_0593E42046DE7E2E64D9AD8B43AA85A6
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayerSayPhrase_C_OnLoaded_0593E42046DE7E2E64D9AD8B43AA85A6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_OnLoaded_0593E42046DE7E2E64D9AD8B43AA85A6;

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.OnNotifyBegin_EA499A364584F3E73FA0A78D7A1CF792
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayerSayPhrase_C_OnNotifyBegin_EA499A364584F3E73FA0A78D7A1CF792 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_OnNotifyBegin_EA499A364584F3E73FA0A78D7A1CF792;

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.OnNotifyEnd_EA499A364584F3E73FA0A78D7A1CF792
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayerSayPhrase_C_OnNotifyEnd_EA499A364584F3E73FA0A78D7A1CF792 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_OnNotifyEnd_EA499A364584F3E73FA0A78D7A1CF792;

// Function QA_PlayerSayPhrase.QA_PlayerSayPhrase_C.RunAction_K2
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayerSayPhrase_C_RunAction_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayerSayPhrase_C_RunAction_K2;

}

