#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_PlayAlarmSound

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function QA_PlayAlarmSound.QA_PlayAlarmSound_C.ExecuteUbergraph_QA_PlayAlarmSound
// 0x0030 (0x0030 - 0x0000)
struct QA_PlayAlarmSound_C_ExecuteUbergraph_QA_PlayAlarmSound final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestStep*                             K2Node_Event_FromQuestStep;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayAlarmSound_C_ExecuteUbergraph_QA_PlayAlarmSound;

// Function QA_PlayAlarmSound.QA_PlayAlarmSound_C.RunAction_K2
// 0x0008 (0x0008 - 0x0000)
struct QA_PlayAlarmSound_C_RunAction_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_PlayAlarmSound_C_RunAction_K2;

}

