#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_StartIndependentFootstep

#include "Basic.hpp"


namespace SDK::Params
{

// Function QA_StartIndependentFootstep.QA_StartIndependentFootstep_C.ExecuteUbergraph_QA_StartIndependentFootstep
// 0x0040 (0x0040 - 0x0000)
struct QA_StartIndependentFootstep_C_ExecuteUbergraph_QA_StartIndependentFootstep final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AA_EvidenceFootprints_C*                K2Node_DynamicCast_AsA_Evidence_Footprints;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_StartIndependentFootstep_ReturnValue;     // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestStep*                             K2Node_Event_FromQuestStep;                        // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StartIndependentFootstep_C_ExecuteUbergraph_QA_StartIndependentFootstep;

// Function QA_StartIndependentFootstep.QA_StartIndependentFootstep_C.OnLoaded_5DB3FB33457ACD484A2D8692E217CC18
// 0x0008 (0x0008 - 0x0000)
struct QA_StartIndependentFootstep_C_OnLoaded_5DB3FB33457ACD484A2D8692E217CC18 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StartIndependentFootstep_C_OnLoaded_5DB3FB33457ACD484A2D8692E217CC18;

// Function QA_StartIndependentFootstep.QA_StartIndependentFootstep_C.RunAction_K2
// 0x0008 (0x0008 - 0x0000)
struct QA_StartIndependentFootstep_C_RunAction_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StartIndependentFootstep_C_RunAction_K2;

}

