#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_StopCutsceneNonSmuta

#include "Basic.hpp"


namespace SDK::Params
{

// Function QA_StopCutsceneNonSmuta.QA_StopCutsceneNonSmuta_C.ExecuteUbergraph_QA_StopCutsceneNonSmuta
// 0x0028 (0x0028 - 0x0000)
struct QA_StopCutsceneNonSmuta_C_ExecuteUbergraph_QA_StopCutsceneNonSmuta final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCutscenePlayerSubsystem*               CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UQuestStep*                             K2Node_Event_FromQuestStep;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ULevelSequencePlayer*                   CallFunc_GetStoredSequencePlayer_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlaying_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StopCutsceneNonSmuta_C_ExecuteUbergraph_QA_StopCutsceneNonSmuta;

// Function QA_StopCutsceneNonSmuta.QA_StopCutsceneNonSmuta_C.RunAction_K2
// 0x0008 (0x0008 - 0x0000)
struct QA_StopCutsceneNonSmuta_C_RunAction_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StopCutsceneNonSmuta_C_RunAction_K2;

}

