#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_StopSplineForNPC

#include "Basic.hpp"


namespace SDK::Params
{

// Function QA_StopSplineForNPC.QA_StopSplineForNPC_C.ExecuteUbergraph_QA_StopSplineForNPC
// 0x0010 (0x0010 - 0x0000)
struct QA_StopSplineForNPC_C_ExecuteUbergraph_QA_StopSplineForNPC final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestStep*                             K2Node_Event_FromQuestStep;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StopSplineForNPC_C_ExecuteUbergraph_QA_StopSplineForNPC;

// Function QA_StopSplineForNPC.QA_StopSplineForNPC_C.RunAction_K2
// 0x0008 (0x0008 - 0x0000)
struct QA_StopSplineForNPC_C_RunAction_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StopSplineForNPC_C_RunAction_K2;

// Function QA_StopSplineForNPC.QA_StopSplineForNPC_C.StopSpline
// 0x0048 (0x0048 - 0x0000)
struct QA_StopSplineForNPC_C_StopSpline final
{
public:
	class USmutaSplineMovementComponent*          LSplineComponent;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ANPC_CH_C*                              LCharPtr;                                          // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class USmutaSplineMovementComponent*          CallFunc_GetComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ANPC_CH_C*                              K2Node_DynamicCast_AsNPC_CH;                       // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ANPC_CH_C*                              K2Node_DynamicCast_AsNPC_CH_1;                     // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_StopSplineForNPC_C_StopSpline;

}

