#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_StartDialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_StartDialogue.QA_StartDialogue_C
// 0x0040 (0x0070 - 0x0030)
class UQA_StartDialogue_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class AActor>                  Optional_Dialog_Target;                            // 0x0038(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
	class UDlgDialogue*                           Dialogue;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash)
	bool                                          bEnabledInStealth;                                 // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bNoDialogue;                                       // 0x0069(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAbortNPCMovement;                                 // 0x006A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	class UAC_DialogueSystem_C* ChooseDlgComponent();
	void ExecuteUbergraph_QA_StartDialogue(int32 EntryPoint);
	void OnDestroyed_Event(class AActor* DestroyedActor);
	void RunAction_K2(class UQuestStep* FromQuestStep);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_StartDialogue_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_StartDialogue_C")
	}
	static class UQA_StartDialogue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_StartDialogue_C>();
	}
};
DUMPER7_ASSERTS_UQA_StartDialogue_C;

}

