#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_SetWeather

#include "Basic.hpp"


namespace SDK::Params
{

// Function QA_SetWeather.QA_SetWeather_C.ExecuteUbergraph_QA_SetWeather
// 0x0020 (0x0020 - 0x0000)
struct QA_SetWeather_C_ExecuteUbergraph_QA_SetWeather final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UQuestStep*                             K2Node_Event_FromQuestStep;                        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AA_SnowAttaching_C*                     CallFunc_GetActorOfClass_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_SetWeather_C_ExecuteUbergraph_QA_SetWeather;

// Function QA_SetWeather.QA_SetWeather_C.RunAction_K2
// 0x0008 (0x0008 - 0x0000)
struct QA_SetWeather_C_RunAction_K2 final
{
public:
	class UQuestStep*                             FromQuestStep;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_QA_SetWeather_C_RunAction_K2;

}

