#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_TeleportPlayerToActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_TeleportPlayerToActor.QA_TeleportPlayerToActor_C
// 0x0058 (0x0088 - 0x0030)
class UQA_TeleportPlayerToActor_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRotator                               NewCameraAngle;                                    // 0x0038(0x0018)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          Should_update_camera_;                             // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class AActor>                  TeleportTo;                                        // 0x0058(0x0028)(Edit, BlueprintVisible, SaveGame, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          Fade;                                              // 0x0080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Camera_Lag(bool Enable_Camera_Lag);
	void ExecuteUbergraph_QA_TeleportPlayerToActor(int32 EntryPoint);
	void RunAction_K2(class UQuestStep* FromQuestStep);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_TeleportPlayerToActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_TeleportPlayerToActor_C")
	}
	static class UQA_TeleportPlayerToActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_TeleportPlayerToActor_C>();
	}
};
DUMPER7_ASSERTS_UQA_TeleportPlayerToActor_C;

}

