#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_TeleportObject

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_TeleportObject.QA_TeleportObject_C
// 0x0068 (0x0098 - 0x0030)
class UQA_TeleportObject_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class AActor>                  Who_to_teleport;                                   // 0x0038(0x0028)(Edit, BlueprintVisible, SaveGame, HasGetValueTypeHash)
	struct FVector                                Where_to_teleport;                                 // 0x0060(0x0018)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               World_Rotation;                                    // 0x0078(0x0018)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                          CheckForIndoor;                                    // 0x0090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QA_TeleportObject(int32 EntryPoint);
	void RunAction_K2(class UQuestStep* FromQuestStep);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_TeleportObject_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_TeleportObject_C")
	}
	static class UQA_TeleportObject_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_TeleportObject_C>();
	}
};
DUMPER7_ASSERTS_UQA_TeleportObject_C;

}

