#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QA_TrackingCamera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QA_TrackingCamera.QA_TrackingCamera_C
// 0x0060 (0x0090 - 0x0030)
class UQA_TrackingCamera_C final : public UQuestStepAction
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0030(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TSoftObjectPtr<class AActor>                  Actor_to_Track;                                    // 0x0038(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, HasGetValueTypeHash)
	double                                        Tracking_Time;                                     // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisableInput;                                    // 0x0068(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        DelayBeforeDisableInput;                           // 0x0070(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DelayBeforeTracking;                               // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Start_Yaw_Offset;                                  // 0x0080(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        In_Yaw_Offset;                                     // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QA_TrackingCamera(int32 EntryPoint);
	void RunAction_K2(class UQuestStep* FromQuestStep);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QA_TrackingCamera_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QA_TrackingCamera_C")
	}
	static class UQA_TrackingCamera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQA_TrackingCamera_C>();
	}
};
DUMPER7_ASSERTS_UQA_TrackingCamera_C;

}

