#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QC_WaitPlayerTagWithNPC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass QC_WaitPlayerTagWithNPC.QC_WaitPlayerTagWithNPC_C
// 0x0048 (0x00A0 - 0x0058)
class UQC_WaitPlayerTagWithNPC_C final : public UQuestStepCondition
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0058(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           Tag;                                               // 0x0060(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class ACharacter>              ActivatingNPC;                                     // 0x0068(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGameplayTag                           NPC_Tag;                                           // 0x0090(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, SaveGame, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckTagOnLoad;                                    // 0x0098(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_QC_WaitPlayerTagWithNPC(int32 EntryPoint);
	void OnLoaded();
	void OnTagChanged_Event(const struct FGameplayTag& UpdatedTag, bool Exists);
	void PostLoadDelegate_Event(const bool SaveLoadResult);
	void StartCondition_K2();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("QC_WaitPlayerTagWithNPC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"QC_WaitPlayerTagWithNPC_C")
	}
	static class UQC_WaitPlayerTagWithNPC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UQC_WaitPlayerTagWithNPC_C>();
	}
};
DUMPER7_ASSERTS_UQC_WaitPlayerTagWithNPC_C;

}

