#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Random_Weather_Variation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "UDS_TemperatureType_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Random_Weather_Variation.Random_Weather_Variation_C
// 0x0198 (0x0238 - 0x00A0)
class URandom_Weather_Variation_C final : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Ultra_Dynamic_Weather_C*            UDW;                                               // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Target_Random_Weather_Type;                        // 0x00B0(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Summer_;               // 0x00B8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Autumn_;               // 0x0108(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Winter_;               // 0x0158(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UUDS_Weather_Settings_C*, double>  Weather_Type_Probabilities__Spring_;               // 0x01A8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                        Current_Lerp_Alpha;                                // 0x01F8(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Current_Timer_Length;                              // 0x0200(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeather_Override_Volume_C*             Volume;                                            // 0x0208(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                         Total_Changes;                                     // 0x0210(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Changing_Weather;                                  // 0x0214(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_215[0x3];                                      // 0x0215(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUDS_Weather_Settings_C*                Last_Random_Weather_Type;                          // 0x0218(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*                Current_Random_Weather_State;                      // 0x0220(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Change_Timer;                                      // 0x0228(0x0008)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Running_Timer;                                     // 0x0230(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Apply_State(const struct FRandomWeatherVariation_State& Random_Weather_State);
	void Create_Composite_Probability_Map(TMap<class UUDS_Weather_Settings_C*, double>* Out);
	void ExecuteUbergraph_Random_Weather_Variation(int32 EntryPoint);
	void Get_Climate_Temperature_Ranges(class UUDS_Climate_Preset_C* Climate_Object, EUDS_TemperatureType Scale, struct FVector2D* Summer_Range, struct FVector2D* Autumn_Range, struct FVector2D* Winter_Range, struct FVector2D* Spring_Range);
	void Get_State_for_Saving(struct FRandomWeatherVariation_State* State, class AWeather_Override_Volume_C** Volume_0);
	void Increment_Change_Timer();
	void Increment_Random_Weather();
	void Initialize(class ABP_Ultra_Dynamic_Weather_C* UDW_0, const TMap<class UUDS_Weather_Settings_C*, double>& Summer_Probabilities, const TMap<class UUDS_Weather_Settings_C*, double>& Autumn_Probabilities, const TMap<class UUDS_Weather_Settings_C*, double>& Winter_Probabilities, const TMap<class UUDS_Weather_Settings_C*, double>& Spring_Probabilities, bool Start_with_Random_Type);
	void Make_Climate_Probability_Map(class UUDS_Climate_Preset_C* Climate, int32 Season, TMap<class UUDS_Weather_Settings_C*, double>* Probability_Map);
	void ReceiveTick(float DeltaSeconds);
	void Reset_Timer();
	void Select_New_Random_Weather_Type(bool Filter_Probability_List);
	void Start_Timer_to_Select_New_Weather();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Random_Weather_Variation_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Random_Weather_Variation_C")
	}
	static class URandom_Weather_Variation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URandom_Weather_Variation_C>();
	}
};
DUMPER7_ASSERTS_URandom_Weather_Variation_C;

}

