#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RidingABP

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "RidingABP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass RidingABP.RidingABP_C
// 0x23A0 (0x29B0 - 0x0610)
class URidingABP_C final : public UEffectAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0610(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct RidingABP::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables;                    // 0x0618(0x00A4)(HasGetValueTypeHash)
	uint8                                         Pad_6BC[0x4];                                      // 0x06BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x06C0(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x06C8(0x0008)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x06D0(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_10;                 // 0x0798(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x0808(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0830(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0858(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0880(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x08A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x08D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x08F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0920(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0948(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0970(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0998(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x09C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x09E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x0A10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0A38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0A60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0A88(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0AB0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0x0AF8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0B18(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0x0B60(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0B80(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_15;                      // 0x0BC8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_9;                  // 0x0BE8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_14;                      // 0x0C58(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_8;                  // 0x0C78(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_13;                      // 0x0CE8(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0D08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0D30(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_7;                  // 0x0D58(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_12;                      // 0x0DC8(0x0020)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0x0DE8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_6;                  // 0x0EB0(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_5;                  // 0x0F20(0x0070)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x0F90(0x0048)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_4;                  // 0x0FD8(0x0070)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x1048(0x0070)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4;                       // 0x10B8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x1180(0x0020)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x11A0(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0x11C0(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x1288(0x0020)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_7;               // 0x12A8(0x0078)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_6;               // 0x1320(0x0078)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_5;               // 0x1398(0x0078)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_4;               // 0x1410(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x1488(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0x14D0(0x00C8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x1598(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x15E0(0x00C8)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_3;               // 0x16A8(0x0078)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_2;               // 0x1720(0x0078)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator_1;               // 0x1798(0x0078)()
	struct FAnimNode_BlendSpaceEvaluator          AnimGraphNode_BlendSpaceEvaluator;                 // 0x1810(0x0078)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x1888(0x0048)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x18D0(0x00C8)()
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x1998(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1A60(0x0020)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x1A80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x1AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x1AD0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x1AF8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1B68(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x1B88(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x1BF8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x1C18(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x1C88(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_3;                      // 0x1CA8(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x1D70(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_2;                      // 0x1D90(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x1E58(0x0110)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x1F68(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1;                    // 0x1F88(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_4;                     // 0x2008(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0x2030(0x00F0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x2120(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x2148(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x2170(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x21B0(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3;                     // 0x21D0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x21F8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x2218(0x00C8)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_1;                  // 0x22E0(0x00F0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x23D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x23F8(0x0028)()
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x2420(0x0040)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x2460(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_2;                     // 0x2480(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x24A8(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x24C8(0x00C8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x2590(0x0080)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x2610(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x2638(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x2660(0x00F0)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x2750(0x0020)()
	struct FAnimNode_LinkedAnimLayer              AnimGraphNode_LinkedAnimLayer;                     // 0x2770(0x00C8)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization;                     // 0x2838(0x0110)()
	bool                                          K2Node_PropertyAccess_10;                          // 0x2948(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2949[0x3];                                     // 0x2949(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_PropertyAccess_9;                           // 0x294C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_PropertyAccess_8;                           // 0x2950(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2954[0x4];                                     // 0x2954(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              K2Node_PropertyAccess_7;                           // 0x2958(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_6;                           // 0x2968(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2969[0x7];                                     // 0x2969(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_PropertyAccess_5;                           // 0x2970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_PropertyAccess_4;                           // 0x2978(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_3;                           // 0x2980(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2981[0x3];                                     // 0x2981(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_PropertyAccess_2;                           // 0x2984(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_PropertyAccess_1;                           // 0x2988(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2989[0x7];                                     // 0x2989(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_PropertyAccess;                             // 0x2990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Uhorse_test_C*                          HorseABP;                                          // 0x2998(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         Value;                                             // 0x29A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UnMount;                                           // 0x29A4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UnMountFromBattle;                                 // 0x29A5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UnMountFall;                                       // 0x29A6(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bTakeTorch;                                        // 0x29A7(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Look_Along_Camera;                                 // 0x29A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void AnimNotify_EndAnimation();
	void BlueprintBeginPlay();
	void BlueprintLinkedAnimationLayersInitialized();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_ApplyAdditive_FAFB80304A4C56E9DF919EB78B24C3AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendListByBool_3ADEAE90410249A4F5CC8BA8B8414D08();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendListByBool_C412EA674B9EB986D39B7ABE1A28BA3B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendListByBool_D36A281D4B3980FA11D69593D822F8A4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendListByBool_D9642FFB45CC85F1A7C9998A3E73A8DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_0475F34B4483C1073875258AF28839E2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_387F59BD4E908EA67B9AAA96EB651069();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_62A946E648E135A6014A4880BD2BB7D8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_6B9B00454C2666895C0711BC054B1D58();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_712979274D3614AAAAF7D59AAD83635F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_AE0E35F84939F482196257B8A3A9D0AF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_CE4B895F4D3E81293F870E96137248AE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpaceEvaluator_EFA338F44927280430890D9C9612B527();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_150E5D2E434B5C1079DE189719AD770B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_25FD5684406574B5CAE0588833DF33DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_26CE64924923536982987EA14D4E5720();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_29348EA14C1F1679DE599C8305FF2718();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_3A0DC63643859DA9C9A7CCBFAB04C5EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_5916A1634229F818400BBC9704CCD1CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_72C8D5BE4513B3935FB33283AD2617E4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_948B51CB4CDF09815D88C498E75929BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_A9AB62B94828F4B6FE96B6A29D3CCD77();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_D04B83B04EF7FF2156C86F9A7D1D7BAF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_BlendSpacePlayer_D962330E4C973627A898D7B834B3D0D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_0AB4B9FA4693D8C035B4F2B67E829275();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_1056D4B545DB2AC950A981A5239FFB3B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_3976C4924EBC32B1BA45DF8C171FDDDB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_49F099CE4DDB26A6BC23C8916156C264();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_56F480DA4EF553A6023D309E4773FAE9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_5D4A0B94462C880CB405E1A212729AD0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_9A356B5343F2EF5BD603A796A9B141B7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_AA246944406236A18CFF109BC9AEA79B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_B00749FC49959B3E923532B00B230975();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_B239251D4C673AE39FCEFBBECE3C1C11();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_CA5633F24FBEA086E235E98FD5ECE108();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_D9E9E13C42D364059C34F9844E6CD640();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TransitionResult_E92A8D424A8733D3095B2DA97CEA3894();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TwoWayBlend_67DFD97F48E6831914CC2D84BDFC0373();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TwoWayBlend_67FC27304803CA3001D99889AB14D202();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TwoWayBlend_A9E3BCEA401E0072F8463AAE138DBC2C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TwoWayBlend_E56F705244C5D3A77A5999A0AFF2E966();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TwoWayBlend_E98A8F3E468A051F41A2E7A582CB2E84();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_RidingABP_AnimGraphNode_TwoWayBlend_F4F1B80D499DE4027C9888B8E26071B6();
	void ExecuteUbergraph_RidingABP(int32 EntryPoint);
	void GetDesiredMovementYawLocal(double* Yaw);
	void GetGallopStopPhaseOffset(double* Value_0);
	void GetGroundSlopes(double* Right, double* Forward);
	void GetStartSyncTime(float* Value_0);
	bool GetStartWalkTransition();
	void GetSyncTimeFromCurve(float* Value_0);
	void GetTransitionPhase(double* Value_0);
	bool has_input();
	bool InTown();
	bool IsSprinting();
	void OnTorch(const struct FGameplayTag& UpdatedTag, bool Exists);
	void OnTorch1(const struct FGameplayTag& UpdatedTag, bool Exists);
	void OverwritingLayer(struct FPoseLink* OverwritingLayer_0);
	void OwnerTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("RidingABP_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"RidingABP_C")
	}
	static class URidingABP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<URidingABP_C>();
	}
};
DUMPER7_ASSERTS_URidingABP_C;

}

