#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_DialoguePhrase

#include "Basic.hpp"

#include "EDialogueSystemEmotion_structs.hpp"


namespace SDK
{

// UserDefinedStruct S_DialoguePhrase.S_DialoguePhrase
// 0x0038 (0x0038 - 0x0000)
struct FS_DialoguePhrase final
{
public:
	bool                                          IsInstigator_1_1304E97C4B3320C8FCE9D4A0D8FFD858;   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Phrase_4_EE95FB48472DEBA991EA84A7C6990CE4;         // 0x0008(0x0018)(Edit, BlueprintVisible)
	class USoundBase*                             Voice_23_AADE3ED347D934DEAB891FBAE2101585;         // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EDialogueSystemEmotion                        Emotion_18_03AE90EC4DBADDACB9DC25A253F17FA0;       // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequenceBase*                      LipSync_21_F3C2BEC94F092340C03AF69E1C4627F4;       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FS_DialoguePhrase;

}

