#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: S_UICodexArticleData

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct S_UICodexArticleData.S_UICodexArticleData
// 0x0060 (0x0060 - 0x0000)
struct FS_UICodexArticleData final
{
public:
	class FText                                   Name_20_F1848A6B42491FB10BDFB1AA5E07D34D;          // 0x0000(0x0018)(Edit, BlueprintVisible)
	class FText                                   TextKeyboard_8_0DAD0A59436E2879A0C403A5366EB3B6;   // 0x0018(0x0018)(Edit, BlueprintVisible)
	class FText                                   TextGamepad_7_A1AAD34A40678868653FF384C1ACEC70;    // 0x0030(0x0018)(Edit, BlueprintVisible)
	class UTexture2D*                             Image_18_8F85B1CE42DB265FAB35D3ABFBFC39F1;         // 0x0048(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseVideo_17_70C5B31D4D937862F837D3BE22D6BC19;     // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMediaSource*                           Video_19_ADC0DD4045555F72462CC0BE1A9748F7;         // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FS_UICodexArticleData;

}

