#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SaveInfoStorage

#include "Basic.hpp"

#include "SaveInfoStorage_structs.hpp"


namespace SDK::Params
{

// Function SaveInfoStorage.GetAllSaveSlotsAsync.GetAllSaveSlotsAsync
// 0x0010 (0x0010 - 0x0000)
struct GetAllSaveSlotsAsync_GetAllSaveSlotsAsync final
{
public:
	class UObject*                                WorldContextObject_0;                              // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetAllSaveSlotsAsync*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_GetAllSaveSlotsAsync_GetAllSaveSlotsAsync;

// Function SaveInfoStorage.SaveInfoStorageLibrary.IsValidEntry
// 0x0030 (0x0030 - 0x0000)
struct SaveInfoStorageLibrary_IsValidEntry final
{
public:
	struct FSaveInfoStorageEntry                  Entry;                                             // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SaveInfoStorageLibrary_IsValidEntry;

// Function SaveInfoStorage.SaveInfoStorageManager.DeleteSaveEntry
// 0x0028 (0x0028 - 0x0000)
struct SaveInfoStorageManager_DeleteSaveEntry final
{
public:
	struct FSaveInfoStorageEntry                  SaveEntry;                                         // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveInfoStorageManager_DeleteSaveEntry;

// Function SaveInfoStorage.SaveInfoStorageManager.OnSaveCreated
// 0x0008 (0x0008 - 0x0000)
struct SaveInfoStorageManager_OnSaveCreated final
{
public:
	const class UGameSaveSlot*                    Slot;                                              // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveInfoStorageManager_OnSaveCreated;

// Function SaveInfoStorage.SaveInfoStorageManager.GetSaves
// 0x0010 (0x0010 - 0x0000)
struct SaveInfoStorageManager_GetSaves final
{
public:
	TArray<struct FSaveInfoStorageEntry>          ReturnValue;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveInfoStorageManager_GetSaves;

// Function SaveInfoStorage.SaveInfoStorageManager.HasAnySaves
// 0x0001 (0x0001 - 0x0000)
struct SaveInfoStorageManager_HasAnySaves final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveInfoStorageManager_HasAnySaves;

// Function SaveInfoStorage.SaveInfoStorageManager.IsCollectInProgress
// 0x0001 (0x0001 - 0x0000)
struct SaveInfoStorageManager_IsCollectInProgress final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SaveInfoStorageManager_IsCollectInProgress;

}

