#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SettingsSystem

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "DeveloperSettings_classes.hpp"


namespace SDK
{

// Class SettingsSystem.SettingBase
// 0x0008 (0x0030 - 0x0028)
class USettingBase : public USaveGame
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Apply();
	void Initialize(const class UObject* WorldContextObject);
	void Load();
	void Save();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SettingBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SettingBase")
	}
	static class USettingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingBase>();
	}
};
DUMPER7_ASSERTS_USettingBase;

// Class SettingsSystem.AudioSetting
// 0x0020 (0x0050 - 0x0030)
class UAudioSetting : public USettingBase
{
public:
	float                                         FadeInTime;                                        // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundClass*                            Channel;                                           // 0x0038(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         Volume;                                            // 0x0040(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundMix*                              DefaultSoundMix;                                   // 0x0048(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void SetVolume(float Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AudioSetting")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AudioSetting")
	}
	static class UAudioSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAudioSetting>();
	}
};
DUMPER7_ASSERTS_UAudioSetting;

// Class SettingsSystem.SettingsSubsystem
// 0x0010 (0x0040 - 0x0030)
class USettingsSubsystem final : public UGameInstanceSubsystem
{
public:
	TArray<class USettingBase*>                   Settings;                                          // 0x0030(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	static class USettingBase* GetSetting(const class UObject* WorldContextObject, TSubclassOf<class USettingBase> SettingType);
	static void LoadAllSettings(const class UObject* WorldContextObject);
	static void LoadSettings(const class UObject* WorldContextObject, TSubclassOf<class USettingBase> SettingType);
	static void SaveAllSettings(const class UObject* WorldContextObject);
	static void SaveSettings(const class UObject* WorldContextObject, TSubclassOf<class USettingBase> SettingType);

	void InitializeSettings();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SettingsSubsystem")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SettingsSubsystem")
	}
	static class USettingsSubsystem* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsSubsystem>();
	}
};
DUMPER7_ASSERTS_USettingsSubsystem;

// Class SettingsSystem.SettingsSystemPluginSettings
// 0x0050 (0x0088 - 0x0038)
class USettingsSystemPluginSettings final : public UDeveloperSettings
{
public:
	TSet<TSubclassOf<class USettingBase>>         SettingTypes;                                      // 0x0038(0x0050)(Edit, Config, UObjectWrapper, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SettingsSystemPluginSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SettingsSystemPluginSettings")
	}
	static class USettingsSystemPluginSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<USettingsSystemPluginSettings>();
	}
};
DUMPER7_ASSERTS_USettingsSystemPluginSettings;

}

