#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimplePyTorch

#include "Basic.hpp"


namespace SDK
{

// ScriptStruct SimplePyTorch.SimpleTorchTensor
// 0x0090 (0x0090 - 0x0000)
struct FSimpleTorchTensor final
{
public:
	uint8                                         Pad_0[0x8];                                        // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Dimensions;                                        // 0x0008(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bDataOwner;                                        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AddressMultipliersCache;                           // 0x0020(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	int32                                         DataSize;                                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_34[0x5C];                                      // 0x0034(0x005C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSimpleTorchTensor;

}

