#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SimplePyTorch

#include "Basic.hpp"

#include "SimplePyTorch_structs.hpp"


namespace SDK::Params
{

// Function SimplePyTorch.SimpleTorchModule.CreateSimpleTorchModule
// 0x0010 (0x0010 - 0x0000)
struct SimpleTorchModule_CreateSimpleTorchModule final
{
public:
	class UObject*                                InParent;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimpleTorchModule*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SimpleTorchModule_CreateSimpleTorchModule;

// Function SimplePyTorch.SimpleTorchModule.DoForwardCall
// 0x0128 (0x0128 - 0x0000)
struct SimpleTorchModule_DoForwardCall final
{
public:
	struct FSimpleTorchTensor                     InData;                                            // 0x0000(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSimpleTorchTensor                     OutData;                                           // 0x0090(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0120(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_121[0x7];                                      // 0x0121(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SimpleTorchModule_DoForwardCall;

// Function SimplePyTorch.SimpleTorchModule.ExecuteModelMethod
// 0x0138 (0x0138 - 0x0000)
struct SimpleTorchModule_ExecuteModelMethod final
{
public:
	class FString                                 MethodName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSimpleTorchTensor                     InData;                                            // 0x0010(0x0090)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FSimpleTorchTensor                     OutData;                                           // 0x00A0(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0130(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_131[0x7];                                      // 0x0131(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SimpleTorchModule_ExecuteModelMethod;

// Function SimplePyTorch.SimpleTorchModule.LoadTorchScriptModel
// 0x0018 (0x0018 - 0x0000)
struct SimpleTorchModule_LoadTorchScriptModel final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SimpleTorchModule_LoadTorchScriptModel;

// Function SimplePyTorch.SimpleTorchModule.IsTorchModelLoaded
// 0x0001 (0x0001 - 0x0000)
struct SimpleTorchModule_IsTorchModelLoaded final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SimpleTorchModule_IsTorchModelLoaded;

}

