#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Wolf_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"
#include "SK_Wolf_Skeleton_AnimBlueprint_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Wolf_Skeleton_AnimBlueprint.SK_Wolf_Skeleton_AnimBlueprint_C
// 0x0CF0 (0x10B0 - 0x03C0)
class USK_Wolf_Skeleton_AnimBlueprint_C final : public UBaseAnimInstance
{
public:
	uint8                                         Pad_3B8[0x8];                                      // 0x03B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct SK_Wolf_Skeleton_AnimBlueprint::FAnimBlueprintGeneratedMutableData __AnimBlueprintMutables; // 0x03C8(0x0020)(HasGetValueTypeHash)
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_PropertyAccess;             // 0x03E8(0x0008)()
	struct FAnimSubsystemInstance                 AnimBlueprintExtension_Base;                       // 0x03F0(0x0008)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_1;                              // 0x03F8(0x0048)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x0440(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x0508(0x0070)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0578(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x0640(0x0070)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x06B0(0x0048)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x06F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0720(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0748(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x0770(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x0798(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x07C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x07E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0810(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0838(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0860(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x0888(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x08B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x08D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0900(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0928(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0950(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0978(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x09A0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x09C8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_11;                      // 0x0A38(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x0A58(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_10;                      // 0x0AA0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x0AC0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_9;                       // 0x0B08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x0B28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x0B70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x0B90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x0BD8(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x0BF8(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x0C40(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x0C60(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x0CA8(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0CC8(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x0D10(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x0D58(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x0DA0(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x0DC0(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x0E08(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x0E28(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0E70(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0E90(0x0048)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0ED8(0x0020)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0EF8(0x0070)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0F68(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0F88(0x00C8)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x1050(0x0020)()
	bool                                          IsRunning;                                         // 0x1070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InBattle;                                          // 0x1071(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1072[0x6];                                     // 0x1072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        HeadAngleRotation;                                 // 0x1078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          move;                                              // 0x1080(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1081[0x7];                                     // 0x1081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AAnimal_Wolf_C*                         Wolf;                                              // 0x1088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Sniff;                                             // 0x1090(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sit;                                               // 0x1091(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1092[0x2];                                     // 0x1092(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Speed;                                             // 0x1094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Direction;                                         // 0x1098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationZ;                                         // 0x109C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          What_a_voice;                                      // 0x10A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Voce;                                              // 0x10A1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Sleep;                                             // 0x10A2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRotate;                                          // 0x10A3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void BlueprintBeginPlay();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_BlendSpacePlayer_C9BA21DD40D02779EBE7FC9925836921();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0957ECCB4DEE63CF3AD27C9FB56710B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_0FEB475046860AD057FD7A8F6C0D4277();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_115B52DA434DA1F21D1404B35C99C7E7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_1496D4DA495419530D73EF926A8624A0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_2A93CEA74BE73E8B71FE4692FF147F56();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_671FD6C14161A016DA8E43B7A7AE690A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_69F7EF06493080CFBA1326A3F767AE89();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_6B62E5D743C019B5DD95D09631E6F4F0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7AC8583C46BDAEA9704CAD927AA1E0D7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_7EAAED0F4912DA03BB5371BA1B4228DC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_933A00E04408D490015C2E84DE51220B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_BACBF51843E39C4D5B0117A7AD7E7136();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_C80AA3B34320C8E913F89AABC0A08AAA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_CDC9CAF745394BC7D06B1E9BB10A9ECD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_EF2F327E4DD2F674B7FA5EA2297FDB54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_F212223043BFEFDDCD738099B93D63C6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint_AnimGraphNode_TransitionResult_FAD375DA4D3EB804D73E1FB4A97A96EB();
	void ExecuteUbergraph_SK_Wolf_Skeleton_AnimBlueprint(int32 EntryPoint);
	void OnTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("SK_Wolf_Skeleton_AnimBlueprint_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SK_Wolf_Skeleton_AnimBlueprint_C")
	}
	static class USK_Wolf_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Wolf_Skeleton_AnimBlueprint_C>();
	}
};
DUMPER7_ASSERTS_USK_Wolf_Skeleton_AnimBlueprint_C;

}

