#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Smuta

#include "Basic.hpp"

#include "EnhancedInput_structs.hpp"
#include "Smuta_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "DataflowEngine_structs.hpp"
#include "GameDifficultyModule_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "InventorySystemModule_structs.hpp"
#include "CombatHitDetection_structs.hpp"
#include "EnchancedSpline_structs.hpp"
#include "AIModule_structs.hpp"
#include "PhysicsCore_structs.hpp"
#include "SmutaCommon_structs.hpp"


namespace SDK::Params
{

// Function Smuta.ReactionCondition.CheckCondition
// 0x0001 (0x0001 - 0x0000)
struct ReactionCondition_CheckCondition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReactionCondition_CheckCondition;

// Function Smuta.ReactionCondition.StartCondition
// 0x0008 (0x0008 - 0x0000)
struct ReactionCondition_StartCondition final
{
public:
	class AActor*                                 OwnerActor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ReactionCondition_StartCondition;

// Function Smuta.ActorTagCondition.InitCondition
// 0x0050 (0x0050 - 0x0000)
struct ActorTagCondition_InitCondition final
{
public:
	struct FGameplayTagQuery                      InQuery;                                           // 0x0000(0x0048)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 InActor;                                           // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActorTagCondition_InitCondition;

// Function Smuta.ActorTagCondition.OnActorTagChanged
// 0x000C (0x000C - 0x0000)
struct ActorTagCondition_OnActorTagChanged final
{
public:
	struct FGameplayTag                           UpdatedTag;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Exists;                                            // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActorTagCondition_OnActorTagChanged;

// Function Smuta.AbilityBase.CancelAllASCAbilities
// 0x0048 (0x0048 - 0x0000)
struct AbilityBase_CancelAllASCAbilities final
{
public:
	class UAbilitySystemComponent*                ASC;                                               // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  WithTags;                                          // 0x0008(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  WithoutTags;                                       // 0x0028(0x0020)(ConstParm, Parm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityBase_CancelAllASCAbilities;

// Function Smuta.AbilityBase.CommitAbilityWithAttributeCheck
// 0x0048 (0x0048 - 0x0000)
struct AbilityBase_CommitAbilityWithAttributeCheck final
{
public:
	struct FGameplayAttribute                     Attribute;                                         // 0x0000(0x0038)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            CostEffect;                                        // 0x0038(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityBase_CommitAbilityWithAttributeCheck;

// Function Smuta.AbilityBase.GetInputAxisValues
// 0x0008 (0x0008 - 0x0000)
struct AbilityBase_GetInputAxisValues final
{
public:
	float                                         Forward;                                           // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Right;                                             // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityBase_GetInputAxisValues;

// Function Smuta.AbilityBase.SetEffectStackLimit
// 0x0010 (0x0010 - 0x0000)
struct AbilityBase_SetEffectStackLimit final
{
public:
	int32                                         LimitMax;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UGameplayEffect>            CostEffect;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityBase_SetEffectStackLimit;

// Function Smuta.AbilityBase.GetCostValue
// 0x0004 (0x0004 - 0x0000)
struct AbilityBase_GetCostValue final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityBase_GetCostValue;

// Function Smuta.AbilityBase.MakeEffectContextForInstigator
// 0x0020 (0x0020 - 0x0000)
struct AbilityBase_MakeEffectContextForInstigator final
{
public:
	class AActor*                                 Instigator;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectContextHandle           ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityBase_MakeEffectContextForInstigator;

// Function Smuta.AbilityBase.OnAbilityInputComplete
// 0x0020 (0x0020 - 0x0000)
struct AbilityBase_OnAbilityInputComplete final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityBase_OnAbilityInputComplete;

// Function Smuta.AbilityBase.OnAbilityInputStart
// 0x0020 (0x0020 - 0x0000)
struct AbilityBase_OnAbilityInputStart final
{
public:
	struct FInputActionValue                      InputActionValue;                                  // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityBase_OnAbilityInputStart;

// Function Smuta.AbilityCancelerComponent.AddAbilityTagsToCancel
// 0x0028 (0x0028 - 0x0000)
struct AbilityCancelerComponent_AddAbilityTagsToCancel final
{
public:
	struct FGameplayTagContainer                  AbilityTags;                                       // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityCancelerComponent_AddAbilityTagsToCancel;

// Function Smuta.AbilityCancelerComponent.GetAbilityTagsToCancel
// 0x0020 (0x0020 - 0x0000)
struct AbilityCancelerComponent_GetAbilityTagsToCancel final
{
public:
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityCancelerComponent_GetAbilityTagsToCancel;

// Function Smuta.AbilityCancelerComponent.Initialize
// 0x0001 (0x0001 - 0x0000)
struct AbilityCancelerComponent_Initialize final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityCancelerComponent_Initialize;

// Function Smuta.AbilityCancelerComponent.OnMontageBlendingOut
// 0x0010 (0x0010 - 0x0000)
struct AbilityCancelerComponent_OnMontageBlendingOut final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityCancelerComponent_OnMontageBlendingOut;

// Function Smuta.AbilityCancelerComponent.OnMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct AbilityCancelerComponent_OnMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityCancelerComponent_OnMontageEnded;

// Function Smuta.AbilityCancelerComponent.RemoveAbilityTagsToCancel
// 0x0028 (0x0028 - 0x0000)
struct AbilityCancelerComponent_RemoveAbilityTagsToCancel final
{
public:
	struct FGameplayTagContainer                  AbilityTags;                                       // 0x0000(0x0020)(Parm, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0020(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityCancelerComponent_RemoveAbilityTagsToCancel;

// Function Smuta.AbilityCancelerComponent.ShouldCancelAbility
// 0x0001 (0x0001 - 0x0000)
struct AbilityCancelerComponent_ShouldCancelAbility final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityCancelerComponent_ShouldCancelAbility;

// Function Smuta.AITraitsBase.Initialize
// 0x0018 (0x0018 - 0x0000)
struct AITraitsBase_Initialize final
{
public:
	class UAITraitsBase*                          AITraits;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Owner;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAITraitsBase*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_Initialize;

// Function Smuta.AITraitsBase.OnDetectionStateChanged
// 0x0010 (0x0010 - 0x0000)
struct AITraitsBase_OnDetectionStateChanged final
{
public:
	class UEnemyDetectionComponent*               Component;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDetectionAIState                             NewState;                                          // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AITraitsBase_OnDetectionStateChanged;

// Function Smuta.AITraitsBase.SetIsDay
// 0x0001 (0x0001 - 0x0000)
struct AITraitsBase_SetIsDay final
{
public:
	bool                                          bIsDay;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_SetIsDay;

// Function Smuta.AITraitsBase.SetPerceptionDebuff
// 0x0001 (0x0001 - 0x0000)
struct AITraitsBase_SetPerceptionDebuff final
{
public:
	bool                                          Val;                                               // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_SetPerceptionDebuff;

// Function Smuta.AITraitsBase.UpdateGameDifficulty
// 0x0001 (0x0001 - 0x0000)
struct AITraitsBase_UpdateGameDifficulty final
{
public:
	EGameDifficulty                               NewDifficulty;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_UpdateGameDifficulty;

// Function Smuta.AITraitsBase.GetAttributes
// 0x0020 (0x0020 - 0x0000)
struct AITraitsBase_GetAttributes final
{
public:
	struct FAITraits_Attributes                   ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_GetAttributes;

// Function Smuta.AITraitsBase.GetBehavior
// 0x00D0 (0x00D0 - 0x0000)
struct AITraitsBase_GetBehavior final
{
public:
	struct FAITraits_Behavior                     ReturnValue;                                       // 0x0000(0x00D0)(Parm, OutParm, ReturnParm, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_GetBehavior;

// Function Smuta.AITraitsBase.GetGeneralDetectionTraits
// 0x0030 (0x0030 - 0x0000)
struct AITraitsBase_GetGeneralDetectionTraits final
{
public:
	struct FAITraits_DetectionGeneral             OutTraits;                                         // 0x0000(0x002C)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x002C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AITraitsBase_GetGeneralDetectionTraits;

// Function Smuta.AITraitsBase.GetPerceptionV2
// 0x00D0 (0x00D0 - 0x0000)
struct AITraitsBase_GetPerceptionV2 final
{
public:
	struct FAITraits_PerceptionV2                 OutPerception;                                     // 0x0000(0x00C8)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x00C8(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AITraitsBase_GetPerceptionV2;

// Function Smuta.AITraitsBase.GetSettingsDataByTag
// 0x0010 (0x0010 - 0x0000)
struct AITraitsBase_GetSettingsDataByTag final
{
public:
	struct FGameplayTag                           Tag;                                               // 0x0000(0x0008)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_GetSettingsDataByTag;

// Function Smuta.AITraitsBase.IsDay
// 0x0001 (0x0001 - 0x0000)
struct AITraitsBase_IsDay final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_IsDay;

// Function Smuta.AITraitsBase.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct AITraitsBase_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_IsInitialized;

// Function Smuta.AITraitsBase.IsPerceptionDebuff
// 0x0001 (0x0001 - 0x0000)
struct AITraitsBase_IsPerceptionDebuff final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AITraitsBase_IsPerceptionDebuff;

// Function Smuta.AsyncTaskAttributeChanged.ListenForAttributeChange
// 0x0048 (0x0048 - 0x0000)
struct AsyncTaskAttributeChanged_ListenForAttributeChange final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x0008(0x0038)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAsyncTaskAttributeChanged*             ReturnValue;                                       // 0x0040(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTaskAttributeChanged_ListenForAttributeChange;

// Function Smuta.AsyncTaskAttributeChanged.ListenForAttributesChange
// 0x0020 (0x0020 - 0x0000)
struct AsyncTaskAttributeChanged_ListenForAttributesChange final
{
public:
	class UAbilitySystemComponent*                AbilitySystemComponent;                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGameplayAttribute>             Attributes;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAsyncTaskAttributeChanged*             ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncTaskAttributeChanged_ListenForAttributesChange;

// Function Smuta.SpawnerPointBase.GetCharacter
// 0x0008 (0x0008 - 0x0000)
struct SpawnerPointBase_GetCharacter final
{
public:
	class ADefaultCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SpawnerPointBase_GetCharacter;

// Function Smuta.MatrixSpawnerBase.GetDNCClass
// 0x0008 (0x0008 - 0x0000)
struct MatrixSpawnerBase_GetDNCClass final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MatrixSpawnerBase_GetDNCClass;

// Function Smuta.MatrixSpawnerBase.Spawn
// 0x0010 (0x0010 - 0x0000)
struct MatrixSpawnerBase_Spawn final
{
public:
	class UMatrixDataAsset*                       MatrixDataAsset;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ADefaultCharacter*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MatrixSpawnerBase_Spawn;

// Function Smuta.EquipmentFunctionLibrary.CanReloadWeapon
// 0x0018 (0x0018 - 0x0000)
struct EquipmentFunctionLibrary_CanReloadWeapon final
{
public:
	class UAbilitySystemComponent*                OwnerASC;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URangeWeaponItem*                       Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NeedToRestoreAmmo;                                 // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentFunctionLibrary_CanReloadWeapon;

// Function Smuta.EquipmentFunctionLibrary.IsEnoughWeaponAmmo
// 0x0018 (0x0018 - 0x0000)
struct EquipmentFunctionLibrary_IsEnoughWeaponAmmo final
{
public:
	class UAbilitySystemComponent*                OwnerASC;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URangeWeaponItem*                       Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentFunctionLibrary_IsEnoughWeaponAmmo;

// Function Smuta.EquipmentFunctionLibrary.ReduceWeaponAmmo
// 0x0018 (0x0018 - 0x0000)
struct EquipmentFunctionLibrary_ReduceWeaponAmmo final
{
public:
	class UAbilitySystemComponent*                OwnerASC;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URangeWeaponItem*                       Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AmmoCount;                                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_EquipmentFunctionLibrary_ReduceWeaponAmmo;

// Function Smuta.EquipmentFunctionLibrary.ReloadWeapon
// 0x0010 (0x0010 - 0x0000)
struct EquipmentFunctionLibrary_ReloadWeapon final
{
public:
	class UAbilitySystemComponent*                OwnerASC;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URangeWeaponItem*                       Weapon;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_EquipmentFunctionLibrary_ReloadWeapon;

// Function Smuta.AbilityFunctionLibrary.ApplyGameplayEffectByClass
// 0x0018 (0x0018 - 0x0000)
struct AbilityFunctionLibrary_ApplyGameplayEffectByClass final
{
public:
	const class UAbilitySystemComponent*          AbilitySystemComponent;                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayEffect>            EffectClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActiveGameplayEffectHandle            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_ApplyGameplayEffectByClass;

// Function Smuta.AbilityFunctionLibrary.ChangeAttributeValue
// 0x0048 (0x0048 - 0x0000)
struct AbilityFunctionLibrary_ChangeAttributeValue final
{
public:
	class UAbilitySystemComponent*                Target;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x0008(0x0038)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewValue;                                          // 0x0040(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayModOp                                ModifierOp;                                        // 0x0044(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_45[0x3];                                       // 0x0045(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_ChangeAttributeValue;

// Function Smuta.AbilityFunctionLibrary.GetAbilityFromSpec
// 0x00A0 (0x00A0 - 0x0000)
struct AbilityFunctionLibrary_GetAbilityFromSpec final
{
public:
	struct FGameplayAbilitySpecDef                Spec;                                              // 0x0000(0x0098)(Parm, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>           ReturnValue;                                       // 0x0098(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetAbilityFromSpec;

// Function Smuta.AbilityFunctionLibrary.GetAttributeMagnitude
// 0x0060 (0x0060 - 0x0000)
struct AbilityFunctionLibrary_GetAttributeMagnitude final
{
public:
	struct FGameplayEffectSpecHandle              SpecHandle;                                        // 0x0000(0x0010)(Parm, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                Source;                                            // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                Target;                                            // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x0020(0x0038)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0058(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetAttributeMagnitude;

// Function Smuta.AbilityFunctionLibrary.GetBaseAbilityComponent
// 0x0018 (0x0018 - 0x0000)
struct AbilityFunctionLibrary_GetBaseAbilityComponent final
{
public:
	const class AActor*                           Target;                                            // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Result;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UBaseAbilitiesComponent*                ReturnValue;                                       // 0x0010(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetBaseAbilityComponent;

// Function Smuta.AbilityFunctionLibrary.GetCapturedAttributeMagnitudePure
// 0x02E8 (0x02E8 - 0x0000)
struct AbilityFunctionLibrary_GetCapturedAttributeMagnitudePure final
{
public:
	const class UGameplayModMagnitudeCalculation* ModMagnitude;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayEffectSpec                    Spec;                                              // 0x0008(0x0298)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                     Attribute;                                         // 0x02A0(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGameplayEffectAttributeCaptureSource         AttributeSource;                                   // 0x02D8(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OutMagnitude;                                      // 0x02DC(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x02E0(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E1[0x7];                                      // 0x02E1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetCapturedAttributeMagnitudePure;

// Function Smuta.AbilityFunctionLibrary.GetCharacterMeshLegsPosition
// 0x0020 (0x0020 - 0x0000)
struct AbilityFunctionLibrary_GetCharacterMeshLegsPosition final
{
public:
	class USkeletalMeshComponent*                 CharacterMesh;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   LeftLegBoneName;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   RightLegBoneName;                                  // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELegsPosition                                 ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetCharacterMeshLegsPosition;

// Function Smuta.AbilityFunctionLibrary.GetEnemyDirection
// 0x0018 (0x0018 - 0x0000)
struct AbilityFunctionLibrary_GetEnemyDirection final
{
public:
	class AActor*                                 Source;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 Target;                                            // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnemyPosition                                ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetEnemyDirection;

// Function Smuta.AbilityFunctionLibrary.GetInstigatorFromSpec
// 0x02A0 (0x02A0 - 0x0000)
struct AbilityFunctionLibrary_GetInstigatorFromSpec final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x0298)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class AActor*                                 ReturnValue;                                       // 0x0298(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetInstigatorFromSpec;

// Function Smuta.AbilityFunctionLibrary.GetSourceActorTags
// 0x02B8 (0x02B8 - 0x0000)
struct AbilityFunctionLibrary_GetSourceActorTags final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x0298)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0298(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetSourceActorTags;

// Function Smuta.AbilityFunctionLibrary.GetTargetActorTags
// 0x02B8 (0x02B8 - 0x0000)
struct AbilityFunctionLibrary_GetTargetActorTags final
{
public:
	struct FGameplayEffectSpec                    Spec;                                              // 0x0000(0x0298)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  ReturnValue;                                       // 0x0298(0x0020)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityFunctionLibrary_GetTargetActorTags;

// Function Smuta.ActivatedActorChangeStateCondition.OnActorStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ActivatedActorChangeStateCondition_OnActorStateChanged final
{
public:
	EActivatedObjectState                         NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivatedActorChangeStateCondition_OnActorStateChanged;

// Function Smuta.AbilityTask_OnTick.AbilityTaskOnTick
// 0x0018 (0x0018 - 0x0000)
struct AbilityTask_OnTick_AbilityTaskOnTick final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TaskInstanceName;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAbilityTask_OnTick*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_OnTick_AbilityTaskOnTick;

// Function Smuta.BaseActionData.GetMontage
// 0x0058 (0x0058 - 0x0000)
struct BaseActionData_GetMontage final
{
public:
	EEquipmentType                                EquipmentType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  Tags;                                              // 0x0008(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         PairDistance;                                      // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            ReturnValue;                                       // 0x0030(0x0028)(Parm, OutParm, ReturnParm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_BaseActionData_GetMontage;

// Function Smuta.AbilityTask_WaitInputActionPressed.WaitInputActionPressed
// 0x0020 (0x0020 - 0x0000)
struct AbilityTask_WaitInputActionPressed_WaitInputActionPressed final
{
public:
	class UGameplayAbility*                       OwningAbility;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bTestAlreadyPressed;                               // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActionName;                                        // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   EventType;                                         // 0x0014(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitInputActionPressed*    ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AbilityTask_WaitInputActionPressed_WaitInputActionPressed;

// Function Smuta.CombatTrickAbility.SetTrickFail
// 0x0004 (0x0004 - 0x0000)
struct CombatTrickAbility_SetTrickFail final
{
public:
	float                                         FailRate;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CombatTrickAbility_SetTrickFail;

// Function Smuta.CombatTrickAbility.SetTrickSuccess
// 0x0010 (0x0010 - 0x0000)
struct CombatTrickAbility_SetTrickSuccess final
{
public:
	float                                         SuccessRate;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 AgainstCharacter;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CombatTrickAbility_SetTrickSuccess;

// Function Smuta.CombatTrickAbility.GetAttackerAbilityComponent
// 0x0008 (0x0008 - 0x0000)
struct CombatTrickAbility_GetAttackerAbilityComponent final
{
public:
	class UBaseAbilitiesComponent*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CombatTrickAbility_GetAttackerAbilityComponent;

// Function Smuta.CombatTrickAbility.GetAttackerActor
// 0x0008 (0x0008 - 0x0000)
struct CombatTrickAbility_GetAttackerActor final
{
public:
	class ADefaultCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CombatTrickAbility_GetAttackerActor;

// Function Smuta.CombatTrickAbility.GetDefenderAbilityComponent
// 0x0008 (0x0008 - 0x0000)
struct CombatTrickAbility_GetDefenderAbilityComponent final
{
public:
	class UBaseAbilitiesComponent*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CombatTrickAbility_GetDefenderAbilityComponent;

// Function Smuta.CombatTrickAbility.GetDefenderActor
// 0x0008 (0x0008 - 0x0000)
struct CombatTrickAbility_GetDefenderActor final
{
public:
	class ADefaultCharacter*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CombatTrickAbility_GetDefenderActor;

// Function Smuta.ActionAnimationEffectComponent.OnActionMontageEnded
// 0x0010 (0x0010 - 0x0000)
struct ActionAnimationEffectComponent_OnActionMontageEnded final
{
public:
	class UAnimMontage*                           Montage;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInterrupted;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActionAnimationEffectComponent_OnActionMontageEnded;

// Function Smuta.WidgetComponentUMG.GetOwningActor
// 0x0008 (0x0008 - 0x0000)
struct WidgetComponentUMG_GetOwningActor final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WidgetComponentUMG_GetOwningActor;

// Function Smuta.ComboActionData.GetAnimMetaData
// 0x0038 (0x0038 - 0x0000)
struct ComboActionData_GetAnimMetaData final
{
public:
	TSubclassOf<class UAnimMetaData>              DataTypeClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>            Montage;                                           // 0x0008(0x0028)(Parm, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMetaData*                          ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ComboActionData_GetAnimMetaData;

// Function Smuta.ComboActionData.GetAnimMetaDataFromMontagePtr
// 0x0018 (0x0018 - 0x0000)
struct ComboActionData_GetAnimMetaDataFromMontagePtr final
{
public:
	TSubclassOf<class UAnimMetaData>              DataTypeClass;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMetaData*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ComboActionData_GetAnimMetaDataFromMontagePtr;

// Function Smuta.ActionDataAsset.GetActionData
// 0x0028 (0x0028 - 0x0000)
struct ActionDataAsset_GetActionData final
{
public:
	class UActionDataAsset*                       DataAsset;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeleton*                              Skeleton;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UBaseActionData>            ActionClass;                                       // 0x0010(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActionTag;                                         // 0x0018(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseActionData*                        ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActionDataAsset_GetActionData;

// Function Smuta.ActionDataAsset.GetActionDataWithTag
// 0x0020 (0x0020 - 0x0000)
struct ActionDataAsset_GetActionDataWithTag final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UBaseActionData>            ActionClass;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           ActionTag;                                         // 0x0010(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseActionData*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActionDataAsset_GetActionDataWithTag;

// Function Smuta.AppearanceDataAsset.SetPlayerAppearance
// 0x0010 (0x0010 - 0x0000)
struct AppearanceDataAsset_SetPlayerAppearance final
{
public:
	const class UAppearanceDataAsset*             Appearance;                                        // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class UObject*                          WorldContext;                                      // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AppearanceDataAsset_SetPlayerAppearance;

// Function Smuta.SmutaEquipmentComponent.TagChangedResponse
// 0x000C (0x000C - 0x0000)
struct SmutaEquipmentComponent_TagChangedResponse final
{
public:
	struct FGameplayTag                           UpdatedTag;                                        // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bExists;                                           // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SmutaEquipmentComponent_TagChangedResponse;

// Function Smuta.HumanPOI.FilterDialogue
// 0x0020 (0x0020 - 0x0000)
struct HumanPOI_FilterDialogue final
{
public:
	EHumanRoleType                                FirstCharType;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHumanRoleType                                SecondCharType;                                    // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenderType                                   FirstCharGender;                                   // 0x0002(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EGenderType                                   SecondCharGender;                                  // 0x0003(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UMatrixDialogue*>                Dialogues;                                         // 0x0008(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	class UMatrixDialogue*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_HumanPOI_FilterDialogue;

// Function Smuta.ActionRollComponent.InitializeTraits
// 0x0008 (0x0008 - 0x0000)
struct ActionRollComponent_InitializeTraits final
{
public:
	class UAITraitsBase*                          Traits;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActionRollComponent_InitializeTraits;

// Function Smuta.ActionRollComponent.RollAction
// 0x000C (0x000C - 0x0000)
struct ActionRollComponent_RollAction final
{
public:
	Smuta::ENPCAction                             Action;                                            // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          OverrideBaseChance;                                // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BaseChanceOverridedValue;                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ActionRollComponent_RollAction;

// Function Smuta.ActivatedActor.ChangeActivateObjectState
// 0x0001 (0x0001 - 0x0000)
struct ActivatedActor_ChangeActivateObjectState final
{
public:
	EActivatedObjectState                         NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivatedActor_ChangeActivateObjectState;

// Function Smuta.ActivatedActor.GetHitPointReceiverComponent
// 0x0008 (0x0008 - 0x0000)
struct ActivatedActor_GetHitPointReceiverComponent final
{
public:
	class UPrimitiveComponent*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivatedActor_GetHitPointReceiverComponent;

// Function Smuta.ActivatedActor.OnReceiverComponentHit
// 0x0118 (0x0118 - 0x0000)
struct ActivatedActor_OnReceiverComponentHit final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivatedActor_OnReceiverComponentHit;

// Function Smuta.ActivatedActor.PreChangeActivateObjectState
// 0x0001 (0x0001 - 0x0000)
struct ActivatedActor_PreChangeActivateObjectState final
{
public:
	EActivatedObjectState                         NewState;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ActivatedActor_PreChangeActivateObjectState;

// Function Smuta.SignificanceActorComponent.GetSkipOtimization
// 0x0001 (0x0001 - 0x0000)
struct SignificanceActorComponent_GetSkipOtimization final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SignificanceActorComponent_GetSkipOtimization;

// Function Smuta.SignificanceActorComponent.SetSkipOptimization
// 0x0001 (0x0001 - 0x0000)
struct SignificanceActorComponent_SetSkipOptimization final
{
public:
	bool                                          bSkip;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SignificanceActorComponent_SetSkipOptimization;

// Function Smuta.AISense_Smuta_Hearing.ReportSmutaNoiseEvent
// 0x0040 (0x0040 - 0x0000)
struct AISense_Smuta_Hearing_ReportSmutaNoiseEvent final
{
public:
	class UObject*                                WorldContextObject;                                // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                NoiseLocation;                                     // 0x0008(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseRadius;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 Instigator;                                        // 0x0028(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxRange;                                          // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
