#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Smuta

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CombatHitDetection_structs.hpp"
#include "CommandExtention_structs.hpp"
#include "InventorySystemModule_structs.hpp"
#include "Engine_structs.hpp"
#include "SubtitlesSystem_structs.hpp"
#include "PhysicsCore_structs.hpp"


namespace SDK
{

// Enum Smuta.EGroundMovementMode
// NumValues: 0x0005
enum class EGroundMovementMode : uint8
{
	Walk                                     = 0,
	Run                                      = 1,
	Sprint                                   = 2,
	Crouch                                   = 3,
	EGroundMovementMode_MAX                  = 4,
};

// Enum Smuta.EDetectionAIState
// NumValues: 0x0007
enum class EDetectionAIState : uint8
{
	Calm                                     = 0,
	Suspicion                                = 1,
	Search                                   = 2,
	Found                                    = 3,
	Battle                                   = 4,
	Dead                                     = 5,
	EDetectionAIState_MAX                    = 6,
};

// Enum Smuta.EEvidenceState
// NumValues: 0x0005
enum class EEvidenceState : uint8
{
	None                                     = 0,
	Waited                                   = 1,
	Activated                                = 2,
	Deactivated                              = 3,
	EEvidenceState_MAX                       = 4,
};

// Enum Smuta.ESmutaDLCFraction
// NumValues: 0x0008
enum class ESmutaDLCFraction : uint8
{
	SDF_None                                 = 0,
	SDF_Fraction1                            = 1,
	SDF_Fraction2                            = 2,
	SDF_Fraction3                            = 3,
	SDF_Fraction4                            = 4,
	SDF_Fraction5                            = 5,
	SDF_Fraction6                            = 6,
	SDF_Max                                  = 7,
};

// Enum Smuta.EInteractionActorState
// NumValues: 0x0004
enum class EInteractionActorState : uint8
{
	None                                     = 0,
	Activated                                = 1,
	Deactivated                              = 2,
	EInteractionActorState_MAX               = 3,
};

// Enum Smuta.ENPCBehaviorState
// NumValues: 0x0005
enum class ENPCBehaviorState : uint8
{
	Calm                                     = 0,
	Search                                   = 1,
	InBattle                                 = 2,
	Flee                                     = 3,
	ENPCBehaviorState_MAX                    = 4,
};

// Enum Smuta.EActivatedObjectState
// NumValues: 0x0004
enum class EActivatedObjectState : uint8
{
	AOS_None                                 = 0,
	AOS_Activated                            = 1,
	AOS_Deactivated                          = 2,
	AOS_MAX                                  = 3,
};

// Enum Smuta.ESpyCameraState
// NumValues: 0x0005
enum class ESpyCameraState : uint8
{
	None                                     = 0,
	Waited                                   = 1,
	Activated                                = 2,
	Deactivated                              = 3,
	ESpyCameraState_MAX                      = 4,
};

// Enum Smuta.ESupportEvidenceStatus
// NumValues: 0x0004
enum class ESupportEvidenceStatus : uint8
{
	None                                     = 0,
	Locked                                   = 1,
	Unlocked                                 = 2,
	ESupportEvidenceStatus_MAX               = 3,
};

// Enum Smuta.ENPCAnimatedArmId
// NumValues: 0x0005
enum class ENPCAnimatedArmId : uint8
{
	AAI_None                                 = 0,
	AAI_Left                                 = 1,
	AAI_Right                                = 2,
	AAI_Both                                 = 3,
	AAI_MAX                                  = 4,
};

// Enum Smuta.EAbilityInputID
// NumValues: 0x0019
enum class EAbilityInputID : uint8
{
	None                                     = 0,
	Confirm                                  = 1,
	Cancel                                   = 2,
	Sprint                                   = 3,
	SprintGamepad                            = 4,
	Jump                                     = 5,
	Mount                                    = 6,
	LightAttack                              = 7,
	HeavyAttack                              = 8,
	KickAttack                               = 9,
	VigorousAttack                           = 10,
	RangeAttack                              = 11,
	AimMode                                  = 12,
	Reload                                   = 13,
	FencingDefence                           = 14,
	DodgeDefence                             = 15,
	WeaponSwitch                             = 16,
	RangeWeaponFirstSlot                     = 17,
	RangeWeaponSecondSlot                    = 18,
	UseConsumable                            = 19,
	Intuition                                = 20,
	Search                                   = 21,
	StealthSwitch                            = 22,
	Distract                                 = 23,
	EAbilityInputID_MAX                      = 24,
};

// Enum Smuta.EMontageTagSelectionApproach
// NumValues: 0x0005
enum class EMontageTagSelectionApproach : uint8
{
	MTS_ByDefaultTagOnly                     = 0,
	MTS_ByCurrentMontageMetaData             = 1,
	MTS_ByOwnerActorTags                     = 2,
	MTS_ByInstigatorActorTags                = 3,
	MTS_MAX                                  = 4,
};

// Enum Smuta.EShootType
// NumValues: 0x0004
enum class EShootType : uint8
{
	None                                     = 0,
	Quick                                    = 1,
	Aimed                                    = 2,
	EShootType_MAX                           = 3,
};

// Enum Smuta.EAimStand
// NumValues: 0x0004
enum class EAimStand : uint8
{
	None                                     = 0,
	Stand                                    = 1,
	Crouch                                   = 2,
	EAimStand_MAX                            = 3,
};

// Enum Smuta.EShootAnimationType
// NumValues: 0x0009
enum class EShootAnimationType : uint8
{
	None                                     = 0,
	StartAim                                 = 1,
	IdleAim                                  = 2,
	Shoot                                    = 3,
	ReleaseAim                               = 4,
	NoAmmo                                   = 5,
	Reload                                   = 6,
	IdleAimBlocked                           = 7,
	EShootAnimationType_MAX                  = 8,
};

// Enum Smuta.EAimCenterMoveAnimationType
// NumValues: 0x0004
enum class EAimCenterMoveAnimationType : uint8
{
	None                                     = 0,
	Increase                                 = 1,
	Decrease                                 = 2,
	EAimCenterMoveAnimationType_MAX          = 3,
};

// Enum Smuta.EAimNotchMoveAnimationType
// NumValues: 0x0004
enum class EAimNotchMoveAnimationType : uint8
{
	None                                     = 0,
	Shrink                                   = 1,
	Expand                                   = 2,
	EAimNotchMoveAnimationType_MAX           = 3,
};

// Enum Smuta.EAimNotchSizeAnimationType
// NumValues: 0x0004
enum class EAimNotchSizeAnimationType : uint8
{
	None                                     = 0,
	Increase                                 = 1,
	Decrease                                 = 2,
	EAimNotchSizeAnimationType_MAX           = 3,
};

// Enum Smuta.EAimNotchElementPosition
// NumValues: 0x000A
enum class EAimNotchElementPosition : uint8
{
	None                                     = 0,
	Notch_TopLeft                            = 1,
	Notch_TopMid                             = 2,
	Notch_TopRight                           = 3,
	Notch_MidLeft                            = 4,
	Notch_MidRight                           = 5,
	Notch_BottomLeft                         = 6,
	Notch_BottomMid                          = 7,
	Notch_BottomRight                        = 8,
	EAimNotchElementPosition_MAX             = 9,
};

// Enum Smuta.ENPCAction
// NumValues: 0x0009
enum class Smuta::ENPCAction : uint8
{
	None                                     = 0,
	Hit                                      = 1,
	Agression                                = 2,
	Defence                                  = 3,
	LightAttack                              = 4,
	AttackSkill                              = 5,
	Kick                                     = 6,
	Dodge                                    = 7,
	ENPCAction_MAX                           = 8,
};

// Enum Smuta.EAnimalType
// NumValues: 0x0004
enum class EAnimalType : uint8
{
	None                                     = 0,
	Deer                                     = 1,
	Fox                                      = 2,
	EAnimalType_MAX                          = 3,
};

// Enum Smuta.EAnimalState
// NumValues: 0x0008
enum class EAnimalState : uint8
{
	None                                     = 0,
	Stand                                    = 1,
	Walk                                     = 2,
	Run                                      = 3,
	Eat                                      = 4,
	Rest                                     = 5,
	Hunt                                     = 6,
	EAnimalState_MAX                         = 7,
};

// Enum Smuta.EForestRestState
// NumValues: 0x0005
enum class EForestRestState : uint8
{
	None                                     = 0,
	Start                                    = 1,
	Idle                                     = 2,
	Finish                                   = 3,
	EForestRestState_MAX                     = 4,
};

// Enum Smuta.EForestEatState
// NumValues: 0x0004
enum class EForestEatState : uint8
{
	None                                     = 0,
	Digging                                  = 1,
	Action                                   = 2,
	EForestEatState_MAX                      = 3,
};

// Enum Smuta.ERoute
// NumValues: 0x0005
enum class ERoute : uint8
{
	Forward                                  = 0,
	Left                                     = 1,
	Right                                    = 2,
	Back                                     = 3,
	ERoute_MAX                               = 4,
};

// Enum Smuta.EAttackAbilityEndReason
// NumValues: 0x0005
enum class EAttackAbilityEndReason : uint8
{
	None                                     = 0,
	MontageInterrupt                         = 1,
	MontageEnd                               = 2,
	Canceled                                 = 3,
	EAttackAbilityEndReason_MAX              = 4,
};

// Enum Smuta.EAttackAnimationRandomType
// NumValues: 0x0004
enum class EAttackAnimationRandomType : uint8
{
	DefaultRandom                            = 0,
	ExclusiveRandom                          = 1,
	Queue                                    = 2,
	EAttackAnimationRandomType_MAX           = 3,
};

// Enum Smuta.EAttackStage
// NumValues: 0x0005
enum class EAttackStage : uint8
{
	None                                     = 0,
	Preparation                              = 1,
	Execution                                = 2,
	Recover                                  = 3,
	EAttackStage_MAX                         = 4,
};

// Enum Smuta.EWaterSurfaceType
// NumValues: 0x0004
enum class EWaterSurfaceType : uint8
{
	NoWater                                  = 0,
	CleanWater                               = 1,
	SwampWater                               = 2,
	EWaterSurfaceType_MAX                    = 3,
};

// Enum Smuta.EFightAction
// NumValues: 0x000E
enum class EFightAction : uint8
{
	None                                     = 0,
	LightAttack                              = 1,
	HeavyAttack                              = 2,
	DefaultAttack                            = 3,
	UblockableAttack                         = 4,
	UnparryAttack                            = 5,
	Block                                    = 6,
	Dodge                                    = 7,
	Parry                                    = 8,
	Kick                                     = 9,
	RangeAttack                              = 10,
	Hit                                      = 11,
	Finisher                                 = 12,
	EFightAction_MAX                         = 13,
};

// Enum Smuta.ECityAnimalType
// NumValues: 0x0004
enum class ECityAnimalType : uint8
{
	None                                     = 0,
	Dog                                      = 1,
	Cat                                      = 2,
	ECityAnimalType_MAX                      = 3,
};

// Enum Smuta.ECodexImageLayout
// NumValues: 0x0004
enum class ECodexImageLayout : uint8
{
	Left                                     = 0,
	Top                                      = 1,
	Count                                    = 2,
	ECodexImageLayout_MAX                    = 3,
};

// Enum Smuta.ECodexTriggerShape
// NumValues: 0x0004
enum class ECodexTriggerShape : uint8
{
	Cube                                     = 0,
	Sphere                                   = 1,
	Capsule                                  = 2,
	ECodexTriggerShape_MAX                   = 3,
};

// Enum Smuta.EComboType
// NumValues: 0x0005
enum class EComboType : uint8
{
	None                                     = 0,
	Light                                    = 1,
	Heavy                                    = 2,
	Mixed                                    = 3,
	EComboType_MAX                           = 4,
};

// Enum Smuta.EComboAttackType
// NumValues: 0x0005
enum class EComboAttackType : uint8
{
	None                                     = 0,
	Starter                                  = 1,
	Middle                                   = 2,
	Finisher                                 = 3,
	EComboAttackType_MAX                     = 4,
};

// Enum Smuta.EAttackType
// NumValues: 0x0005
enum class EAttackType : uint8
{
	None                                     = 0,
	Light                                    = 1,
	Heavy                                    = 2,
	Range                                    = 3,
	EAttackType_MAX                          = 4,
};

// Enum Smuta.EEnemyPosition
// NumValues: 0x0006
enum class EEnemyPosition : uint8
{
	InFront                                  = 0,
	Left                                     = 1,
	Right                                    = 2,
	BehindLeft                               = 3,
	BehindRight                              = 4,
	EEnemyPosition_MAX                       = 5,
};

// Enum Smuta.EWeaponPosition
// NumValues: 0x0004
enum class EWeaponPosition : uint8
{
	Default                                  = 0,
	Left                                     = 1,
	Right                                    = 2,
	EWeaponPosition_MAX                      = 3,
};

// Enum Smuta.ELegsPosition
// NumValues: 0x0004
enum class ELegsPosition : uint8
{
	Default                                  = 0,
	LeftLegForward                           = 1,
	RightLegForward                          = 2,
	ELegsPosition_MAX                        = 3,
};

// Enum Smuta.EDirectionSide
// NumValues: 0x0006
enum class EDirectionSide : uint8
{
	DS_None                                  = 0,
	DS_Front                                 = 1,
	DS_Back                                  = 2,
	DS_Left                                  = 3,
	DS_Right                                 = 4,
	DS_MAX                                   = 5,
};

// Enum Smuta.EStimulusType
// NumValues: 0x0008
enum class EStimulusType : uint8
{
	None                                     = 0,
	Stone                                    = 1,
	NPC                                      = 2,
	NPC_Corpse                               = 3,
	NPC_Sleep                                = 4,
	NPC_Help                                 = 5,
	Player                                   = 6,
	EStimulusType_MAX                        = 7,
};

// Enum Smuta.ESenseType
// NumValues: 0x0005
enum class ESenseType : uint8
{
	Other                                    = 0,
	Sight                                    = 1,
	Hearing                                  = 2,
	SixSense                                 = 3,
	ESenseType_MAX                           = 4,
};

// Enum Smuta.EHearingSenseType
// NumValues: 0x0010
enum class EHearingSenseType : uint8
{
	Default                                  = 0,
	Walking                                  = 1,
	Running                                  = 2,
	Crouch                                   = 3,
	CrouchRunning                            = 4,
	Attack                                   = 5,
	RangeAttack                              = 6,
	Death                                    = 7,
	Stone                                    = 8,
	StoneHit                                 = 9,
	Pistol                                   = 10,
	PistolHit                                = 11,
	Knife                                    = 12,
	KnifeHit                                 = 13,
	KnockOut                                 = 14,
	MAX                                      = 15,
};

// Enum Smuta.EFraction
// NumValues: 0x0013
enum class EFraction : uint8
{
	None                                     = 0,
	Player                                   = 1,
	QuestGiver                               = 2,
	CommonEnemy                              = 3,
	CommonEnemyLow                           = 4,
	CommonEnemyHigh                          = 5,
	Peasant                                  = 6,
	Townsman                                 = 7,
	Strelets                                 = 8,
	Pole                                     = 9,
	PoleMiddle                               = 10,
	Brigand                                  = 11,
	German                                   = 12,
	Cherkas                                  = 13,
	Cossack                                  = 14,
	Animal                                   = 15,
	Pet                                      = 16,
	Fraction_Max                             = 17,
	EFraction_MAX                            = 18,
};

// Enum Smuta.EExtendedAttitude
// NumValues: 0x0005
enum class EExtendedAttitude : uint8
{
	Friendly                                 = 0,
	Neutral                                  = 1,
	Hostile                                  = 2,
	ScaryOf                                  = 3,
	EExtendedAttitude_MAX                    = 4,
};

// Enum Smuta.EAttackState2
// NumValues: 0x0008
enum class EAttackState2 : uint8
{
	Locomotion                               = 0,
	LightAttack                              = 1,
	HeavyAttack                              = 2,
	Evade                                    = 3,
	Block                                    = 4,
	GotHit                                   = 5,
	Dying                                    = 6,
	EAttackState2_MAX                        = 7,
};

// Enum Smuta.EAttackLevel2
// NumValues: 0x0004
enum class EAttackLevel2 : uint8
{
	Low                                      = 0,
	Middle                                   = 1,
	High                                     = 2,
	EAttackLevel2_MAX                        = 3,
};

// Enum Smuta.EAttackSide2
// NumValues: 0x0007
enum class EAttackSide2 : uint8
{
	LeftToRight                              = 0,
	RightToLeft                              = 1,
	TopDown                                  = 2,
	Forward                                  = 3,
	UpperCut                                 = 4,
	Back                                     = 5,
	EAttackSide2_MAX                         = 6,
};

// Enum Smuta.ItemType
// NumValues: 0x0007
enum class Smuta::EItemType : uint8
{
	Item_Other                               = 0,
	Item_Saber                               = 1,
	Item_Axe                                 = 2,
	Item_Cure                                = 3,
	Item_Bardiche                            = 4,
	Item_Knife_Torch                         = 5,
	Item_MAX                                 = 6,
};

// Enum Smuta.EEvidenceType
// NumValues: 0x0005
enum class EEvidenceType : uint8
{
	None                                     = 0,
	Static                                   = 1,
	Skeletal                                 = 2,
	Decal                                    = 3,
	EEvidenceType_MAX                        = 4,
};

// Enum Smuta.EEvidenceInteraction
// NumValues: 0x0004
enum class EEvidenceInteraction : uint8
{
	None                                     = 0,
	PickUp                                   = 1,
	Check                                    = 2,
	EEvidenceInteraction_MAX                 = 3,
};

// Enum Smuta.EEvidenceAnimationMode
// NumValues: 0x0005
enum class EEvidenceAnimationMode : uint8
{
	TurnToEvidence                           = 0,
	TurnToEvidenceArrow                      = 1,
	WarpToEvidence                           = 2,
	WarpAndTurn                              = 3,
	EEvidenceAnimationMode_MAX               = 4,
};

// Enum Smuta.EInvestigationTrackingMode
// NumValues: 0x0006
enum class EInvestigationTrackingMode : uint8
{
	Right                                    = 0,
	RightClose                               = 1,
	Left                                     = 2,
	LeftClose                                = 3,
	Neutral                                  = 4,
	EInvestigationTrackingMode_MAX           = 5,
};

// Enum Smuta.EFootprintsType
// NumValues: 0x0003
enum class EFootprintsType : uint8
{
	Independent                              = 0,
	FromArea                                 = 1,
	EFootprintsType_MAX                      = 2,
};

// Enum Smuta.EFractionState
// NumValues: 0x0005
enum class EFractionState : uint8
{
	None                                     = 0,
	Normal                                   = 1,
	Secret                                   = 2,
	Dead                                     = 3,
	EFractionState_MAX                       = 4,
};

// Enum Smuta.EHumanRoleType
// NumValues: 0x0013
enum class EHumanRoleType : uint8
{
	None                                     = 0,
	Bezdelnik                                = 1,
	Prodavets                                = 2,
	Povar                                    = 3,
	SborshchikSena                           = 4,
	Loshadnik                                = 5,
	Kurnik                                   = 6,
	Remeslenik                               = 7,
	Sobiratel                                = 8,
	Shkuroder                                = 9,
	Kuznec                                   = 10,
	Prachka                                  = 11,
	Doyarka                                  = 12,
	Pyanitsa                                 = 13,
	Prokhozhiy                               = 14,
	Gusyatnik                                = 15,
	Dozorniy                                 = 16,
	Ozhidayushchiy                           = 17,
	EHumanRoleType_MAX                       = 18,
};

// Enum Smuta.EHumanAnimState
// NumValues: 0x0007
enum class EHumanAnimState : uint8
{
	Stand                                    = 0,
	Walk                                     = 1,
	Work                                     = 2,
	Rest                                     = 3,
	Speak                                    = 4,
	Pray                                     = 5,
	EHumanAnimState_MAX                      = 6,
};

// Enum Smuta.EHumanWorkState
// NumValues: 0x0006
enum class EHumanWorkState : uint8
{
	None                                     = 0,
	Rotate                                   = 1,
	Stand                                    = 2,
	Active                                   = 3,
	Speak                                    = 4,
	EHumanWorkState_MAX                      = 5,
};

// Enum Smuta.EHumanPrayState
// NumValues: 0x0005
enum class EHumanPrayState : uint8
{
	None                                     = 0,
	Rotate                                   = 1,
	Cross                                    = 2,
	Return                                   = 3,
	EHumanPrayState_MAX                      = 4,
};

// Enum Smuta.EHumanSpeakState
// NumValues: 0x0005
enum class EHumanSpeakState : uint8
{
	None                                     = 0,
	Rotate                                   = 1,
	Stand                                    = 2,
	Speak                                    = 3,
	EHumanSpeakState_MAX                     = 4,
};

// Enum Smuta.EHumanRestState
// NumValues: 0x0005
enum class EHumanRestState : uint8
{
	None                                     = 0,
	Start                                    = 1,
	Idle                                     = 2,
	Finish                                   = 3,
	EHumanRestState_MAX                      = 4,
};

// Enum Smuta.EActiveWorkState
// NumValues: 0x0004
enum class EActiveWorkState : uint8
{
	None                                     = 0,
	Stand                                    = 1,
	Activation                               = 2,
	EActiveWorkState_MAX                     = 3,
};

// Enum Smuta.EHumanType
// NumValues: 0x0004
enum class EHumanType : uint8
{
	None                                     = 0,
	Walker                                   = 1,
	Worker                                   = 2,
	EHumanType_MAX                           = 3,
};

// Enum Smuta.EHumanPOIState
// NumValues: 0x0005
enum class EHumanPOIState : uint8
{
	Free                                     = 0,
	Reserve                                  = 1,
	Busy                                     = 2,
	Lock                                     = 3,
	EHumanPOIState_MAX                       = 4,
};

// Enum Smuta.EDayNightState
// NumValues: 0x0005
enum class EDayNightState : uint8
{
	None                                     = 0,
	Day                                      = 1,
	Night                                    = 2,
	Forever                                  = 3,
	EDayNightState_MAX                       = 4,
};

// Enum Smuta.EPlaceResidence
// NumValues: 0x0004
enum class EPlaceResidence : uint8
{
	None                                     = 0,
	Peasant                                  = 1,
	Citizen                                  = 2,
	EPlaceResidence_MAX                      = 3,
};

// Enum Smuta.EUnlockingEvent
// NumValues: 0x0005
enum class EUnlockingEvent : uint8
{
	None                                     = 0,
	LockingEvidence                          = 1,
	QuestEvent                               = 2,
	Key                                      = 3,
	EUnlockingEvent_MAX                      = 4,
};

// Enum Smuta.EGenderType
// NumValues: 0x0004
enum class EGenderType : uint8
{
	None                                     = 0,
	Male                                     = 1,
	Female                                   = 2,
	EGenderType_MAX                          = 3,
};

// Enum Smuta.EOverlapType
// NumValues: 0x0003
enum class EOverlapType : uint8
{
	BeginOverlap                             = 0,
	EndOverlap                               = 1,
	EOverlapType_MAX                         = 2,
};

// Enum Smuta.ENPCAttackType
// NumValues: 0x0006
enum class ENPCAttackType : uint8
{
	None                                     = 0,
	Default                                  = 1,
	Unblockable                              = 2,
	Unparry                                  = 3,
	Dodge                                    = 4,
	ENPCAttackType_MAX                       = 5,
};

// Enum Smuta.ENPCComboType
// NumValues: 0x0007
enum class ENPCComboType : uint8
{
	None                                     = 0,
	Default                                  = 1,
	Unblockable                              = 2,
	Unparry                                  = 3,
	Mixed                                    = 4,
	Counter                                  = 5,
	ENPCComboType_MAX                        = 6,
};

// Enum Smuta.ERotationPattern
// NumValues: 0x0008
enum class ERotationPattern : uint8
{
	NoRotation                               = 0,
	Left45                                   = 1,
	Left90                                   = 2,
	Left180                                  = 3,
	Right45                                  = 4,
	Right90                                  = 5,
	Right180                                 = 6,
	ERotationPattern_MAX                     = 7,
};

// Enum Smuta.EStartRotation
// NumValues: 0x000A
enum class EStartRotation : uint8
{
	F                                        = 0,
	L45                                      = 1,
	L90                                      = 2,
	L135                                     = 3,
	L180                                     = 4,
	R45                                      = 5,
	R90                                      = 6,
	R135                                     = 7,
	R180                                     = 8,
	EStartRotation_MAX                       = 9,
};

// Enum Smuta.EPostProcessLayer
// NumValues: 0x0005
enum class EPostProcessLayer : uint8
{
	High                                     = 0,
	Mid                                      = 1,
	Low                                      = 2,
	Count                                    = 3,
	EPostProcessLayer_MAX                    = 4,
};

// Enum Smuta.EPostProcessOrder
// NumValues: 0x0005
enum class EPostProcessOrder : uint8
{
	InsertBefore                             = 0,
	Interrupt                                = 1,
	Queue                                    = 2,
	Reject                                   = 3,
	EPostProcessOrder_MAX                    = 4,
};

// Enum Smuta.EForceBlendspace
// NumValues: 0x0003
enum class EForceBlendspace : uint8
{
	Default                                  = 0,
	Custom                                   = 1,
	EForceBlendspace_MAX                     = 2,
};

// Enum Smuta.EPrevResult
// NumValues: 0x0004
enum class EPrevResult : uint8
{
	FirstRound                               = 0,
	PrevWin                                  = 1,
	PrevLose                                 = 2,
	EPrevResult_MAX                          = 3,
};

// Enum Smuta.EQTE_Type
// NumValues: 0x0007
enum class EQTE_Type : uint8
{
	QuickTapping                             = 0,
	ButtonsHolding                           = 1,
	ButtonsCombination                       = 2,
	LineHitting                              = 3,
	ThreeStones                              = 4,
	QuickTappingOverlapEnd                   = 5,
	EQTE_MAX                                 = 6,
};

// Enum Smuta.EQTE_FailAction
// NumValues: 0x0004
enum class EQTE_FailAction : uint8
{
	Current                                  = 0,
	Forward                                  = 1,
	Backward                                 = 2,
	EQTE_MAX                                 = 3,
};

// Enum Smuta.EQTE_WhoFirst
// NumValues: 0x0004
enum class EQTE_WhoFirst : uint8
{
	Player                                   = 0,
	NPC                                      = 1,
	Random                                   = 2,
	EQTE_MAX                                 = 3,
};

// Enum Smuta.EQTE_LHDir
// NumValues: 0x0005
enum class EQTE_LHDir : uint8
{
	CW                                       = 0,
	CCW                                      = 1,
	PushInvert                               = 2,
	CatchInvert                              = 3,
	EQTE_MAX                                 = 4,
};

// Enum Smuta.EQTE_InActionType
// NumValues: 0x0009
enum class EQTE_InActionType : uint8
{
	Start                                    = 0,
	NewRound                                 = 1,
	PlayerTurn                               = 2,
	NPCTurn                                  = 3,
	PlayerFroze                              = 4,
	PlayerWin                                = 5,
	PlayerLoose                              = 6,
	Phrase                                   = 7,
	EQTE_MAX                                 = 8,
};

// Enum Smuta.EQTE_Emotion
// NumValues: 0x000B
enum class EQTE_Emotion : uint8
{
	Default                                  = 0,
	Angry                                    = 1,
	Dobry                                    = 2,
	Ispug                                    = 3,
	Serious                                  = 4,
	Smile                                    = 5,
	Spoke                                    = 6,
	Udivlen                                  = 7,
	Vnimat                                   = 8,
	Grustny                                  = 9,
	EQTE_MAX                                 = 10,
};

// Enum Smuta.AttributeOp
// NumValues: 0x0006
enum class EAttributeOp : uint8
{
	Lower                                    = 0,
	LowerEqual                               = 1,
	Equal                                    = 2,
	GreatEqual                               = 3,
	Greater                                  = 4,
	AttributeOp_MAX                          = 5,
};

// Enum Smuta.EQTE_Dependence
// NumValues: 0x0008
enum class EQTE_Dependence : uint8
{
	None                                     = 0,
	Success                                  = 1,
	Round                                    = 2,
	Fail                                     = 3,
	FirstRound                               = 4,
	PrevWin                                  = 5,
	PrevLose                                 = 6,
	EQTE_MAX                                 = 7,
};

// Enum Smuta.EEnemyState
// NumValues: 0x0008
enum class EEnemyState : uint8
{
	GuardPoint                               = 0,
	PatrolPoints                             = 1,
	WarningPlayer                            = 2,
	Chase                                    = 3,
	Battle                                   = 4,
	LookingForEnemy                          = 5,
	Free                                     = 6,
	EEnemyState_MAX                          = 7,
};

// Enum Smuta.ESpyCameraEventType
// NumValues: 0x0004
enum class ESpyCameraEventType : uint8
{
	None                                     = 0,
	Interaction                              = 1,
	Overlapped                               = 2,
	ESpyCameraEventType_MAX                  = 3,
};

// Enum Smuta.EEnterCondition
// NumValues: 0x0006
enum class EEnterCondition : uint8
{
	Default                                  = 0,
	Sprint                                   = 1,
	Fall                                     = 2,
	Counter                                  = 3,
	Vigor                                    = 4,
	EEnterCondition_MAX                      = 5,
};

// Enum Smuta.ESupportEvidenceType
// NumValues: 0x0004
enum class ESupportEvidenceType : uint8
{
	None                                     = 0,
	Static                                   = 1,
	Skeletal                                 = 2,
	ESupportEvidenceType_MAX                 = 3,
};

// Enum Smuta.ETagQueryMatchType
// NumValues: 0x0004
enum class ETagQueryMatchType : uint8
{
	Any                                      = 0,
	All                                      = 1,
	None                                     = 2,
	ETagQueryMatchType_MAX                   = 3,
};

// Enum Smuta.ETransferEffectOperation
// NumValues: 0x0003
enum class ETransferEffectOperation : uint8
{
	AddEffect                                = 0,
	RemoveEffect                             = 1,
	ETransferEffectOperation_MAX             = 2,
};

// Enum Smuta.ETraversalType
// NumValues: 0x0006
enum class ETraversalType : uint8
{
	Climbing                                 = 0,
	Squeezing                                = 1,
	CrawlingUnder                            = 2,
	JumpingOver                              = 3,
	JumpingDown                              = 4,
	ETraversalType_MAX                       = 5,
};

// Enum Smuta.ETutorialComboItemState
// NumValues: 0x0004
enum class ETutorialComboItemState : uint8
{
	None                                     = 0,
	Success                                  = 1,
	Failed                                   = 2,
	ETutorialComboItemState_MAX              = 3,
};

// Enum Smuta.EDistanceCheckType
// NumValues: 0x0004
enum class EDistanceCheckType : uint8
{
	MoreThan                                 = 0,
	LessThan                                 = 1,
	Equal                                    = 2,
	EDistanceCheckType_MAX                   = 3,
};

// Enum Smuta.EUniformGridPanelDirection
// NumValues: 0x0005
enum class EUniformGridPanelDirection : uint8
{
	Left                                     = 0,
	Right                                    = 1,
	Up                                       = 2,
	Down                                     = 3,
	EUniformGridPanelDirection_MAX           = 4,
};

// Enum Smuta.EUpgradeType
// NumValues: 0x0008
enum class EUpgradeType : uint8
{
	Saber                                    = 0,
	Pistol                                   = 1,
	Knife                                    = 2,
	HPPotion                                 = 3,
	Health                                   = 4,
	Stealth                                  = 5,
	Concentration                            = 6,
	EUpgradeType_MAX                         = 7,
};

// Enum Smuta.EVillageAnimalType
// NumValues: 0x0008
enum class EVillageAnimalType : uint8
{
	None                                     = 0,
	Chicken                                  = 1,
	Rooster                                  = 2,
	Chick                                    = 3,
	Pig                                      = 4,
	Piglet                                   = 5,
	Cow                                      = 6,
	EVillageAnimalType_MAX                   = 7,
};

// Enum Smuta.EVillageRestState
// NumValues: 0x0005
enum class EVillageRestState : uint8
{
	None                                     = 0,
	Start                                    = 1,
	Idle                                     = 2,
	Finish                                   = 3,
	EVillageRestState_MAX                    = 4,
};

// Enum Smuta.EVillageEatState
// NumValues: 0x0004
enum class EVillageEatState : uint8
{
	None                                     = 0,
	Digging                                  = 1,
	Action                                   = 2,
	EVillageEatState_MAX                     = 3,
};

// Enum Smuta.EWarpUpdate
// NumValues: 0x0004
enum class EWarpUpdate : uint8
{
	EWU_OnlyWarpRotation                     = 0,
	EWU_OnlyWarpLocation                     = 1,
	EWU_WarpRotationAndLocation              = 2,
	EWU_MAX                                  = 3,
};

// Enum Smuta.EWeaponNoiseAttackType
// NumValues: 0x0004
enum class EWeaponNoiseAttackType : uint8
{
	LightAttack                              = 0,
	HeavyAttack                              = 1,
	RangeAttack                              = 2,
	EWeaponNoiseAttackType_MAX               = 3,
};

// Enum Smuta.EWeaponNoiseTarget
// NumValues: 0x0005
enum class EWeaponNoiseTarget : uint8
{
	Self                                     = 0,
	Target                                   = 1,
	Both                                     = 2,
	None                                     = 3,
	EWeaponNoiseTarget_MAX                   = 4,
};

// Enum Smuta.EZastavaPOIState
// NumValues: 0x0005
enum class EZastavaPOIState : uint8
{
	Free                                     = 0,
	Reserve                                  = 1,
	Busy                                     = 2,
	Lock                                     = 3,
	EZastavaPOIState_MAX                     = 4,
};

// ScriptStruct Smuta.Actions
// 0x0010 (0x0010 - 0x0000)
struct FActions final
{
public:
	TArray<class UBaseActionData*>                ActionsData;                                       // 0x0000(0x0010)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FActions;

// ScriptStruct Smuta.NPCReaction
// 0x00A0 (0x00A0 - 0x0000)
struct FNPCReaction final
{
public:
	bool                                          bEnabled;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UReactionCondition*>             ReactionConditions;                                // 0x0008(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                          bAggression;                                       // 0x0018(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UAnimMontage>            ReactionMontage;                                   // 0x0020(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UDlgDialogue>            ReactionMonologue;                                 // 0x0048(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                           OptionalMonologueTag;                              // 0x0070(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReactionMaxDistance;                               // 0x0078(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoNotAbortTree;                                   // 0x007C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEndAfterReaction;                                 // 0x007D(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDoOnce;                                           // 0x007E(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bChangeAttitude;                                   // 0x007F(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EExtendedAttitude                             NewAttitude;                                       // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RepeatNumToChangeAttitude;                         // 0x0084(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DelayToChangeAttitude;                             // 0x0088(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_8C[0x14];                                      // 0x008C(0x0014)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FNPCReaction;

// ScriptStruct Smuta.StatUpgradesInfo
// 0x0080 (0x0080 - 0x0000)
struct FStatUpgradesInfo final
{
public:
	TArray<struct FDataTableRowHandle>            UpgradeRowHandles;                                 // 0x0000(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                 StatName;                                          // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 StatDescription;                                   // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              DefaultIconTexture;                                // 0x0030(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              DefaultLargeViewIcon;                              // 0x0058(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FStatUpgradesInfo;

// ScriptStruct Smuta.AITraits_AgroSettings
// 0x0048 (0x0048 - 0x0000)
struct FAITraits_AgroSettings final
{
public:
	float                                         AgroDistance;                                      // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CallForHelpRadius;                                 // 0x0004(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SafeDistanceOfScary;                               // 0x0008(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CalmdownScaryDistance;                             // 0x000C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0010(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EFraction>                             CallForHelpFractions;                              // 0x0018(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                         CalmDownDuration;                                  // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanAgro;                                          // 0x002C(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanDisagro;                                       // 0x002D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSubclassOf<class UGameplayEffect>>    ChangeAttitudeGEClasses;                           // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	EFraction                                     Fraction;                                          // 0x0040(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAITraits_AgroSettings;

// ScriptStruct Smuta.AimActionMontages
// 0x0050 (0x0050 - 0x0000)
struct FAimActionMontages final
{
public:
	TMap<EShootAnimationType, TSoftObjectPtr<class UAnimMontage>> Montages;                          // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAimActionMontages;

// ScriptStruct Smuta.MontageWithDescription
// 0x0030 (0x0030 - 0x0000)
struct FMontageWithDescription final
{
public:
	TSoftObjectPtr<class UAnimMontage>            Montage;                                           // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEnterCondition                               EnterCondition;                                    // 0x0028(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ELegsPosition                                 LegsStartPosition;                                 // 0x0029(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FMontageWithDescription;

// ScriptStruct Smuta.MontageArrayWrapper
// 0x0010 (0x0010 - 0x0000)
struct FMontageArrayWrapper final
{
public:
	TArray<struct FMontageWithDescription>        Array;                                             // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FMontageArrayWrapper;

// ScriptStruct Smuta.AttackWithRotationMontages
// 0x0050 (0x0050 - 0x0000)
struct FAttackWithRotationMontages final
{
public:
	TMap<EEnemyPosition, struct FMontageArrayWrapper> Montage;                                       // 0x0000(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAttackWithRotationMontages;

// ScriptStruct Smuta.OldDialogueTableInfo
// 0x0030 (0x0038 - 0x0008)
struct FOldDialogueTableInfo final : public FTableRowBase
{
public:
	class FString                                 Key;                                               // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PhraseText;                                        // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Emotion;                                           // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FOldDialogueTableInfo;

// ScriptStruct Smuta.AimStandActionMontages
// 0x0050 (0x0050 - 0x0000)
struct FAimStandActionMontages final
{
public:
	TMap<EAimStand, struct FAimActionMontages>    Data;                                              // 0x0000(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAimStandActionMontages;

// ScriptStruct Smuta.AITraits_DetectionHelp
// 0x000C (0x000C - 0x0000)
struct FAITraits_DetectionHelp final
{
public:
	float                                         Chance;                                            // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MaxNumber;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAITraits_DetectionHelp;

// ScriptStruct Smuta.AimElementAppearanceSettings
// 0x0060 (0x0060 - 0x0000)
struct FAimElementAppearanceSettings
{
public:
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0000(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       Transform;                                         // 0x0028(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAimElementAppearanceSettings;

// ScriptStruct Smuta.AimCenterElementAppearanceSettings
// 0x0068 (0x00C8 - 0x0060)
struct FAimCenterElementAppearanceSettings final : public FAimElementAppearanceSettings
{
public:
	TSoftObjectPtr<class UTexture2D>              HighlightTexture;                                  // 0x0060(0x0028)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWidgetTransform                       HighlightTransform;                                // 0x0088(0x0038)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          FriendlyHighlighted;                               // 0x00C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          NeutralHighlighted;                                // 0x00C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          HostileHighlighted;                                // 0x00C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C3[0x5];                                       // 0x00C3(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAimCenterElementAppearanceSettings;

// ScriptStruct Smuta.CodexArticle
// 0x0078 (0x0078 - 0x0000)
struct FCodexArticle final
{
public:
	class FText                                   Category;                                          // 0x0000(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                   Name;                                              // 0x0018(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>              Image;                                             // 0x0030(0x0028)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0058(0x0018)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	ECodexImageLayout                             ImageLayout;                                       // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FCodexArticle;

// ScriptStruct Smuta.AnimationReactionData
// 0x0020 (0x0020 - 0x0000)
struct FAnimationReactionData final
{
public:
	class UAnimMontage*                           WarningAnimation;                                  // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundWave*                             WarningSound;                                      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                           SkipAnimation;                                     // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundWave*                             SkipSound;                                         // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAnimationReactionData;

// ScriptStruct Smuta.EnemyData
// 0x0030 (0x0030 - 0x0000)
struct FEnemyData final
{
public:
	class UDataAsset*                             AITraits;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAnimationReactionData                 Animation;                                         // 0x0008(0x0020)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bKilled;                                           // 0x0028(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FEnemyData;

// ScriptStruct Smuta.PatrolData
// 0x0010 (0x0010 - 0x0000)
struct FPatrolData final
{
public:
	TArray<struct FEnemyData>                     PatrolData;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FPatrolData;

// ScriptStruct Smuta.AimNotchElementAppearanceSettings
// 0x0000 (0x0060 - 0x0060)
struct FAimNotchElementAppearanceSettings final : public FAimElementAppearanceSettings
{
};
DUMPER7_ASSERTS_FAimNotchElementAppearanceSettings;

// ScriptStruct Smuta.BehaviorTreeData
// 0x0050 (0x0050 - 0x0000)
struct FBehaviorTreeData final
{
public:
	TMap<struct FGameplayTag, class UObject*>     SettingsObjects;                                   // 0x0000(0x0050)(Edit, BlueprintVisible, ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FBehaviorTreeData;

// ScriptStruct Smuta.AITraits_Peaceful
// 0x0068 (0x0068 - 0x0000)
struct FAITraits_Peaceful final
{
public:
	TMap<class FString, struct FBehaviorTreeData> BTData;                                            // 0x0000(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FNPCReaction>                   Reactions;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGameplayTag                           VoiceTag;                                          // 0x0060(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FAITraits_Peaceful;

// ScriptStruct Smuta.AITraits_PerceptionKey
// 0x0002 (0x0002 - 0x0000)
struct FAITraits_PerceptionKey final
{
public:
