#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Smuta

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "GameplayAbilities_classes.hpp"
#include "Smuta_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "InventorySystemModule_structs.hpp"
#include "InventorySystemModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FlexibleQuestsRuntime_structs.hpp"
#include "FlexibleQuestsRuntime_classes.hpp"
#include "UMG_classes.hpp"
#include "EnchancedSpline_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"
#include "GameDifficultyModule_structs.hpp"
#include "AITeamFight_structs.hpp"
#include "AITeamFight_classes.hpp"
#include "CommonUI_classes.hpp"
#include "InteractionSystem_classes.hpp"
#include "SmutaCommon_structs.hpp"
#include "AnimGraphRuntime_classes.hpp"
#include "CombatHitDetection_structs.hpp"
#include "DeveloperSettings_classes.hpp"
#include "EasyMultiSave_classes.hpp"
#include "SubtitlesSystem_structs.hpp"
#include "DlgSystem_classes.hpp"
#include "PhysicsCore_structs.hpp"
#include "MotionWarping_classes.hpp"
#include "SettingsSystem_classes.hpp"
#include "EnhancedInput_classes.hpp"
#include "SignificanceManager_classes.hpp"
#include "AnimToTexture_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK
{

// Class Smuta.ReactionCondition
// 0x0010 (0x0038 - 0x0028)
class UReactionCondition : public UObject
{
public:
	class AActor*                                 Owner;                                             // 0x0028(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_30[0x8];                                       // 0x0030(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CheckCondition();
	void StartCondition(class AActor* OwnerActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ReactionCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ReactionCondition")
	}
	static class UReactionCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UReactionCondition>();
	}
};
DUMPER7_ASSERTS_UReactionCondition;

// Class Smuta.ActorTagCondition
// 0x0058 (0x0090 - 0x0038)
class UActorTagCondition : public UReactionCondition
{
public:
	bool                                          Result;                                            // 0x0038(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x57];                                      // 0x0039(0x0057)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void InitCondition(const struct FGameplayTagQuery& InQuery, class AActor* InActor);
	void OnActorTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorTagCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActorTagCondition")
	}
	static class UActorTagCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActorTagCondition>();
	}
};
DUMPER7_ASSERTS_UActorTagCondition;

// Class Smuta.AbilityBase
// 0x00A8 (0x0460 - 0x03B8)
class UAbilityBase : public UGameplayAbility
{
public:
	EAbilityInputID                               AbilityInputID;                                    // 0x03B8(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bActivateOnInput;                                  // 0x03B9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3BA[0x6];                                      // 0x03BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AchievementID;                                     // 0x03C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInputAction*                           InputAction;                                       // 0x03D0(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Icon;                                              // 0x03D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                   AbilityInfo;                                       // 0x03E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FGameplayTag, struct FGameplayTagContainer> CancelAbilitiesByTagWithConditions;      // 0x03F8(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTagContainer>          ActivationBlockedTagsConditions;                   // 0x0448(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	EEquipmentSlotType                            EquipmentSlot;                                     // 0x0458(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void CancelAllASCAbilities(class UAbilitySystemComponent* ASC, const struct FGameplayTagContainer& WithTags, const struct FGameplayTagContainer& WithoutTags);
	bool CommitAbilityWithAttributeCheck(const struct FGameplayAttribute& Attribute, TSubclassOf<class UGameplayEffect> CostEffect);
	void GetInputAxisValues(float* Forward, float* Right);
	void SetEffectStackLimit(int32 LimitMax, TSubclassOf<class UGameplayEffect> CostEffect);

	float GetCostValue() const;
	struct FGameplayEffectContextHandle MakeEffectContextForInstigator(class AActor* Instigator) const;
	void OnAbilityInputComplete(const struct FInputActionValue& InputActionValue) const;
	void OnAbilityInputStart(const struct FInputActionValue& InputActionValue) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityBase")
	}
	static class UAbilityBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityBase>();
	}
};
DUMPER7_ASSERTS_UAbilityBase;

// Class Smuta.AbilityCancelerComponent
// 0x0088 (0x0128 - 0x00A0)
class UAbilityCancelerComponent final : public UActorComponent
{
public:
	class ACharacter*                             CharacterOwner;                                    // 0x00A0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseAbilitiesComponent*                AbilityComponent;                                  // 0x00A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                  AbilityTagsToCancel;                               // 0x00B0(0x0020)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class UAnimMontage*, struct FGameplayTagContainer> MontageToAbilityTagMap;                  // 0x00D0(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         MontagesBlendOutTime;                              // 0x0120(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_124[0x4];                                      // 0x0124(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AddAbilityTagsToCancel(const struct FGameplayTagContainer& AbilityTags, class UAnimMontage* Montage);
	void CancelAbilities();
	struct FGameplayTagContainer GetAbilityTagsToCancel();
	bool Initialize();
	void OnMontageBlendingOut(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageEnded(class UAnimMontage* Montage, bool bInterrupted);
	void RemoveAbilityTagsToCancel(const struct FGameplayTagContainer& AbilityTags, class UAnimMontage* Montage);
	bool ShouldCancelAbility();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityCancelerComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityCancelerComponent")
	}
	static class UAbilityCancelerComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityCancelerComponent>();
	}
};
DUMPER7_ASSERTS_UAbilityCancelerComponent;

// Class Smuta.AITraitsBase
// 0x01A8 (0x01D8 - 0x0030)
class UAITraitsBase : public UPrimaryDataAsset
{
public:
	class UBehaviorTree*                          BattleBehaviorTree;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBehaviorTree*                          PeacefulBehaviorTree;                              // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBehaviorTree*                          BattleFleeBehaviorTree;                            // 0x0040(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<EGameDifficulty, struct FAITraits_Global> Traits;                                           // 0x0048(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FEnemyFightZoneSettingsWrapper         TeamFightSettings;                                 // 0x0098(0x0018)(Edit, BlueprintVisible, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UAgroTraitsPresetWrapper*               AgroSettings;                                      // 0x00B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAITraits_Peaceful                     PeacefulSettings;                                  // 0x00B8(0x0068)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAITraits_BattleFlee                   BattleFleeSettings;                                // 0x0120(0x0050)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_170[0x8];                                      // 0x0170(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AAIController>              AIControllerClass;                                 // 0x0178(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAITraitsPreset*                        AITraitsPreset;                                    // 0x0180(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPeacefulAITraitsPreset*                PeacefulAITraitsPreset;                            // 0x0188(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimpleAITraitsPreset*                  BattleFleeAITraitsPreset;                          // 0x0190(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>    StartupEffects;                                    // 0x0198(0x0010)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AAIController*                          AIController;                                      // 0x01A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBaseAbilitiesComponent*                OwnerASC;                                          // 0x01B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ADefaultCharacter*                      OwnerCharacter;                                    // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_1C0[0x18];                                     // 0x01C0(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAITraitsBase* Initialize(class UAITraitsBase* AITraits, class AActor* Owner);

	void ApplyPerceptionSettings();
	void OnDetectionStateChanged(class UEnemyDetectionComponent* Component, EDetectionAIState NewState);
	void SetIsDay(bool bIsDay);
	void SetPerceptionDebuff(bool Val);
	void UpdateGameDifficulty(EGameDifficulty NewDifficulty);

	struct FAITraits_Attributes GetAttributes() const;
	struct FAITraits_Behavior GetBehavior() const;
	bool GetGeneralDetectionTraits(struct FAITraits_DetectionGeneral* OutTraits) const;
	bool GetPerceptionV2(struct FAITraits_PerceptionV2* OutPerception) const;
	class UObject* GetSettingsDataByTag(const struct FGameplayTag& Tag) const;
	bool IsDay() const;
	bool IsInitialized() const;
	bool IsPerceptionDebuff() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AITraitsBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AITraitsBase")
	}
	static class UAITraitsBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAITraitsBase>();
	}
};
DUMPER7_ASSERTS_UAITraitsBase;

// Class Smuta.AgroTraitsPresetWrapper
// 0x0018 (0x0040 - 0x0028)
class UAgroTraitsPresetWrapper final : public UObject
{
public:
	class UAgroTraitsPreset*                      Settings;                                          // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAgroTraitsPreset*                      InstancedSettings;                                 // 0x0030(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideSettings;                                 // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AgroTraitsPresetWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AgroTraitsPresetWrapper")
	}
	static class UAgroTraitsPresetWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAgroTraitsPresetWrapper>();
	}
};
DUMPER7_ASSERTS_UAgroTraitsPresetWrapper;

// Class Smuta.AsyncTaskAttributeChanged
// 0x0060 (0x0090 - 0x0030)
class UAsyncTaskAttributeChanged final : public UBlueprintAsyncActionBase
{
public:
	TMulticastInlineDelegate<void(const struct FGameplayAttribute& Attribute, float NewValue, float OldValue)> OnAttributeChanged; // 0x0030(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ASC;                                               // 0x0040(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_48[0x48];                                      // 0x0048(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAsyncTaskAttributeChanged* ListenForAttributeChange(class UAbilitySystemComponent* AbilitySystemComponent, const struct FGameplayAttribute& Attribute);
	static class UAsyncTaskAttributeChanged* ListenForAttributesChange(class UAbilitySystemComponent* AbilitySystemComponent, const TArray<struct FGameplayAttribute>& Attributes);

	void EndTask();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncTaskAttributeChanged")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncTaskAttributeChanged")
	}
	static class UAsyncTaskAttributeChanged* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncTaskAttributeChanged>();
	}
};
DUMPER7_ASSERTS_UAsyncTaskAttributeChanged;

// Class Smuta.SpawnerPointBase
// 0x0050 (0x02E8 - 0x0298)
class ASpawnerPointBase : public AActor
{
public:
	class UBehaviorTree*                          BehaviorTree;                                      // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBillboardComponent*                    BillboardComponent;                                // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        SceneComponent;                                    // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                    SpawnBoard;                                        // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USplineComponent*                       Spline;                                            // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UArrowComponent*                        Arrow;                                             // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ADefaultCharacter>          CharacterClass;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADefaultCharacter*                      Character;                                         // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpawnOptimizationComponent*            SpawnOptimizationComponent;                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          DayOnly;                                           // 0x02E0(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          NightOnly;                                         // 0x02E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Destroy();

	class ADefaultCharacter* GetCharacter() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SpawnerPointBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SpawnerPointBase")
	}
	static class ASpawnerPointBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASpawnerPointBase>();
	}
};
DUMPER7_ASSERTS_ASpawnerPointBase;

// Class Smuta.MatrixSpawnerBase
// 0x0030 (0x0318 - 0x02E8)
class AMatrixSpawnerBase : public ASpawnerPointBase
{
public:
	bool                                          CanAutoAgro;                                       // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UFractionComponent*                     FractionComponent;                                 // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                 DayNightController;                                // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AActor>                     DayNightClass;                                     // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMatrixDataAsset*                       SpawnData;                                         // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EGenderType                                   Gender;                                            // 0x0310(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	class AActor* GetDNCClass();
	class ADefaultCharacter* Spawn(class UMatrixDataAsset* MatrixDataAsset);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MatrixSpawnerBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MatrixSpawnerBase")
	}
	static class AMatrixSpawnerBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMatrixSpawnerBase>();
	}
};
DUMPER7_ASSERTS_AMatrixSpawnerBase;

// Class Smuta.AnimalMatrixSpawner
// 0x0010 (0x0328 - 0x0318)
class AAnimalMatrixSpawner final : public AMatrixSpawnerBase
{
public:
	class AForestAnimalPOI*                       PointOfInterest;                                   // 0x0318(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAnimalType                                   AnimalType;                                        // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAnimalState                                  AnimalState;                                       // 0x0321(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EForestRestState                              RestState;                                         // 0x0322(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EForestEatState                               EatState;                                          // 0x0323(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_324[0x4];                                      // 0x0324(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AnimalMatrixSpawner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimalMatrixSpawner")
	}
	static class AAnimalMatrixSpawner* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAnimalMatrixSpawner>();
	}
};
DUMPER7_ASSERTS_AAnimalMatrixSpawner;

// Class Smuta.EquipmentFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UEquipmentFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool CanReloadWeapon(class UAbilitySystemComponent* OwnerASC, class URangeWeaponItem* Weapon, float* NeedToRestoreAmmo);
	static bool IsEnoughWeaponAmmo(class UAbilitySystemComponent* OwnerASC, class URangeWeaponItem* Weapon);
	static bool ReduceWeaponAmmo(class UAbilitySystemComponent* OwnerASC, class URangeWeaponItem* Weapon, float AmmoCount);
	static void ReloadWeapon(class UAbilitySystemComponent* OwnerASC, class URangeWeaponItem* Weapon);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("EquipmentFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"EquipmentFunctionLibrary")
	}
	static class UEquipmentFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UEquipmentFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UEquipmentFunctionLibrary;

// Class Smuta.AbilityFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UAbilityFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FActiveGameplayEffectHandle ApplyGameplayEffectByClass(const class UAbilitySystemComponent* AbilitySystemComponent, TSubclassOf<class UGameplayEffect> EffectClass);
	static void ChangeAttributeValue(class UAbilitySystemComponent* Target, const struct FGameplayAttribute& Attribute, float NewValue, EGameplayModOp ModifierOp);
	static TSubclassOf<class UGameplayAbility> GetAbilityFromSpec(const struct FGameplayAbilitySpecDef& Spec);
	static float GetAttributeMagnitude(const struct FGameplayEffectSpecHandle& SpecHandle, class UAbilitySystemComponent* Source, class UAbilitySystemComponent* Target, const struct FGameplayAttribute& Attribute);
	static class UBaseAbilitiesComponent* GetBaseAbilityComponent(const class AActor* Target, bool* Result);
	static bool GetCapturedAttributeMagnitudePure(const class UGameplayModMagnitudeCalculation* ModMagnitude, const struct FGameplayEffectSpec& Spec, const struct FGameplayAttribute& Attribute, EGameplayEffectAttributeCaptureSource AttributeSource, float* OutMagnitude);
	static ELegsPosition GetCharacterMeshLegsPosition(class USkeletalMeshComponent* CharacterMesh, class FName LeftLegBoneName, class FName RightLegBoneName);
	static EEnemyPosition GetEnemyDirection(class AActor* Source, class AActor* Target);
	static class AActor* GetInstigatorFromSpec(const struct FGameplayEffectSpec& Spec);
	static const struct FGameplayTagContainer GetSourceActorTags(const struct FGameplayEffectSpec& Spec);
	static const struct FGameplayTagContainer GetTargetActorTags(const struct FGameplayEffectSpec& Spec);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityFunctionLibrary")
	}
	static class UAbilityFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UAbilityFunctionLibrary;

// Class Smuta.ActivatedActorChangeStateCondition
// 0x0030 (0x0088 - 0x0058)
class UActivatedActorChangeStateCondition final : public UQuestStepCondition
{
public:
	TSoftObjectPtr<class AActivatedActor>         Actor;                                             // 0x0058(0x0028)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, SaveGame, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EActivatedObjectState                         WaitForState;                                      // 0x0080(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActorStateChanged(EActivatedObjectState NewState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActivatedActorChangeStateCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivatedActorChangeStateCondition")
	}
	static class UActivatedActorChangeStateCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivatedActorChangeStateCondition>();
	}
};
DUMPER7_ASSERTS_UActivatedActorChangeStateCondition;

// Class Smuta.AbilityTask_OnTick
// 0x0018 (0x0098 - 0x0080)
class UAbilityTask_OnTick final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float DeltaTime)> OnTick;                                          // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                         Pad_90[0x8];                                       // 0x0090(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_OnTick* AbilityTaskOnTick(class UGameplayAbility* OwningAbility, class FName TaskInstanceName);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_OnTick")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_OnTick")
	}
	static class UAbilityTask_OnTick* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_OnTick>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_OnTick;

// Class Smuta.BaseActionData
// 0x0008 (0x0030 - 0x0028)
class UBaseActionData : public UObject
{
public:
	struct FGameplayTag                           ActionTag;                                         // 0x0028(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	TSoftObjectPtr<class UAnimMontage> GetMontage(EEquipmentType EquipmentType, const struct FGameplayTagContainer& Tags, float PairDistance) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BaseActionData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BaseActionData")
	}
	static class UBaseActionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBaseActionData>();
	}
};
DUMPER7_ASSERTS_UBaseActionData;

// Class Smuta.ChanceSettings
// 0x0008 (0x0030 - 0x0028)
class UChanceSettings final : public UObject
{
public:
	float                                         Chance;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ChanceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ChanceSettings")
	}
	static class UChanceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UChanceSettings>();
	}
};
DUMPER7_ASSERTS_UChanceSettings;

// Class Smuta.AbilityTask_WaitInputActionPressed
// 0x0038 (0x00B8 - 0x0080)
class UAbilityTask_WaitInputActionPressed final : public UAbilityTask
{
public:
	TMulticastInlineDelegate<void(float TimeWaited)> OnPress;                                        // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UInputComponent*                        InputComponent;                                    // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_98[0x20];                                      // 0x0098(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UAbilityTask_WaitInputActionPressed* WaitInputActionPressed(class UGameplayAbility* OwningAbility, bool bTestAlreadyPressed, class FName ActionName, EInputEvent EventType);

	void OnPressCallback();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AbilityTask_WaitInputActionPressed")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AbilityTask_WaitInputActionPressed")
	}
	static class UAbilityTask_WaitInputActionPressed* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAbilityTask_WaitInputActionPressed>();
	}
};
DUMPER7_ASSERTS_UAbilityTask_WaitInputActionPressed;

// Class Smuta.CombatTrickAbility
// 0x0000 (0x0460 - 0x0460)
class UCombatTrickAbility : public UAbilityBase
{
public:
	void OnTrickFailed();
	void OnTrickSucceed();
	void SetTrickFail(float FailRate);
	void SetTrickSuccess(float SuccessRate, class AActor* AgainstCharacter);

	class UBaseAbilitiesComponent* GetAttackerAbilityComponent() const;
	class ADefaultCharacter* GetAttackerActor() const;
	class UBaseAbilitiesComponent* GetDefenderAbilityComponent() const;
	class ADefaultCharacter* GetDefenderActor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CombatTrickAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CombatTrickAbility")
	}
	static class UCombatTrickAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCombatTrickAbility>();
	}
};
DUMPER7_ASSERTS_UCombatTrickAbility;

// Class Smuta.ActionAnimationEffectComponent
// 0x0020 (0x0048 - 0x0028)
class UActionAnimationEffectComponent final : public UGameplayEffectComponent
{
public:
	TSubclassOf<class UBaseActionData>            ActionDataClass;                                   // 0x0028(0x0008)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                           ActionTag;                                         // 0x0030(0x0008)(Edit, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EMontageTagSelectionApproach                  MontageTagSelectionApproach;                       // 0x0038(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           DefaultMontageTag;                                 // 0x003C(0x0008)(Edit, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bConsiderDistanceToInstigator;                     // 0x0044(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bStretchMontageToEffectDuration;                   // 0x0045(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRemoveEffectAfterMontageStopped;                  // 0x0046(0x0001)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnActionMontageEnded(class UAnimMontage* Montage, bool bInterrupted) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionAnimationEffectComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionAnimationEffectComponent")
	}
	static class UActionAnimationEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionAnimationEffectComponent>();
	}
};
DUMPER7_ASSERTS_UActionAnimationEffectComponent;

// Class Smuta.WidgetComponentUMG
// 0x0008 (0x02C8 - 0x02C0)
class UWidgetComponentUMG : public UUserWidget
{
public:
	class UTargetedWidgetComponent*               OwningComponent;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	class AActor* GetOwningActor() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("WidgetComponentUMG")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WidgetComponentUMG")
	}
	static class UWidgetComponentUMG* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWidgetComponentUMG>();
	}
};
DUMPER7_ASSERTS_UWidgetComponentUMG;

// Class Smuta.ComboActionData
// 0x00F0 (0x0120 - 0x0030)
class UComboActionData final : public UBaseActionData
{
public:
	TMap<EEquipmentType, struct FNextMontages>    Starters;                                          // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<EEquipmentType, struct FMontagesByEnemyPosition> RangeAttackMontages;                       // 0x0080(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<EEquipmentType, struct FMontagesByEnemyPosition> KickAttackMontages;                        // 0x00D0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UAnimMetaData* GetAnimMetaData(TSubclassOf<class UAnimMetaData> DataTypeClass, TSoftObjectPtr<class UAnimMontage> Montage);
	static class UAnimMetaData* GetAnimMetaDataFromMontagePtr(TSubclassOf<class UAnimMetaData> DataTypeClass, class UAnimMontage* Montage);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ComboActionData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ComboActionData")
	}
	static class UComboActionData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UComboActionData>();
	}
};
DUMPER7_ASSERTS_UComboActionData;

// Class Smuta.ActionDataAsset
// 0x0060 (0x0090 - 0x0030)
class UActionDataAsset final : public UDataAsset
{
public:
	TMap<class USkeleton*, struct FActions>       Data;                                              // 0x0030(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              OnDataChanged;                                     // 0x0080(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

public:
	static class UBaseActionData* GetActionData(class UActionDataAsset* DataAsset, class USkeleton* Skeleton, TSubclassOf<class UBaseActionData> ActionClass, const struct FGameplayTag& ActionTag);

	void CallOnDataChanged();

	class UBaseActionData* GetActionDataWithTag(class USkeleton* Skeleton, TSubclassOf<class UBaseActionData> ActionClass, const struct FGameplayTag& ActionTag) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionDataAsset")
	}
	static class UActionDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionDataAsset>();
	}
};
DUMPER7_ASSERTS_UActionDataAsset;

// Class Smuta.AimModeWidget
// 0x0000 (0x02C0 - 0x02C0)
class UAimModeWidget final : public UUserWidget
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AimModeWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AimModeWidget")
	}
	static class UAimModeWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAimModeWidget>();
	}
};
DUMPER7_ASSERTS_UAimModeWidget;

// Class Smuta.BasePOI
// 0x0018 (0x02B0 - 0x0298)
class ABasePOI : public AActor
{
public:
	class UBillboardComponent*                    BillboardComponent;                                // 0x0298(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        SceneComponent;                                    // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBillboardComponent*                    Point;                                             // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("BasePOI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BasePOI")
	}
	static class ABasePOI* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABasePOI>();
	}
};
DUMPER7_ASSERTS_ABasePOI;

// Class Smuta.AppearanceDataAsset
// 0x0008 (0x0038 - 0x0030)
class UAppearanceDataAsset final : public UDataAsset
{
public:
	TSubclassOf<class UAppearanceItem>            AppearanceItem;                                    // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static void SetPlayerAppearance(const class UAppearanceDataAsset* Appearance, const class UObject* WorldContext);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AppearanceDataAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AppearanceDataAsset")
	}
	static class UAppearanceDataAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAppearanceDataAsset>();
	}
};
DUMPER7_ASSERTS_UAppearanceDataAsset;

// Class Smuta.SmutaEquipmentComponent
// 0x0008 (0x0360 - 0x0358)
class USmutaEquipmentComponent : public UEquipmentComponent
{
public:
	uint8                                         Pad_358[0x8];                                      // 0x0358(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void TagChangedResponse(const struct FGameplayTag& UpdatedTag, bool bExists);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SmutaEquipmentComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SmutaEquipmentComponent")
	}
	static class USmutaEquipmentComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USmutaEquipmentComponent>();
	}
};
DUMPER7_ASSERTS_USmutaEquipmentComponent;

// Class Smuta.CharacterEquipmentComponent
// 0x0020 (0x0380 - 0x0360)
class UCharacterEquipmentComponent final : public USmutaEquipmentComponent
{
public:
	class UCharacterAppearanceItem*               CurrentAppearance;                                 // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UCharacterAppearanceItem>   DefaultAppearanceClass;                            // 0x0368(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>           TakeOnEquipmentAbility;                            // 0x0370(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGameplayAbility>           TakeOffEquipmentAbility;                           // 0x0378(0x0008)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CharacterEquipmentComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CharacterEquipmentComponent")
	}
	static class UCharacterEquipmentComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCharacterEquipmentComponent>();
	}
};
DUMPER7_ASSERTS_UCharacterEquipmentComponent;

// Class Smuta.HumanPOI
// 0x0020 (0x02D0 - 0x02B0)
class AHumanPOI : public ABasePOI
{
public:
	EHumanPOIState                                StatePOI;                                          // 0x02B0(0x0001)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B1[0x7];                                      // 0x02B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowComponent*                        Arrow;                                             // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ADefaultCharacter*                      User;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UArrowComponent*                        AnimPoint;                                         // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	class UMatrixDialogue* FilterDialogue(EHumanRoleType FirstCharType, EHumanRoleType SecondCharType, EGenderType FirstCharGender, EGenderType SecondCharGender, const TArray<class UMatrixDialogue*>& Dialogues);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("HumanPOI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"HumanPOI")
	}
	static class AHumanPOI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHumanPOI>();
	}
};
DUMPER7_ASSERTS_AHumanPOI;

// Class Smuta.AISenseConfig_SixSense
// 0x0000 (0x0070 - 0x0070)
class UAISenseConfig_SixSense final : public UAISenseConfig_Sight
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AISenseConfig_SixSense")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AISenseConfig_SixSense")
	}
	static class UAISenseConfig_SixSense* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAISenseConfig_SixSense>();
	}
};
DUMPER7_ASSERTS_UAISenseConfig_SixSense;

// Class Smuta.ActionHumanPOI
// 0x0058 (0x0328 - 0x02D0)
class AActionHumanPOI : public AHumanPOI
{
public:
	TMap<EGenderType, class UMatrixProfDataAsset*> ActionData;                                       // 0x02D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	EDayNightState                                DayNightState;                                     // 0x0320(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionHumanPOI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionHumanPOI")
	}
	static class AActionHumanPOI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActionHumanPOI>();
	}
};
DUMPER7_ASSERTS_AActionHumanPOI;

// Class Smuta.ActionRollComponent
// 0x00B0 (0x0150 - 0x00A0)
class UActionRollComponent : public UActorComponent
{
public:
	bool                                          bShowDebug;                                        // 0x00A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A1[0xA7];                                      // 0x00A1(0x00A7)(Fixing Size After Last Property [ Dumper-7 ])
	class UAITraitsBase*                          OwnerTraits;                                       // 0x0148(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void InitializeTraits(class UAITraitsBase* Traits);
	bool RollAction(Smuta::ENPCAction Action, bool OverrideBaseChance, float BaseChanceOverridedValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionRollComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionRollComponent")
	}
	static class UActionRollComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActionRollComponent>();
	}
};
DUMPER7_ASSERTS_UActionRollComponent;

// Class Smuta.ActionWorkPOI
// 0x0068 (0x0338 - 0x02D0)
class AActionWorkPOI : public AHumanPOI
{
public:
	TMap<EGenderType, class UMatrixProfDataAsset*> ActionData;                                       // 0x02D0(0x0050)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	class ASpeakerHumanPOI*                       Speaker;                                           // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ActivateAnimals;                                   // 0x0328(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_329[0x7];                                      // 0x0329(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AEatVillagePOI*                         AnimalPOI;                                         // 0x0330(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActionWorkPOI")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActionWorkPOI")
	}
	static class AActionWorkPOI* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActionWorkPOI>();
	}
};
DUMPER7_ASSERTS_AActionWorkPOI;

// Class Smuta.ActivateAbilitiesEffectComponent
// 0x0000 (0x0038 - 0x0038)
class UActivateAbilitiesEffectComponent final : public UAbilitiesGameplayEffectComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActivateAbilitiesEffectComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivateAbilitiesEffectComponent")
	}
	static class UActivateAbilitiesEffectComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UActivateAbilitiesEffectComponent>();
	}
};
DUMPER7_ASSERTS_UActivateAbilitiesEffectComponent;

// Class Smuta.ActivatedActor
// 0x0060 (0x02F8 - 0x0298)
class AActivatedActor : public AActor
{
public:
	uint8                                         Pad_298[0x8];                                      // 0x0298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	EActivatedObjectState                         CurrentState;                                      // 0x02A0(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(EActivatedObjectState State)> OnObjectStateChanged;                // 0x02A8(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                          ShouldRaiseNoiseOnStateChange;                     // 0x02B8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2B9[0x3];                                      // 0x02B9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DetectionScaleValue;                               // 0x02BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseRadius;                                       // 0x02C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NoiseMaxRange;                                     // 0x02C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldChangeStateFromMelee;                        // 0x02C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldChangeStateFromRange;                        // 0x02C9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ShouldChangeStateFromHit;                          // 0x02CA(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2CB[0x1];                                      // 0x02CB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MaxHitPointsToChangeState;                         // 0x02CC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EActivatedObjectState                         StateToChange;                                     // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        SceneComponent;                                    // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class AActivatedActor>> ChildActors;                                       // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                         ReceivedHitPoints;                                 // 0x02F0(0x0004)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ChangeActivateObjectState(EActivatedObjectState NewState);
	class UPrimitiveComponent* GetHitPointReceiverComponent();
	void OnReceiverComponentHit(class UPrimitiveComponent* HitComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, const struct FHitResult& Hit);
	void PreChangeActivateObjectState(EActivatedObjectState NewState);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActivatedActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ActivatedActor")
	}
	static class AActivatedActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AActivatedActor>();
	}
};
DUMPER7_ASSERTS_AActivatedActor;

// Class Smuta.SignificanceActorComponent
// 0x0018 (0x00B8 - 0x00A0)
class USignificanceActorComponent : public UActorComponent
{
public:
	uint8                                         Pad_A0[0x9];                                       // 0x00A0(0x0009)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bSkipOptimization;                                 // 0x00A9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_AA[0xE];                                       // 0x00AA(0x000E)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DisableOptimization();
	bool GetSkipOtimization();
	void SetSkipOptimization(bool bSkip);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SignificanceActorComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SignificanceActorComponent")
	}
	static class USignificanceActorComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<USignificanceActorComponent>();
	}
};
DUMPER7_ASSERTS_USignificanceActorComponent;

// Class Smuta.ActorOptimizationComponent
// 0x0018 (0x00D0 - 0x00B8)
class UActorOptimizationComponent final : public USignificanceActorComponent
{
public:
	float                                         MeshUpdateRateLowReductionScore;                   // 0x00B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MeshUpdateRateMediumReductionScore;                // 0x00BC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         MeshUpdateRateHighReductionScore;                  // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ActorTickReductionUpdateScore;                     // 0x00C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         DisableWidgetsScore;                               // 0x00C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ActorOptimizationComponent")
	}
