#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Sprint_GA

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Sprint_GA.Sprint_GA_C
// 0x0028 (0x0488 - 0x0460)
class USprint_GA_C final : public UAbilityBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0460(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FActiveGameplayEffectHandle            SprintSpec;                                        // 0x0468(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            SprintGE;                                          // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TSubclassOf<class UGameplayEffect>            HungerGE;                                          // 0x0478(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FActiveGameplayEffectHandle            HungerSpec;                                        // 0x0480(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Sprint_GA(int32 EntryPoint);
	void K2_ActivateAbility();
	void K2_OnEndAbility(bool bWasCancelled);
	void OnRelease_18D644EA49CA02EA639DBC8131747F9C(float TimeHeld);
	void OnReleased();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Sprint_GA_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Sprint_GA_C")
	}
	static class USprint_GA_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USprint_GA_C>();
	}
};
DUMPER7_ASSERTS_USprint_GA_C;

}

