#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Str_ImpactMelee

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "CombatHitDetection_structs.hpp"


namespace SDK
{

// UserDefinedStruct Str_ImpactMelee.Str_ImpactMelee
// 0x0030 (0x0030 - 0x0000)
struct FStr_ImpactMelee final
{
public:
	TArray<struct FGameplayTag>                   Tag_17_31D1017848E2BB0820241EA1A502A1DC;           // 0x0000(0x0010)(Edit, BlueprintVisible)
	TArray<EDefenceZoneType>                      DefenceType_21_3CF578714CC4BEB7E621AB80A813C143;   // 0x0010(0x0010)(Edit, BlueprintVisible)
	bool                                          HasArmor_28_5E9417D044FDC4AFC55552B5FFA8DCA6;      // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundWave*                             Sound_11_D77600C845C1D5F3AD7A7F9FFB1F76C0;         // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FStr_ImpactMelee;

}

