#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_HeroLighting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_HeroLighting.STR_HeroLighting
// 0x0030 (0x0030 - 0x0000)
struct FSTR_HeroLighting final
{
public:
	double                                        KeyLight1_6_D5DF487748E3D2E47D0DC5A3FA3DACDC;      // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KeyLight2_4_06DB301B46D055EFD17CCE8A818C3164;      // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        KeyLight3_8_3CFE1E2C498C306D124CDD94E5E1E861;      // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RimLight_10_CD9E5C944928C5507413FDA33BC06C85;      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color_13_4AA42C9745AF9F149E85C7B1BECC484C;         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSTR_HeroLighting;

}

