#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: STR_SkillTree_InventoryItem

#include "Basic.hpp"

#include "E_SkillTree_Category_structs.hpp"


namespace SDK
{

// UserDefinedStruct STR_SkillTree_InventoryItem.STR_SkillTree_InventoryItem
// 0x0030 (0x0030 - 0x0000)
struct FSTR_SkillTree_InventoryItem final
{
public:
	class FString                                 slot_ID_6_0F4F1F5D4F3EB6F89A4F7FAEBB012E8F;        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                          unlocked_4_37409D63441116EDAF0EC1A99704009F;       // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          available_12_ABD9C73F4901D2ABE1A07CB0EF75F67C;     // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_SkillTree_Unit_Base_C*              item_11_19B16B5A43519375614F74B7D48EBF74;          // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         price_15_F2B918EA40A936C6A03BDE99A1A23755;         // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	E_SkillTree_Category                          Category_18_DA2F283248E8D91D80531B90C4217798;      // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemID_22_5EE6526649FA94BEF05B94810297C1F4;        // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsQuestLock_24_2494EC4548747B85CF30EC988494B1B2;   // 0x002C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FSTR_SkillTree_InventoryItem;

}

