#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubtitlesSystem

#include "Basic.hpp"


namespace SDK
{

// Enum SubtitlesSystem.ESubtitlePhraseType
// NumValues: 0x0009
enum class ESubtitlePhraseType : uint8
{
	ESPT_StoryPlayer                         = 0,
	ESPT_StoryNPC                            = 1,
	ESPT_VoiceInside                         = 2,
	ESPT_BattlePlayer                        = 3,
	ESPT_BattleBoss                          = 4,
	ESPT_BattleNPC                           = 5,
	ESPT_DefaultMainNPC                      = 6,
	ESPT_DefaultNPC                          = 7,
	ESPT_MAX                                 = 8,
};

// ScriptStruct SubtitlesSystem.SubtitlesInfo
// 0x0038 (0x0038 - 0x0000)
struct FSubtitlesInfo final
{
public:
	class FText                                   SpeakerName;                                       // 0x0000(0x0018)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0018(0x0018)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	ESubtitlePhraseType                           SubtitlesPhraseType;                               // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FSubtitlesInfo;

// ScriptStruct SubtitlesSystem.SubtitledSound
// 0x0090 (0x0090 - 0x0000)
struct FSubtitledSound final
{
public:
	struct FSubtitlesInfo                         SubtitleInfo;                                      // 0x0000(0x0038)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundWave>              Sound;                                             // 0x0038(0x0028)(Edit, BlueprintVisible, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundAttenuation>       SoundSettings;                                     // 0x0060(0x0028)(Edit, BlueprintVisible, SaveGame, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AActor>                  SoundOwner;                                        // 0x0088(0x0008)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FSubtitledSound;

// ScriptStruct SubtitlesSystem.ActiveSubtitledSound
// 0x0018 (0x0018 - 0x0000)
struct alignas(0x08) FActiveSubtitledSound final
{
public:
	uint8                                         Pad_0[0x18];                                       // 0x0000(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FActiveSubtitledSound;

}

