#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubtitlesSystem

#include "Basic.hpp"

#include "SubtitlesSystem_structs.hpp"


namespace SDK::Params
{

// Function SubtitlesSystem.SubtitlesManager.GetPhraseTypeAdditionalTime
// 0x0008 (0x0008 - 0x0000)
struct SubtitlesManager_GetPhraseTypeAdditionalTime final
{
public:
	ESubtitlePhraseType                           PhraseType;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ReturnValue;                                       // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesManager_GetPhraseTypeAdditionalTime;

// Function SubtitlesSystem.SubtitlesManager.GetPhraseTypePriority
// 0x0002 (0x0002 - 0x0000)
struct SubtitlesManager_GetPhraseTypePriority final
{
public:
	ESubtitlePhraseType                           PhraseType;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesManager_GetPhraseTypePriority;

// Function SubtitlesSystem.SubtitlesManager.GetSubtitlesWidget_K2
// 0x0010 (0x0010 - 0x0000)
struct SubtitlesManager_GetSubtitlesWidget_K2 final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubtitlesWidget*                       ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesManager_GetSubtitlesWidget_K2;

// Function SubtitlesSystem.SubtitlesManager.PlaySubtitledSound
// 0x0060 (0x0060 - 0x0000)
struct SubtitlesManager_PlaySubtitledSound final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSubtitlesInfo                         SubtitlesInfo;                                     // 0x0008(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class USoundWave*                             Sound;                                             // 0x0040(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundAttenuation*                      SoundSettings;                                     // 0x0048(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 SoundOwner;                                        // 0x0050(0x0008)(Parm, ZeroConstructor, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipQueue;                                        // 0x0058(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SubtitlesManager_PlaySubtitledSound;

// Function SubtitlesSystem.SubtitlesManager.RegisterSubtitlesWidget
// 0x0010 (0x0010 - 0x0000)
struct SubtitlesManager_RegisterSubtitlesWidget final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USubtitlesWidget*                       NewSubtitlesWidget;                                // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesManager_RegisterSubtitlesWidget;

// Function SubtitlesSystem.SubtitlesManager.SkipAllSubtitles
// 0x0008 (0x0008 - 0x0000)
struct SubtitlesManager_SkipAllSubtitles final
{
public:
	const class UObject*                          WorldContext;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesManager_SkipAllSubtitles;

// Function SubtitlesSystem.SubtitlesManager.GetSubtitleOfType
// 0x00A0 (0x00A0 - 0x0000)
struct SubtitlesManager_GetSubtitleOfType final
{
public:
	ESubtitlePhraseType                           Type;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSubtitledSound                        OutSubtitle;                                       // 0x0008(0x0090)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0098(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_SubtitlesManager_GetSubtitleOfType;

// Function SubtitlesSystem.SubtitlesManager.GetSubtitlesQueue
// 0x0010 (0x0010 - 0x0000)
struct SubtitlesManager_GetSubtitlesQueue final
{
public:
	TArray<struct FSubtitlesInfo>                 OutSubtitles;                                      // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesManager_GetSubtitlesQueue;

// Function SubtitlesSystem.SubtitlesManager.GetSubtitlesWidget
// 0x0008 (0x0008 - 0x0000)
struct SubtitlesManager_GetSubtitlesWidget final
{
public:
	class USubtitlesWidget*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesManager_GetSubtitlesWidget;

// Function SubtitlesSystem.SubtitlesWidget.AddedSubtitle
// 0x0040 (0x0040 - 0x0000)
struct SubtitlesWidget_AddedSubtitle final
{
public:
	struct FSubtitlesInfo                         SubtitlesInfo;                                     // 0x0000(0x0038)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UWidget*                                ReturnValue;                                       // 0x0038(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesWidget_AddedSubtitle;

// Function SubtitlesSystem.SubtitlesWidget.RegisterSubtitleWidget
// 0x0008 (0x0008 - 0x0000)
struct SubtitlesWidget_RegisterSubtitleWidget final
{
public:
	class UWidget*                                SubtitleWidget;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SubtitlesWidget_RegisterSubtitleWidget;

}

