#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskBP_GetLoc_Random_ANX

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass TaskBP_GetLoc_Random_ANX.TaskBP_GetLoc_Random_ANX_C
// 0x0088 (0x0130 - 0x00A8)
class UTaskBP_GetLoc_Random_ANX_C final : public UBTTask_BlueprintBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FBlackboardKeySelector                 Key;                                               // 0x00B0(0x0028)(Edit, BlueprintVisible)
	struct FBlackboardKeySelector                 Max_Radius;                                        // 0x00D8(0x0028)(Edit, BlueprintVisible)
	struct FVector                                Pawn_Loc;                                          // 0x0100(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Random_Loc;                                        // 0x0118(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_TaskBP_GetLoc_Random_ANX(int32 EntryPoint);
	void ReceiveExecuteAI(class AAIController* OwnerController, class APawn* ControlledPawn);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("TaskBP_GetLoc_Random_ANX_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"TaskBP_GetLoc_Random_ANX_C")
	}
	static class UTaskBP_GetLoc_Random_ANX_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTaskBP_GetLoc_Random_ANX_C>();
	}
};
DUMPER7_ASSERTS_UTaskBP_GetLoc_Random_ANX_C;

}

