#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskBP_Attack_ANX

#include "Basic.hpp"


namespace SDK::Params
{

// Function TaskBP_Attack_ANX.TaskBP_Attack_ANX_C.ExecuteUbergraph_TaskBP_Attack_ANX
// 0x0028 (0x0028 - 0x0000)
struct TaskBP_Attack_ANX_C_ExecuteUbergraph_TaskBP_Attack_ANX final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ACharBP_Base_C*                         K2Node_DynamicCast_AsChar_BP_Base;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TaskBP_Attack_ANX_C_ExecuteUbergraph_TaskBP_Attack_ANX;

// Function TaskBP_Attack_ANX.TaskBP_Attack_ANX_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct TaskBP_Attack_ANX_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_TaskBP_Attack_ANX_C_ReceiveExecuteAI;

}

