#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TimeManager

#include "Basic.hpp"


namespace SDK::Params
{

// Function TimeManager.TimeManagerSubsystem.RemoveGlobalTimeDilation
// 0x0008 (0x0008 - 0x0000)
struct TimeManagerSubsystem_RemoveGlobalTimeDilation final
{
public:
	const class UObject*                          RequestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeManagerSubsystem_RemoveGlobalTimeDilation;

// Function TimeManager.TimeManagerSubsystem.RemoveLocalTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct TimeManagerSubsystem_RemoveLocalTimeDilation final
{
public:
	const class UObject*                          RequestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeManagerSubsystem_RemoveLocalTimeDilation;

// Function TimeManager.TimeManagerSubsystem.SetGlobalTimeDilation
// 0x0010 (0x0010 - 0x0000)
struct TimeManagerSubsystem_SetGlobalTimeDilation final
{
public:
	const class UObject*                          RequestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewTimeDilation;                                   // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeDilationSpeed;                                 // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeManagerSubsystem_SetGlobalTimeDilation;

// Function TimeManager.TimeManagerSubsystem.SetGlobalTimeDilationForDuration
// 0x0010 (0x0010 - 0x0000)
struct TimeManagerSubsystem_SetGlobalTimeDilationForDuration final
{
public:
	const class UObject*                          RequestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TimeDilation;                                      // 0x0008(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Duration;                                          // 0x000C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_TimeManagerSubsystem_SetGlobalTimeDilationForDuration;

// Function TimeManager.TimeManagerSubsystem.SetLocalTimeDilation
// 0x0018 (0x0018 - 0x0000)
struct TimeManagerSubsystem_SetLocalTimeDilation final
{
public:
	const class UObject*                          RequestObject;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	const class AActor*                           TargetActor;                                       // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         NewTimeDilation;                                   // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_TimeManagerSubsystem_SetLocalTimeDilation;

}

