#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDF_SmutaPrime

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UDF_SmutaPrime.UDF_SmutaPrime_C
// 0x0020 (0x0050 - 0x0030)
class UUDF_SmutaPrime_C final : public UPrimaryDataAsset
{
public:
	int32                                         Fires_Illumination;                                // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        Wetness;                                           // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 VolumetricFogTint;                                 // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 SpriteFogTint;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 WindDirection;                                     // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void F_SetVars(int32 Fires, double Wetness_0, const struct FColor& VolumetricFogTint_0, const struct FColor& SpriteFogTint_0, const struct FColor& WidnDirection);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UDF_SmutaPrime_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UDF_SmutaPrime_C")
	}
	static class UUDF_SmutaPrime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUDF_SmutaPrime_C>();
	}
};
DUMPER7_ASSERTS_UUDF_SmutaPrime_C;

}

