#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDS_SmutaPrime

#include "Basic.hpp"


namespace SDK::Params
{

// Function UDS_SmutaPrime.UDS_SmutaPrime_C.F_LoadUDSVars
// 0x0018 (0x0018 - 0x0000)
struct UDS_SmutaPrime_C_F_LoadUDSVars final
{
public:
	class ABP_Ultra_Dynamic_Sky_C*                UDS_Ref;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Ultra_Dynamic_Sky_C*                UDS;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UDS_SmutaPrime_C_F_LoadUDSVars;

// Function UDS_SmutaPrime.UDS_SmutaPrime_C.F_SetUDSVars
// 0x0018 (0x0018 - 0x0000)
struct UDS_SmutaPrime_C_F_SetUDSVars final
{
public:
	class ABP_Ultra_Dynamic_Sky_C*                UDS_Ref;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Ultra_Dynamic_Sky_C*                UDS;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UDS_SmutaPrime_C_F_SetUDSVars;

}

