#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UDW_SmutaPrime

#include "Basic.hpp"


namespace SDK::Params
{

// Function UDW_SmutaPrime.UDW_SmutaPrime_C.F_LoadUDWVars
// 0x0018 (0x0018 - 0x0000)
struct UDW_SmutaPrime_C_F_LoadUDWVars final
{
public:
	class ABP_Ultra_Dynamic_Weather_C*            UDW_Ref;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Ultra_Dynamic_Weather_C*            UDW;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UDW_SmutaPrime_C_F_LoadUDWVars;

// Function UDW_SmutaPrime.UDW_SmutaPrime_C.F_SetUDWVars
// 0x0018 (0x0018 - 0x0000)
struct UDW_SmutaPrime_C_F_SetUDWVars final
{
public:
	class ABP_Ultra_Dynamic_Weather_C*            UDW_Ref;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Ultra_Dynamic_Weather_C*            UDW;                                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UDW_SmutaPrime_C_F_SetUDWVars;

}

