#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Container_HUD

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UI_ContainerBase_classes.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Container_HUD.UI_Container_HUD_C
// 0x0060 (0x0350 - 0x02F0)
class UUI_Container_HUD_C final : public UUI_ContainerBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_Container_HUD_C;                 // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCommonActivatableWidgetStack*          HUDStack;                                          // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonActivatableWidgetStack*          PopUpStack;                                        // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_NotifyBox_C*                        UI_NotifyBox;                                      // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_VersionInfo_C*                      UI_VersionInfo;                                    // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_CodexPopup_C*                      WBP_CodexPopup;                                    // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_DayNightClock_C*                   WBP_DayNightClock;                                 // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_IngameTabHint_C*                   WBP_IngameTabHint;                                 // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ItemsNotification_C*               WBP_ItemsNotification;                             // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Menu_Base_C*                        CurrentMenuRef;                                    // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUI_Menu_Base_C* CurrentMenu)> OnHUDLayerChange;             // 0x0340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Change_Codex_Anim_Activity(bool Active);
	void Construct();
	void ExecuteUbergraph_UI_Container_HUD(int32 EntryPoint);
	void FractionIfluenceChanged(const ESmutaDLCFraction& Fraction, float DeltaInfluence);
	void GetPopupOfClass(TSoftClassPtr<class UClass> PopUp, class UWidget** Result);
	void PushMenu(TSoftClassPtr<class UClass> Menu);
	void PushPopUp(TSoftClassPtr<class UClass> PopUp, class UUI_Menu_Base_C* ParentMenu);
	void PushWidget(TSoftClassPtr<class UClass> WidgetClass, class UCommonActivatableWidget** Result);
	void RemovePopUp(TSoftClassPtr<class UClass> PopUp);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Container_HUD_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Container_HUD_C")
	}
	static class UUI_Container_HUD_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Container_HUD_C>();
	}
};
DUMPER7_ASSERTS_UUI_Container_HUD_C;

}

