#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Codex_CategoryArticles

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Codex_CategoryArticles.UI_Codex_CategoryArticles_C
// 0x00F8 (0x03B8 - 0x02C0)
class UUI_Codex_CategoryArticles_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           ArticlesButtonsBox;                                // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 CategoryImage;                                     // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 NotificationImage;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             OpenedCountText;                                   // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SlashText;                                         // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SpacerLineImage;                                   // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TitleText;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalCountText;                                    // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_CodexArticleButton_C*               UI_CodexArticleButton_Template;                    // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   CategoryNameText;                                  // 0x0310(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	TSoftObjectPtr<class UTexture2D>              ImageRef;                                          // 0x0328(0x0028)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class FName>                           NewArticles;                                       // 0x0350(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         OpenedArticlesCount;                               // 0x0360(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TotalArticlesCount;                                // 0x0364(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            SelectedCategoryColor;                             // 0x0368(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            NormalCategoryColor;                               // 0x037C(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            EmptyCategoryColor;                                // 0x0390(0x0014)(Edit, BlueprintVisible, DisableEditOnInstance)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 ActiveCategoryButtonStyle;                         // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 InactiveCategoryButtonStyle;                       // 0x03B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void AppendArticleButton(class FName ArticleId, bool bUseTutorialID, class FName TutorialID, class UUI_CodexArticleButton_C** Out);
	void Construct();
	void Create_New_Article_Button(class FName ArticleId, bool bUseTutorial, class FName TutorialID, class UUI_CodexArticleButton_C** Out);
	void ExecuteUbergraph_UI_Codex_CategoryArticles(int32 EntryPoint);
	struct FLinearColor Get_NotificationImage_ColorAndOpacity();
	class FText Get_OpenedCountText_Text();
	class FText Get_TotalCountText_Text();
	bool HasNewArticles();
	void PreConstruct(bool IsDesignTime);
	void Push_Category_Article_Button(class UUI_CodexArticleButton_C* CodexArticleButton, class UUI_CodexArticleButton_C** Out);
	void SetCategoryColor(const struct FSlateColor& Color);
	void SetTotalArticlesCountForCategory(int32 Count);
	void Update_Category_Appearance(bool Selected);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Codex_CategoryArticles_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Codex_CategoryArticles_C")
	}
	static class UUI_Codex_CategoryArticles_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Codex_CategoryArticles_C>();
	}
};
DUMPER7_ASSERTS_UUI_Codex_CategoryArticles_C;

}

