#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Debug_BattleNPCState

#include "Basic.hpp"

#include "EBattleNPCState_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Debug_BattleNPCState.UI_Debug_BattleNPCState_C
// 0x0040 (0x0300 - 0x02C0)
class UUI_Debug_BattleNPCState_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             Hit;                                               // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             State;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ANPC_CH_NewBattleSystem_C*              Owner;                                             // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                 Prefix;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                 Text;                                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent(const struct FGameplayTag& UpdatedTag, bool Exists);
	void ExecuteUbergraph_UI_Debug_BattleNPCState(int32 EntryPoint);
	class FText Get_Hit_Text();
	ESlateVisibility Get_Hit_Visibility();
	void SetPrefix(const class FString& Prefix_0, class FString* PrevPrefix);
	void SetState(EBattleNPCState BattleState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Debug_BattleNPCState_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Debug_BattleNPCState_C")
	}
	static class UUI_Debug_BattleNPCState_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Debug_BattleNPCState_C>();
	}
};
DUMPER7_ASSERTS_UUI_Debug_BattleNPCState_C;

}

