#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EquipmentSlot_1HandR

#include "Basic.hpp"

#include "InventorySystemModule_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_EquipmentSlot_1HandR.UI_EquipmentSlot_1HandR_C.ExecuteUbergraph_UI_EquipmentSlot_1HandR
// 0x0130 (0x0130 - 0x0000)
struct UI_EquipmentSlot_1HandR_C_ExecuteUbergraph_UI_EquipmentSlot_1HandR final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x0040(0x0078)(ConstParm)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x00B8(0x0078)(ConstParm)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_1HandR_C_ExecuteUbergraph_UI_EquipmentSlot_1HandR;

// Function UI_EquipmentSlot_1HandR.UI_EquipmentSlot_1HandR_C.OnMouseEnter
// 0x00B0 (0x00B0 - 0x0000)
struct UI_EquipmentSlot_1HandR_C_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_1HandR_C_OnMouseEnter;

// Function UI_EquipmentSlot_1HandR.UI_EquipmentSlot_1HandR_C.OnMouseLeave
// 0x0078 (0x0078 - 0x0000)
struct UI_EquipmentSlot_1HandR_C_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0078)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_1HandR_C_OnMouseLeave;

// Function UI_EquipmentSlot_1HandR.UI_EquipmentSlot_1HandR_C.GetImage
// 0x0008 (0x0008 - 0x0000)
struct UI_EquipmentSlot_1HandR_C_GetImage final
{
public:
	class UImage*                                 Icon_0;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_1HandR_C_GetImage;

// Function UI_EquipmentSlot_1HandR.UI_EquipmentSlot_1HandR_C.InitSlot
// 0x0018 (0x0018 - 0x0000)
struct UI_EquipmentSlot_1HandR_C_InitSlot final
{
public:
	class UAppearanceItem*                        Appearance;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EHand                                         Temp_byte_Variable;                                // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEquipmentSlotType                            Temp_byte_Variable_1;                              // 0x0009(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UEquipmentItem*                         CallFunc_GetItem_ReturnValue;                      // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_1HandR_C_InitSlot;

// Function UI_EquipmentSlot_1HandR.UI_EquipmentSlot_1HandR_C.Set Slot Selected
// 0x0005 (0x0005 - 0x0000)
struct UI_EquipmentSlot_1HandR_C_Set_Slot_Selected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_1HandR_C_Set_Slot_Selected;

}

