#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EquipmentSlots_Shish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UI_EquipmentSlots_Base_classes.hpp"
#include "InventorySystemModule_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_EquipmentSlots_Shish.UI_EquipmentSlots_Shish_C
// 0x0090 (0x0380 - 0x02F0)
class UUI_EquipmentSlots_Shish_C final : public UUI_EquipmentSlots_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ClassIcon;                                         // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_AlternativeItemsCounter_C*          ConsCounter;                                       // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_105;                                         // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_198;                                         // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_AlternativeItemsCounter_C*          RangeWeaponCounter;                                // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StackSlotImage;                                    // 0x0320(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EquipmentSlot_1HandL_C*             UI_EquipmentSlot_1HandL;                           // 0x0328(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EquipmentSlot_1HandR_C*             UI_EquipmentSlot_1HandR;                           // 0x0330(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EquipmentSlot_Item_C*               UI_EquipmentSlot_Cons1;                            // 0x0338(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EquipmentSlot_Item2_C*              UI_EquipmentSlot_Cons2;                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EquipmentSlot_Gun_C*                UI_EquipmentSlot_Gun_;                             // 0x0348(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EquipmentSlot_2_C*                  UI_EquipmentSlot_Secondary;                        // 0x0350(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_FightMassage_C*                     UI_FightMassage;                                   // 0x0358(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_AlternativeItemsCounter_C*          Weapon2Counter;                                    // 0x0360(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_AlternativeItemsCounter_C*          WeaponCounter1;                                    // 0x0368(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_AlternativeItemsCounter_C*          WeaponCounter2;                                    // 0x0370(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEquipmentItem*                         ItemData;                                          // 0x0378(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_EquipmentSlots_Shish(int32 EntryPoint);
	void GetCharacterType(class UTexture2D** Image, EAvailableInImagery* Type, TSoftObjectPtr<class UTexture2D>* BigImage);
	void GetDesiredFocusTarget(class UWidget** Target);
	void InitEqupmentSlots(class UAppearanceItem* Appearance_0);
	void InitImage(class UEquipmentItem* Texture);
	void SetVisibilityForSlots(const struct FGameplayTag& UpdatedTag, bool Exists);
	void UpdateDescription(class UUI_EquipmentSlot_Base_C* Slot_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_EquipmentSlots_Shish_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_EquipmentSlots_Shish_C")
	}
	static class UUI_EquipmentSlots_Shish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_EquipmentSlots_Shish_C>();
	}
};
DUMPER7_ASSERTS_UUI_EquipmentSlots_Shish_C;

}

