#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EquipmentSlot_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C
// 0x0040 (0x15E0 - 0x15A0)
#pragma pack(push, 0x1)
class alignas(0x10) UUI_EquipmentSlot_Base_C : public USmutaCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          IsSelected;                                        // 0x15A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15A9[0x3];                                     // 0x15A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         SlotIndex;                                         // 0x15AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(int32 SlotIndex)> OnSelected;                                      // 0x15B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnDoubleClicked;                                   // 0x15C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UEquipmentItem*                         Item;                                              // 0x15D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnDoubleClicked();
	void BP_OnSelected();
	void ExecuteUbergraph_UI_EquipmentSlot_Base(int32 EntryPoint);
	void FillMiniIcons();
	void GetImage(class UImage** Icon);
	void InitItem(class UEquipmentItem* EquipmentItem);
	void InitSlot(class UAppearanceItem* Appearance);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void Set_Slot_Selected(bool Selected);
	void SetIsHovered(class UImage* HoverFrame, bool Hovered);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_EquipmentSlot_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_EquipmentSlot_Base_C")
	}
	static class UUI_EquipmentSlot_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_EquipmentSlot_Base_C>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UUI_EquipmentSlot_Base_C;

}

