#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EquipmentSlot_2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UI_EquipmentSlot_Base_classes.hpp"
#include "InventorySystemModule_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_EquipmentSlot_2.UI_EquipmentSlot_2_C
// 0x0020 (0x1600 - 0x15E0)
class UUI_EquipmentSlot_2_C final : public UUI_EquipmentSlot_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_EquipmentSlot_2_C;               // 0x15D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 HoverFrame;                                        // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 SelectFrame;                                       // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_AlternativeItemsCounter_C*          UI_AlternativeItemsCounter;                        // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_EquipmentSlot_2(int32 EntryPoint);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void GetImage(class UImage** Icon_0);
	void InitSlot(class UAppearanceItem* Appearance);
	void Set_Slot_Selected(bool Selected);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_EquipmentSlot_2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_EquipmentSlot_2_C")
	}
	static class UUI_EquipmentSlot_2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_EquipmentSlot_2_C>();
	}
};
DUMPER7_ASSERTS_UUI_EquipmentSlot_2_C;

}

