#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EquipmentSlots_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_EquipmentSlots_Base.UI_EquipmentSlots_Base_C
// 0x0030 (0x02F0 - 0x02C0)
class UUI_EquipmentSlots_Base_C : public UUserWidget
{
public:
	TArray<class UUI_EquipmentSlot_Base_C*>       EquipmentSlotsWidgets;                             // 0x02C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                         SelectedSlotIndex;                                 // 0x02D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void()>              OnSlotDoubleClicked;                               // 0x02D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAppearanceItem*                        Appearance;                                        // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void GetDesiredFocusTarget(class UWidget** Target);
	void InitEqupmentSlots(class UAppearanceItem* Appearance_0);
	void SetSlotSelected(int32 SlotIndex);
	void ShowIcon(class UImage* Icon, bool Show);
	void SlotDoubleClicked();
	void UpdateDescription(class UUI_EquipmentSlot_Base_C* Slot_0);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_EquipmentSlots_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_EquipmentSlots_Base_C")
	}
	static class UUI_EquipmentSlots_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_EquipmentSlots_Base_C>();
	}
};
DUMPER7_ASSERTS_UUI_EquipmentSlots_Base_C;

}

