#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EquipmentSlot_Base

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.ExecuteUbergraph_UI_EquipmentSlot_Base
// 0x0010 (0x0010 - 0x0000)
struct UI_EquipmentSlot_Base_C_ExecuteUbergraph_UI_EquipmentSlot_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0008(0x0008)(NoDestructor)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_ExecuteUbergraph_UI_EquipmentSlot_Base;

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.GetImage
// 0x0008 (0x0008 - 0x0000)
struct UI_EquipmentSlot_Base_C_GetImage final
{
public:
	class UImage*                                 Icon;                                              // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_GetImage;

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.InitItem
// 0x0038 (0x0038 - 0x0000)
struct UI_EquipmentSlot_Base_C_InitItem final
{
public:
	class UEquipmentItem*                         EquipmentItem;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UImage*                                 CallFunc_GetImage_Icon;                            // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_InitItem;

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.InitSlot
// 0x0008 (0x0008 - 0x0000)
struct UI_EquipmentSlot_Base_C_InitSlot final
{
public:
	class UAppearanceItem*                        Appearance;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_InitSlot;

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UI_EquipmentSlot_Base_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_OnRemovedFromFocusPath;

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_EquipmentSlot_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_PreConstruct;

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.Set Slot Selected
// 0x0001 (0x0001 - 0x0000)
struct UI_EquipmentSlot_Base_C_Set_Slot_Selected final
{
public:
	bool                                          Selected;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_Set_Slot_Selected;

// Function UI_EquipmentSlot_Base.UI_EquipmentSlot_Base_C.SetIsHovered
// 0x0010 (0x0010 - 0x0000)
struct UI_EquipmentSlot_Base_C_SetIsHovered final
{
public:
	class UImage*                                 HoverFrame;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Hovered;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_EquipmentSlot_Base_C_SetIsHovered;

}

