#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_HUD_Hint

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_HUD_Hint.UI_HUD_Hint_C.ExecuteUbergraph_UI_HUD_Hint
// 0x0008 (0x0008 - 0x0000)
struct UI_HUD_Hint_C_ExecuteUbergraph_UI_HUD_Hint final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_HUD_Hint_C_ExecuteUbergraph_UI_HUD_Hint;

// Function UI_HUD_Hint.UI_HUD_Hint_C.InitHint
// 0x0030 (0x0030 - 0x0000)
struct UI_HUD_Hint_C_InitHint final
{
public:
	struct FDataTableRowHandle                    Input_0;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class UInputAction*                           EnhancedInputAction;                               // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDataTableRowHandle>            K2Node_MakeArray_Array;                            // 0x0018(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_HUD_Hint_C_InitHint;

// Function UI_HUD_Hint.UI_HUD_Hint_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_HUD_Hint_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_HUD_Hint_C_PreConstruct;

}

