#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Graphics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "StreamlineBlueprint_structs.hpp"
#include "UI_SettingMenu_Base_classes.hpp"
#include "StreamlineDLSSGBlueprint_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Graphics.UI_Menu_Graphics_C
// 0x0118 (0x0558 - 0x0440)
class UUI_Menu_Graphics_C final : public UUI_SettingMenu_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_SelectorTest_C*                     Antialiasing_QualityButton;                        // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     AntiAliasingMethod_Button;                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             CustomSettingsBox;                                 // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           DescriptionVerticalBox;                            // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Effects_QualityButton;                             // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Foliage_QualityButton;                             // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     GenerationFrame_Button;                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Global_SelectorButton;                             // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     GlobalIllumination_ModeButton;                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     GlobalIllumination_QualityButton;                  // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_207;                                         // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     LensFlare_Button;                                  // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     MotionBlur_Button;                                 // 0x04B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     NvidiaReflex_Button;                               // 0x04B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     PostProcessing_QualityButton;                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Reflections_ModeButton;                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Reflections_QualityButton;                         // 0x04D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     ResolutionScale_SelectorButton;                    // 0x04D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Description;                         // 0x04E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Shading_QualityButton;                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Shadows_QualityButton;                             // 0x04F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SettingsSlider_C*                   SharpnessSlider;                                   // 0x04F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_OptionName;                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     Textures_QualityButton;                            // 0x0508(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     ViewDistance_SelectorButton;                       // 0x0510(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     VirtualShadowMap_Button;                           // 0x0518(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SelectorTest_C*                     VolumetricFog_Button;                              // 0x0520(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          SettingsEnabled;                                   // 0x0528(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_529[0x7];                                      // 0x0529(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUI_SelectorTest_C*>             Options;                                           // 0x0530(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class USmutaGameUserSettings*                 Smuta_Game_User_Settings;                          // 0x0540(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          Debug;                                             // 0x0548(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x7];                                      // 0x0549(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDefaultSettings_C*                     DefaultSettings;                                   // 0x0550(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	class UWidget* Antialiasing_Navigation(EUINavigation Navigation_0);
	void BndEvt__UI_Menu_Graphics_Antialiasing_QualityButton_K2Node_ComponentBoundEvent_3_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_AntiAliasingMethod_Button_K2Node_ComponentBoundEvent_27_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_Effects_QualityButton_K2Node_ComponentBoundEvent_6_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_Foliage_QualityButton_K2Node_ComponentBoundEvent_8_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_GenerationFrame_Button_K2Node_ComponentBoundEvent_0_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_Global_SelectorButton_K2Node_ComponentBoundEvent_1_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_GlobalIllumination_QualityButton_K2Node_ComponentBoundEvent_10_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_PostProcessing_QualityButton_K2Node_ComponentBoundEvent_4_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_Reflections_QualityButton_K2Node_ComponentBoundEvent_12_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_ResolutionScale_SelectorButton_K2Node_ComponentBoundEvent_11_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_Shading_QualityButton_K2Node_ComponentBoundEvent_7_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_Shadows_QualityButton_K2Node_ComponentBoundEvent_5_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_Textures_QualityButton_K2Node_ComponentBoundEvent_9_OnRotated__DelegateSignature(int32 Value);
	void BndEvt__UI_Menu_Graphics_ViewDistance_SelectorButton_K2Node_ComponentBoundEvent_2_OnRotated__DelegateSignature(int32 Value);
	void BP_OnActivated();
	void CancelOptions();
	void Construct();
	void EnableCustomSettings(int32 Value);
	void ExecuteUbergraph_UI_Menu_Graphics(int32 EntryPoint);
	void HasUnsavedOption(bool* Result);
	void OnSelectedChangedBase_Event(class UCommonButtonBase* Button, bool Selected);
	void PreConstruct(bool IsDesignTime);
	class UWidget* ReflexNavigation(EUINavigation Navigation_0);
	void RestoreDefaults();
	void SaveOptions();
	void SetCustomPreset(int32 Selected_Index);
	void SetDescription(const class FText& ParameterName, const class FText& Descriprion);
	void SetGlobalPreset(int32 Selected_Index);
	void Update_Settings(class USmutaGameUserSettings* Smuta_Game_User_Settings_0);
	void UpdateFrameGenerationUISettings();
	void UpdateReflexUISettings();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Menu_Graphics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Menu_Graphics_C")
	}
	static class UUI_Menu_Graphics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Graphics_C>();
	}
};
DUMPER7_ASSERTS_UUI_Menu_Graphics_C;

}

