#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MenuActionButton_NoText

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_MenuActionButton_NoText.UI_MenuActionButton_NoText_C.ExecuteUbergraph_UI_MenuActionButton_NoText
// 0x0030 (0x0030 - 0x0000)
struct UI_MenuActionButton_NoText_C_ExecuteUbergraph_UI_MenuActionButton_NoText final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    CallFunc_GetInputAction_InputActionRow;            // 0x0008(0x0010)(NoDestructor)
	bool                                          CallFunc_GetInputAction_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           CallFunc_GetEnhancedInputAction_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_MenuActionButton_NoText_C_ExecuteUbergraph_UI_MenuActionButton_NoText;

// Function UI_MenuActionButton_NoText.UI_MenuActionButton_NoText_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_MenuActionButton_NoText_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_MenuActionButton_NoText_C_PreConstruct;

}

