#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Equipment

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InventorySystemModule_structs.hpp"
#include "UMG_structs.hpp"
#include "UI_Menu_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Equipment.UI_Menu_Equipment_C
// 0x0050 (0x0470 - 0x0420)
class UUI_Menu_Equipment_C final : public UUI_Menu_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background_1;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 BTN_Accept;                                        // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 BTN_Back;                                          // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 BTN_Navigation;                                    // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Header;                                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Equipment_ItemDescription_C*        UI_Equipment_ItemDescription;                      // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_EquipmentSlots_Shish_C*             UI_EquipmentSlots_Shish;                           // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAppearanceItem*                        AppearanceItem;                                    // 0x0460(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	EAvailableInImagery                           Imagery;                                           // 0x0468(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          InTabMenu;                                         // 0x0469(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Equipment_BTN_Accept_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UI_Menu_Equipment_BTN_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UI_Menu_Equipment_UI_EquipmentSlots_Shish_K2Node_ComponentBoundEvent_2_OnSlotDoubleClicked__DelegateSignature();
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Equipment(int32 EntryPoint);
	ESlateVisibility Get_Header_Visibility();
	void GetSelectedSlot(int32* Slot_0);
	void Init_Equipment(int32 Index_0);
	void InitBoyar();
	void InitMercenary();
	void InitShish();
	void InitStreletc();

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Menu_Equipment_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Menu_Equipment_C")
	}
	static class UUI_Menu_Equipment_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Equipment_C>();
	}
};
DUMPER7_ASSERTS_UUI_Menu_Equipment_C;

}

