#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Pause

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SmutaCommon_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UI_Menu_Base_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Pause.UI_Menu_Pause_C
// 0x0048 (0x0468 - 0x0420)
class UUI_Menu_Pause_C final : public UUI_Menu_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       A_ShowControls;                                    // 0x0428(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       A_Appear;                                          // 0x0430(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Controls;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_LeftPanel;                                   // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_128;                                       // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_PauseMenu_ButtonPanel_C*            PauseMenuList;                                     // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_VersionInfo_C*                      UI_VersionInfo;                                    // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_DebugStartQuest_C*                   W_DebugStartQuest;                                 // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Pause_PauseMenuList_K2Node_ComponentBoundEvent_0_ContinueClicked__DelegateSignature();
	void BndEvt__UI_Menu_Pause_PauseMenuList_K2Node_ComponentBoundEvent_0_ControlsClicked__DelegateSignature();
	void BndEvt__UI_Menu_Pause_PauseMenuList_K2Node_ComponentBoundEvent_0_ControlsSelected__DelegateSignature(bool Selected);
	void BndEvt__UI_Menu_Pause_PauseMenuList_K2Node_ComponentBoundEvent_2_SaveGameClicked__DelegateSignature();
	void BndEvt__UI_Menu_Pause_PauseMenuList_K2Node_ComponentBoundEvent_3_LoadGameClicked__DelegateSignature();
	void BndEvt__UI_Menu_Pause_PauseMenuList_K2Node_ComponentBoundEvent_4_OptionsClicked__DelegateSignature();
	void BndEvt__UI_Menu_Pause_PauseMenuList_K2Node_ComponentBoundEvent_5_QuitToMenuClicked__DelegateSignature();
	void BndEvt__UI_Menu_Pause_W_DebugStartQuest_K2Node_ComponentBoundEvent_6_OnConsoleCommandCommited__DelegateSignature();
	void BP_OnActivated();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Pause(int32 EntryPoint);
	void OnInputChanged(ECommonInputType bNewInputType);
	void SetControlsImage(ECommonInputType InputType);
	void ShowControls(bool Condition);
	void ShowMenu(TSoftClassPtr<class UClass> Menu);
	void ShowPopup(TSoftClassPtr<class UClass> PopUp);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Menu_Pause_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Menu_Pause_C")
	}
	static class UUI_Menu_Pause_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Pause_C>();
	}
};
DUMPER7_ASSERTS_UUI_Menu_Pause_C;

}

