#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Menu_Sound

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UI_SettingMenu_Base_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Menu_Sound.UI_Menu_Sound_C
// 0x0078 (0x04B8 - 0x0440)
class UUI_Menu_Sound_C final : public UUI_SettingMenu_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0440(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                           DescriptionVerticalBox;                            // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_207;                                         // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Description;                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           SliderBox;                                         // 0x0460(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_OptionName;                              // 0x0468(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SoundSlider_AnalogSliderTest_C*     WBP_FXButton;                                      // 0x0470(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SoundSlider_AnalogSliderTest_C*     WBP_MasterButton;                                  // 0x0478(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SoundSlider_AnalogSliderTest_C*     WBP_MusicButton;                                   // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SoundSlider_AnalogSliderTest_C*     WBP_VoiceButton;                                   // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SelectedIndex;                                     // 0x0490(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_494[0x4];                                      // 0x0494(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UUI_SoundSlider_AnalogSliderTest_C*> Sliders;                                       // 0x0498(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          Debug;                                             // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A9[0x7];                                      // 0x04A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDefaultSettings_C*                     DefaultSettings;                                   // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Sound_WBP_FXButton_K2Node_ComponentBoundEvent_2_OnSliderValueChanged__DelegateSignature(double Value);
	void BndEvt__UI_Menu_Sound_WBP_MasterButton_K2Node_ComponentBoundEvent_0_OnSliderValueChanged__DelegateSignature(double Value);
	void BndEvt__UI_Menu_Sound_WBP_MusicButton_K2Node_ComponentBoundEvent_3_OnSliderValueChanged__DelegateSignature(double Value);
	void BndEvt__UI_Menu_Sound_WBP_VoiceButton_K2Node_ComponentBoundEvent_4_OnSliderValueChanged__DelegateSignature(double Value);
	void BP_OnActivated();
	void CancelOptions();
	void Construct();
	void ExecuteUbergraph_UI_Menu_Sound(int32 EntryPoint);
	void HasUnsavedOption(bool* Result);
	void OnSelectedChangedBase_Event(class UCommonButtonBase* Button, bool Selected);
	void RestoreDefaults();
	void SaveOptions();
	void SetDescription(const class FText& ParameterName, const class FText& Descriprion);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Menu_Sound_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Menu_Sound_C")
	}
	static class UUI_Menu_Sound_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Menu_Sound_C>();
	}
};
DUMPER7_ASSERTS_UUI_Menu_Sound_C;

}

