#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainQuestCardNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WB_QuestCardBaseNew_classes.hpp"
#include "UMG_structs.hpp"
#include "FlexibleQuestsRuntime_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MainQuestCardNew.UI_MainQuestCardNew_C
// 0x0040 (0x1600 - 0x15C0)
class UUI_MainQuestCardNew_C final : public UWB_QuestCardBaseNew_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_UI_MainQuestCardNew_C;              // 0x15C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ActiveFlag;                                        // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QuestIcon;                                         // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             QuestName;                                         // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 StepIcon;                                          // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnMainQuestClicked;                                // 0x15E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_UI_MainQuestCardNew(int32 EntryPoint);
	void SetSelectorVisible(bool Visible);
	void TrackQuest();
	void InitQuestCard(class UGenericQuest* QuestObject_0);
	void SetActiveStatus(bool Active);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_MainQuestCardNew_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_MainQuestCardNew_C")
	}
	static class UUI_MainQuestCardNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MainQuestCardNew_C>();
	}
};
DUMPER7_ASSERTS_UUI_MainQuestCardNew_C;

}

