#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Minimap

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"
#include "FlexibleQuestsRuntime_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Minimap.UI_Minimap_C
// 0x00D8 (0x0398 - 0x02C0)
class UUI_Minimap_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Minimap;                                           // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               MinimapOverlay;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        Dimensions;                                        // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                        Zoom;                                              // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MinimapInstance;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUI_Minimap_Player_C*                   UI_PlayerIcon;                                     // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class FString, class UDA_Minimap_C*>     MapTextures;                                       // 0x02F8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UQuestMarker*, class UWidget*>     MarkersWidgetsMap;                                 // 0x0348(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddPlayerIcon();
	void AddQuestMarker(class AActor* OwnerActor, class UUI_Minimap_QuestMarker_C** marker);
	void Construct();
	void ExecuteUbergraph_UI_Minimap(int32 EntryPoint);
	class UDA_Minimap_C* GetMinimapData();
	void InitMinimap();
	void OnInitialized();
	void OnMarkerUpdated(class UQuestMarker* UpdatedMarker, EQuestMarkerState NewState);
	void RemoveQuestMarker(class UUI_Minimap_QuestMarker_C* marker);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Minimap_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Minimap_C")
	}
	static class UUI_Minimap_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Minimap_C>();
	}
};
DUMPER7_ASSERTS_UUI_Minimap_C;

}

