#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_NotifyCodex

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UI_NotifyBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_NotifyCodex.UI_NotifyCodex_C
// 0x0030 (0x02F0 - 0x02C0)
class UUI_NotifyCodex_C final : public UUI_NotifyBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Hide;                                              // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Show;                                              // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UTextBlock*                             ArticleName;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   ArticleId;                                         // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UDA_CodexArticle_C*                     CodexData;                                         // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void CustomEvent_0();
	void ExecuteUbergraph_UI_NotifyCodex(int32 EntryPoint);
	void FindNameByID(class FText* Name_0);
	void InitCodexData();
	void OnInitialized();
	void PlayNotifySound();
	void RemoveNotify();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_NotifyCodex_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_NotifyCodex_C")
	}
	static class UUI_NotifyCodex_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_NotifyCodex_C>();
	}
};
DUMPER7_ASSERTS_UUI_NotifyCodex_C;

}

