#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_NoHUDForGameplay

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_NoHUDForGameplay.UI_NoHUDForGameplay_C.ExecuteUbergraph_UI_NoHUDForGameplay
// 0x000C (0x000C - 0x0000)
struct UI_NoHUDForGameplay_C_ExecuteUbergraph_UI_NoHUDForGameplay final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_HealthCurrent;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_MaxHealth;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_NoHUDForGameplay_C_ExecuteUbergraph_UI_NoHUDForGameplay;

// Function UI_NoHUDForGameplay.UI_NoHUDForGameplay_C.SetMaxHealth
// 0x0004 (0x0004 - 0x0000)
struct UI_NoHUDForGameplay_C_SetMaxHealth final
{
public:
	int32                                         MaxHealth;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_NoHUDForGameplay_C_SetMaxHealth;

// Function UI_NoHUDForGameplay.UI_NoHUDForGameplay_C.UpdateHealth
// 0x0004 (0x0004 - 0x0000)
struct UI_NoHUDForGameplay_C_UpdateHealth final
{
public:
	int32                                         HealthCurrent;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_NoHUDForGameplay_C_UpdateHealth;

}

