#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PauseMenu_ButtonPanel

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_MainMenu_ContinueButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_ContinueButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_ContinueButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_MainMenu_LoadGameButton_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_LoadGameButton_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_LoadGameButton_K2Node_ComponentBoundEvent_10_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_MainMenu_OptionsButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_OptionsButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_OptionsButton_K2Node_ComponentBoundEvent_11_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_MainMenu_QuitGameButton_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_QuitGameButton_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_QuitGameButton_K2Node_ComponentBoundEvent_17_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_MainMenu_StartButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_StartButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_MainMenu_StartButton_K2Node_ComponentBoundEvent_6_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_PauseMenu_ButtonPanel_BTN_Back_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_PauseMenu_ButtonPanel_BTN_Back_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_PauseMenu_ButtonPanel_BTN_Back_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_PauseMenu_ButtonPanel_BTN_Select_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_PauseMenu_ButtonPanel_BTN_Select_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_PauseMenu_ButtonPanel_BTN_Select_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BndEvt__UI_PauseMenu_ButtonPanel_UI_InvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BndEvt__UI_PauseMenu_ButtonPanel_UI_InvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BndEvt__UI_PauseMenu_ButtonPanel_UI_InvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.ExecuteUbergraph_UI_PauseMenu_ButtonPanel
// 0x0078 (0x0078 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_ExecuteUbergraph_UI_PauseMenu_ButtonPanel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_4;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_5;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bInIsInteractionEnabled;        // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USmutaCommonButtonBase*                 CallFunc_GetFocusedButton_Button;                  // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveLoadSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CanSaveGame_ReturnValue;                  // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSaveLoadInProgress_ReturnValue;         // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_6;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_7;               // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USaveLoadSubsystem*                     CallFunc_GetGameInstanceSubsystem_ReturnValue_1;   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSaveLoadInProgress_ReturnValue_1;       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_ExecuteUbergraph_UI_PauseMenu_ButtonPanel;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.GetFocusedButton
// 0x0050 (0x0050 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_GetFocusedButton final
{
public:
	class USmutaCommonButtonBase*                 Button;                                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWidget*>                        CallFunc_GetAllChildren_ReturnValue;               // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USmutaCommonButtonBase*                 K2Node_DynamicCast_AsSmuta_Common_Button_Base;     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_GetFocusedButton;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.SetLoadAvailable
// 0x0001 (0x0001 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_SetLoadAvailable final
{
public:
	bool                                          bInIsInteractionEnabled;                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_SetLoadAvailable;

// Function UI_PauseMenu_ButtonPanel.UI_PauseMenu_ButtonPanel_C.BP_GetDesiredFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct UI_PauseMenu_ButtonPanel_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_PauseMenu_ButtonPanel_C_BP_GetDesiredFocusTarget;

}

