#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PlayerBloodTC

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PlayerBloodTC.UI_PlayerBloodTC_C
// 0x0038 (0x02F8 - 0x02C0)
class UUI_PlayerBloodTC_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 blood;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        AnimationLength;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHorizontalAlignment                          HorAlogment;                                       // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EVerticalAlignment                            VerAligment;                                       // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E2[0x6];                                      // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UTexture2D*>                     ImagesTopCenter;                                   // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_UI_PlayerBloodTC(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void Play(double Power);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_PlayerBloodTC_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_PlayerBloodTC_C")
	}
	static class UUI_PlayerBloodTC_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PlayerBloodTC_C>();
	}
};
DUMPER7_ASSERTS_UUI_PlayerBloodTC_C;

}

