#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PlayerHealthBlood

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PlayerHealthBlood.UI_PlayerHealthBlood_C
// 0x0030 (0x02F0 - 0x02C0)
class UUI_PlayerHealthBlood_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       FadeOut;                                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 blood;                                             // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        AnimationLength;                                   // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UTexture2D*>                     Images;                                            // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void Construct();
	void ExecuteUbergraph_UI_PlayerHealthBlood(int32 EntryPoint);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void Play(double Power);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_PlayerHealthBlood_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_PlayerHealthBlood_C")
	}
	static class UUI_PlayerHealthBlood_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PlayerHealthBlood_C>();
	}
};
DUMPER7_ASSERTS_UUI_PlayerHealthBlood_C;

}

