#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PopUp_KeyAlreadyBound

#include "Basic.hpp"

#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UI_PopUp_KeyAlreadyBound.UI_PopUp_KeyAlreadyBound_C.InitMessage
// 0x0178 (0x0178 - 0x0000)
struct UI_PopUp_KeyAlreadyBound_C_InitMessage final
{
public:
	class FText                                   NewAction;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class FText                                   OldAction;                                         // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FKey                                   NewKey;                                            // 0x0030(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   CallFunc_Key_GetDisplayName_ReturnValue;           // 0x0048(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0060(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00B0(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0100(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0150(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0018)()
};
DUMPER7_ASSERTS_UI_PopUp_KeyAlreadyBound_C_InitMessage;

}

