#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PlayerProgressInfo

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_PlayerProgressInfo.UI_PlayerProgressInfo_C
// 0x0050 (0x0310 - 0x02C0)
class UUI_PlayerProgressInfo_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_75;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Star;                                        // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AngerAndMercy_C*                   WBP_AngerAndMercy;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             XPInfo;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             XpPoint;                                           // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         CurrentXP_dep;                                     // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxXP;                                             // 0x02F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_SkillTree_C*                        AC_Skill_Tree;                                     // 0x02F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBaseAbilitiesComponent*                AbilityComponent;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowAngerAndMercy;                                 // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeColor();
	void Construct();
	void CREATEDELEGATE_PROXYFUNCTION_0(float BarPercent, float ActualXP, float RequirementXP);
	void ExecuteUbergraph_UI_PlayerProgressInfo(int32 EntryPoint);
	void NewText(double Percent, double CurentXP, double MaxXP_0);
	void PostLoadDelegate_Event(const bool SaveLoadResult);
	void PreConstruct(bool IsDesignTime);
	void SetStarColor(const struct FLinearColor& Tint_Specified_Color_Image, const struct FLinearColor& Tint_Specified_Color_Text);
	void ShowWidget(ESlateVisibility Visibility_0);
	void Update_XP_Point();
	void UpdateXPText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_PlayerProgressInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_PlayerProgressInfo_C")
	}
	static class UUI_PlayerProgressInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_PlayerProgressInfo_C>();
	}
};
DUMPER7_ASSERTS_UUI_PlayerProgressInfo_C;

}

