#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_QTEGamesMinihelp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UI_Menu_Base_classes.hpp"
#include "Smuta_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C
// 0x0040 (0x0460 - 0x0420)
class UUI_QTEGamesMinihelp_C final : public UUI_Menu_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_MenuActionButton_C*                 BTN_GiveUp;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 BTN_Hit;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 BTN_Select;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 BTN_Take;                                          // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 BTN_Tap;                                           // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Header;                                            // 0x0450(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AQTE_Station_C*                         QTE_Station;                                       // 0x0458(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void BndEvt__UI_Menu_Abilities_BTN_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UI_Menu_Map_BTN_FocusPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UI_Menu_Map_BTN_ShowHideLegend_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__UI_Menu_Map_BTN_ZoomOut_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void Construct();
	void ExecuteUbergraph_UI_QTEGamesMinihelp(int32 EntryPoint);
	void HandleInputMethodChanged(ECommonInputType bNewInputType);
	void PreConstruct(bool IsDesignTime);
	void SetInputType(EQTE_Type Type);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_QTEGamesMinihelp_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_QTEGamesMinihelp_C")
	}
	static class UUI_QTEGamesMinihelp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_QTEGamesMinihelp_C>();
	}
};
DUMPER7_ASSERTS_UUI_QTEGamesMinihelp_C;

}

