#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_QuestTrackerTask

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_QuestTrackerTask.UI_QuestTrackerTask_C
// 0x0048 (0x0308 - 0x02C0)
class UUI_QuestTrackerTask_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       A_Appear;                                          // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       A_Complete;                                        // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_Completed;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TaskText;                                          // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   Task;                                              // 0x02E8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                          IsCompleted;                                       // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_QuestTrackerTask(int32 EntryPoint);
	void Finished_CCC6B1384689DCCF6983EA970C966154();
	void InitTask();
	void MarkComplete();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_QuestTrackerTask_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_QuestTrackerTask_C")
	}
	static class UUI_QuestTrackerTask_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_QuestTrackerTask_C>();
	}
};
DUMPER7_ASSERTS_UUI_QuestTrackerTask_C;

}

