#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_QTEGamesMinihelp

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "Smuta_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "EnhancedInput_structs.hpp"


namespace SDK::Params
{

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.BndEvt__UI_Menu_Abilities_BTN_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Abilities_BTN_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Abilities_BTN_Back_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.BndEvt__UI_Menu_Map_BTN_FocusPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Map_BTN_FocusPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Map_BTN_FocusPlayer_K2Node_ComponentBoundEvent_5_CommonButtonBaseClicked__DelegateSignature;

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.BndEvt__UI_Menu_Map_BTN_ShowHideLegend_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Map_BTN_ShowHideLegend_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Map_BTN_ShowHideLegend_K2Node_ComponentBoundEvent_4_CommonButtonBaseClicked__DelegateSignature;

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.BndEvt__UI_Menu_Map_BTN_ZoomOut_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Map_BTN_ZoomOut_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_BndEvt__UI_Menu_Map_BTN_ZoomOut_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature;

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.ExecuteUbergraph_UI_QTEGamesMinihelp
// 0x01C0 (0x01C0 - 0x0000)
struct UI_QTEGamesMinihelp_C_ExecuteUbergraph_UI_QTEGamesMinihelp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UInputTrigger*>                  Temp_object_Variable;                              // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<class UInputModifier*>                 Temp_object_Variable_1;                            // 0x0018(0x0010)(ConstParm, ReferenceParm)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UInputPresetSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue;            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  Temp_struct_Variable;                              // 0x0038(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputPresetSubsystem*                  CallFunc_GetWorldSubsystem_ReturnValue_1;          // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FModifyContextOptions                  Temp_struct_Variable_1;                            // 0x0048(0x0001)(ConstParm, NoDestructor)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_3;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputModifier*>                 Temp_object_Variable_2;                            // 0x0058(0x0010)(ConstParm, ReferenceParm)
	EQTE_Type                                     K2Node_CustomEvent_Type;                           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputTrigger*>                  Temp_object_Variable_3;                            // 0x0080(0x0010)(ConstParm, ReferenceParm)
	struct FInputActionValue                      CallFunc_MakeInputActionValueOfType_ReturnValue;   // 0x0090(0x0020)(NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      CallFunc_MakeInputActionValueOfType_ReturnValue_1; // 0x00B8(0x0020)(NoDestructor)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_1; // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_InjectInputForAction_self_CastInput; // 0x00E8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_2;   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputModifier*>                 Temp_object_Variable_4;                            // 0x0100(0x0010)(ConstParm, ReferenceParm)
	class UEnhancedInputLocalPlayerSubsystem*     CallFunc_GetLocalPlayerSubSystemFromPlayerController_ReturnValue_2; // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FInputActionValue                      CallFunc_MakeInputActionValueOfType_ReturnValue_2; // 0x0118(0x0020)(NoDestructor)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;            // 0x0138(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_InjectInputForAction_self_CastInput_1; // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0158(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UInputTrigger*>                  Temp_object_Variable_5;                            // 0x0160(0x0010)(ConstParm, ReferenceParm)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TScriptInterface<class IEnhancedInputSubsystemInterface> CallFunc_InjectInputForAction_self_CastInput_2; // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_189[0x7];                                      // 0x0189(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0190(0x0020)()
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue_1;    // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x01B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_ExecuteUbergraph_UI_QTEGamesMinihelp;

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.HandleInputMethodChanged
// 0x0002 (0x0002 - 0x0000)
struct UI_QTEGamesMinihelp_C_HandleInputMethodChanged final
{
public:
	ECommonInputType                              bNewInputType;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_HandleInputMethodChanged;

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_QTEGamesMinihelp_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_PreConstruct;

// Function UI_QTEGamesMinihelp.UI_QTEGamesMinihelp_C.SetInputType
// 0x0001 (0x0001 - 0x0000)
struct UI_QTEGamesMinihelp_C_SetInputType final
{
public:
	EQTE_Type                                     Type;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_QTEGamesMinihelp_C_SetInputType;

}

