#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_RadialProgress_QTE

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_RadialProgress_QTE.UI_RadialProgress_QTE_C
// 0x0038 (0x02F8 - 0x02C0)
class UUI_RadialProgress_QTE_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 RadialBar;                                         // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Roller;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               RadialProgressBar;                                 // 0x02D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             FailRadialBar;                                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SuccessRadialBar;                                  // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_RadialProgress_QTE(int32 EntryPoint);
	void InvertScale();
	void PreConstruct(bool IsDesignTime);
	void SetDefaultColor();
	void SetFailColor();
	void SetPercent(double InPercent, double OutPercent, float AngleRoller);
	void SetSuccessColor();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_RadialProgress_QTE_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_RadialProgress_QTE_C")
	}
	static class UUI_RadialProgress_QTE_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_RadialProgress_QTE_C>();
	}
};
DUMPER7_ASSERTS_UUI_RadialProgress_QTE_C;

}

