#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SettingChangeControlButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "Smuta_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SettingChangeControlButton.UI_SettingChangeControlButton_C
// 0x0150 (0x16F0 - 0x15A0)
class UUI_SettingChangeControlButton_C final : public USmutaCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_MenuButton_C*                       ChangeButton;                                      // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                ChangeButtonBorder;                                // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InputIcon;                                         // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 InputIconBG;                                       // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OptionNameText;                                    // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OptionName;                                        // 0x15D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMulticastInlineDelegate<void(double Value)>  OnSliderValueChanged;                              // 0x15E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSliderCaptureBegin;                              // 0x15F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(double SliderValue)> OnSliderCaptureEnd;                           // 0x1608(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                   InputTableName;                                    // 0x1618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CurrentKey;                                        // 0x1620(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UGameSettingPressAnyKey*                PressAnyKeyModal;                                  // 0x1638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FInputChangeData                       SettingData;                                       // 0x1640(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUI_PopUp_KeyAlreadyBound_C*            AlreadyBoundModal;                                 // 0x16C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   SavedKey;                                          // 0x16D0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_SettingChangeControlButton_ChangeButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ChangeKey(const struct FKey& NewKey);
	void Construct();
	void ExecuteUbergraph_UI_SettingChangeControlButton(int32 EntryPoint);
	void FindInputDataByInputName(class FName InputName, struct FInputChangeData* Out_Row, bool* Result);
	void Get_Bound_Keyboard_Key_for_Input(bool* Result, struct FKey* Key);
	void GetDescription(class FText* Description);
	void HandleAlreadyBoundKeyOption(bool IsPlayerAgree, const struct FKey& Key);
	void IsDirty(bool* Result);
	void IsKeyAlreadyBound(const struct FKey& Key, bool* Result, class FName* AlreadyBoundName);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnChangeButtonPressed();
	void OnChangeButtonReleased();
	void OnCurrentTextStyleChanged();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInputChangeEnded();
	void OnKeySelectionCanceled();
	void OnKeyUpdated();
	void OnNewKeySelected(const struct FKey& Key);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnSettingsChanged(class UEnhancedInputUserSettings* Settings);
	void RevertSetting();
	void SaveSetting();
	void UnbindAllFromKey(const struct FKey& Key);
	void UpdateKeyIcon();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SettingChangeControlButton_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SettingChangeControlButton_C")
	}
	static class UUI_SettingChangeControlButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SettingChangeControlButton_C>();
	}
};
DUMPER7_ASSERTS_UUI_SettingChangeControlButton_C;

}

