#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SelectorTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SelectorTest.UI_SelectorTest_C
// 0x00E0 (0x16C0 - 0x15E0)
class UUI_SelectorTest_C final : public USmutaCommonRotator
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Corner;                                 // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonLeft;                                        // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonRight;                                       // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OptionNameText;                                    // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_0;                                         // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class FText>                           OptionsList;                                       // 0x1618(0x0010)(Edit, BlueprintVisible)
	int32                                         SelectedIndex;                                     // 0x1628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162C[0x4];                                     // 0x162C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   OptionName;                                        // 0x1630(0x0018)(Edit, BlueprintVisible)
	double                                        XSpace;                                            // 0x1648(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   Description;                                       // 0x1650(0x0018)(Edit, BlueprintVisible)
	TSoftObjectPtr<class USoundBase>              OptionSelectedSound;                               // 0x1668(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FLinearColor                           HoverSelectorBGColor;                              // 0x1690(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultSelectorBGColor;                            // 0x16A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveSelectorBGColor;                             // 0x16B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__WBP_Selector_ButtonLeft_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WBP_Selector_ButtonRight_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BP_OnHovered();
	void BP_OnOptionSelected(int32 Index_0);
	void BP_OnUnhovered();
	void ExecuteUbergraph_UI_SelectorTest(int32 EntryPoint);
	void GetDescription(class FText* Name_0, class FText* Desc);
	void InitSelector(int32 SelectedIndex_0);
	void IsDirty(bool* Result);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnCurrentTextStyleChanged();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void PressLeft();
	void PressRight();
	void RevertOption();
	void SaveOption();
	void SetButtonsEnabled();
	void SetCurrentSelect(int32 SelectedIndex_0);
	void UpdateOptions(TArray<class FText>& Options);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SelectorTest_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SelectorTest_C")
	}
	static class UUI_SelectorTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SelectorTest_C>();
	}
};
DUMPER7_ASSERTS_UUI_SelectorTest_C;

}

