#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SoundSlider_AnalogSliderTest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C
// 0x00F0 (0x1690 - 0x15A0)
class UUI_SoundSlider_AnalogSliderTest_C final : public USmutaCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Background;                                        // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background_Corner;                                 // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonLeft;                                        // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                ButtonRight;                                       // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       OptionNameText;                                    // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             PercentText;                                       // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SliderValueText;                                   // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAnalogSlider*                          VolumeSlider;                                      // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   OptionName;                                        // 0x15E8(0x0018)(Edit, BlueprintVisible)
	TMulticastInlineDelegate<void(double Value)>  OnSliderValueChanged;                              // 0x1600(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void()>              OnSliderCaptureBegin;                              // 0x1610(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(double SliderValue)> OnSliderCaptureEnd;                           // 0x1620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UAudioSetting*                          AudioSetting;                                      // 0x1630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         SavedVolume;                                       // 0x1638(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_163C[0x4];                                     // 0x163C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Description;                                       // 0x1640(0x0018)(Edit, BlueprintVisible)
	struct FLinearColor                           DefaultSelectorBGColor;                            // 0x1658(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           HoverSelectorBGColor;                              // 0x1668(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ActiveSelectorBGColor;                             // 0x1678(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BndEvt__UI_SettingsSlider_ButtonLeft_K2Node_ComponentBoundEvent_6_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_SettingsSlider_ButtonRight_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__UI_SoundSlider_AnalogSlider_AnalogSlider_1_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__UI_SoundSlider_AnalogSlider_VolumeSlider_K2Node_ComponentBoundEvent_2_OnMouseCaptureBeginEvent__DelegateSignature();
	void BndEvt__UI_SoundSlider_AnalogSlider_VolumeSlider_K2Node_ComponentBoundEvent_3_OnControllerCaptureBeginEvent__DelegateSignature();
	void BndEvt__UI_SoundSlider_AnalogSlider_VolumeSlider_K2Node_ComponentBoundEvent_4_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__UI_SoundSlider_AnalogSlider_VolumeSlider_K2Node_ComponentBoundEvent_5_OnControllerCaptureEndEvent__DelegateSignature();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void ChangeSetting(double Setting);
	void ExecuteUbergraph_UI_SoundSlider_AnalogSliderTest(int32 EntryPoint);
	void GetDescription(class FText* Name_0, class FText* Desc);
	void InitSetting(class UAudioSetting* Setting);
	void IsDirty(bool* Result);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnCurrentTextStyleChanged();
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void RevertSetting();
	void SaveSetting();
	void SetSliderValue(double NewValue);
	void UpdateVolumeSliderText();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SoundSlider_AnalogSliderTest_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SoundSlider_AnalogSliderTest_C")
	}
	static class UUI_SoundSlider_AnalogSliderTest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SoundSlider_AnalogSliderTest_C>();
	}
};
DUMPER7_ASSERTS_UUI_SoundSlider_AnalogSliderTest_C;

}

