#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Subtitle

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Subtitle.UI_Subtitle_C
// 0x0058 (0x0318 - 0x02C0)
class UUI_Subtitle_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             TextBlock_Name;                                    // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Text;                                    // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         Amount_of_chars_in_line;                           // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   SubtitleText;                                      // 0x02E0(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   SubtitleSpeaker;                                   // 0x02F8(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	int32                                         Lines_amount;                                      // 0x0310(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Convert_text_to_multiline(const class FText& SubtitleText_0, class FText* Multiline_text, int32* Amount_of_lines);
	void ExecuteUbergraph_UI_Subtitle(int32 EntryPoint);
	void Get_Lines_Amount(int32* Lines);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_Subtitle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_Subtitle_C")
	}
	static class UUI_Subtitle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Subtitle_C>();
	}
};
DUMPER7_ASSERTS_UUI_Subtitle_C;

}

