#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SkillTree_InventoryRockOrArctifact

#include "Basic.hpp"

#include "E_SkillTree_Category_structs.hpp"
#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"
#include "E_SkillTree_UnitFilter_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SkillTree_InventoryRockOrArctifact.UI_SkillTree_InventoryRockOrArctifact_C
// 0x0030 (0x02F0 - 0x02C0)
class UUI_SkillTree_InventoryRockOrArctifact_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_66;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Inventory_HB;                                      // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NoRock_Text;                                       // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Items;                                        // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SkillTree_ArtifactItemsCounter_C*   ArtifactCounter;                                   // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)

public:
	void AddArtifact(class UDA_SkillTree_Unit_Base_C* L_Item);
	void addStone(class UDA_SkillTree_Unit_Base_C* l_item);
	void Construct();
	void ExecuteUbergraph_UI_SkillTree_InventoryRockOrArctifact(int32 EntryPoint);
	void UpdateArtifacts(E_SkillTree_Category CategoryFiltetType);
	void UpdateStoneArrows(const TArray<E_SkillTree_UnitFilter>& StoneFilter);
	void UpdateStones();
	void UpdateText(const class FText& InText);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SkillTree_InventoryRockOrArctifact_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SkillTree_InventoryRockOrArctifact_C")
	}
	static class UUI_SkillTree_InventoryRockOrArctifact_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SkillTree_InventoryRockOrArctifact_C>();
	}
};
DUMPER7_ASSERTS_UUI_SkillTree_InventoryRockOrArctifact_C;

}

