#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SelectorTest

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_SelectorTest.UI_SelectorTest_C.BP_OnOptionSelected
// 0x0004 (0x0004 - 0x0000)
struct UI_SelectorTest_C_BP_OnOptionSelected final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_BP_OnOptionSelected;

// Function UI_SelectorTest.UI_SelectorTest_C.ExecuteUbergraph_UI_SelectorTest
// 0x0060 (0x0060 - 0x0000)
struct UI_SelectorTest_C_ExecuteUbergraph_UI_SelectorTest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_SelectedIndex;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x000C(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0014(0x0008)(NoDestructor)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UCommonTextStyle>           CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	int32                                         K2Node_Event_Index;                                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D[0x3];                                       // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonStyle*                     CallFunc_GetStyle_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base;                   // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             K2Node_DynamicCast_AsSound_Base_1;                 // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_ExecuteUbergraph_UI_SelectorTest;

// Function UI_SelectorTest.UI_SelectorTest_C.GetDescription
// 0x0030 (0x0030 - 0x0000)
struct UI_SelectorTest_C_GetDescription final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   Desc;                                              // 0x0018(0x0018)(Parm, OutParm)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_GetDescription;

// Function UI_SelectorTest.UI_SelectorTest_C.InitSelector
// 0x0004 (0x0004 - 0x0000)
struct UI_SelectorTest_C_InitSelector final
{
public:
	int32                                         SelectedIndex_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_InitSelector;

// Function UI_SelectorTest.UI_SelectorTest_C.IsDirty
// 0x000C (0x000C - 0x0000)
struct UI_SelectorTest_C_IsDirty final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_IsDirty;

// Function UI_SelectorTest.UI_SelectorTest_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UI_SelectorTest_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_OnAddedToFocusPath;

// Function UI_SelectorTest.UI_SelectorTest_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UI_SelectorTest_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_OnRemovedFromFocusPath;

// Function UI_SelectorTest.UI_SelectorTest_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_SelectorTest_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_PreConstruct;

// Function UI_SelectorTest.UI_SelectorTest_C.RevertOption
// 0x0001 (0x0001 - 0x0000)
struct UI_SelectorTest_C_RevertOption final
{
public:
	bool                                          CallFunc_IsDirty_Result;                           // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_RevertOption;

// Function UI_SelectorTest.UI_SelectorTest_C.SaveOption
// 0x0004 (0x0004 - 0x0000)
struct UI_SelectorTest_C_SaveOption final
{
public:
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_SaveOption;

// Function UI_SelectorTest.UI_SelectorTest_C.SetButtonsEnabled
// 0x0014 (0x0014 - 0x0000)
struct UI_SelectorTest_C_SetButtonsEnabled final
{
public:
	int32                                         CallFunc_GetSelectedIndex_ReturnValue;             // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetSelectedIndex_ReturnValue_1;           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_LastIndex_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_SetButtonsEnabled;

// Function UI_SelectorTest.UI_SelectorTest_C.SetCurrentSelect
// 0x0004 (0x0004 - 0x0000)
struct UI_SelectorTest_C_SetCurrentSelect final
{
public:
	int32                                         SelectedIndex_0;                                   // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_SetCurrentSelect;

// Function UI_SelectorTest.UI_SelectorTest_C.UpdateOptions
// 0x0010 (0x0010 - 0x0000)
struct UI_SelectorTest_C_UpdateOptions final
{
public:
	TArray<class FText>                           Options;                                           // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_UI_SelectorTest_C_UpdateOptions;

}

