#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SkillTree_RockItemWishAmount

#include "Basic.hpp"

#include "E_SkillTree_UnitFilter_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SkillTree_RockItemWishAmount.UI_SkillTree_RockItemWishAmount_C
// 0x0020 (0x02E0 - 0x02C0)
class UUI_SkillTree_RockItemWishAmount_C final : public UUserWidget
{
public:
	class UTextBlock*                             amount_text;                                       // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Arrow;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_SkillTree_UnitFilter_C*             UI_SkillTree_UnitFilter;                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_SkillTree_UnitFilter                        Unit_Filtet_Type;                                  // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x3];                                      // 0x02D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Amount;                                            // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void add_Amount(int32 l_Amount);
	void Init(E_SkillTree_UnitFilter l_UnitFiltetType);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SkillTree_RockItemWishAmount_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SkillTree_RockItemWishAmount_C")
	}
	static class UUI_SkillTree_RockItemWishAmount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SkillTree_RockItemWishAmount_C>();
	}
};
DUMPER7_ASSERTS_UUI_SkillTree_RockItemWishAmount_C;

}

