#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SoundSlider_AnalogSliderTest

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.BndEvt__UI_SoundSlider_AnalogSlider_AnalogSlider_1_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_BndEvt__UI_SoundSlider_AnalogSlider_AnalogSlider_1_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_BndEvt__UI_SoundSlider_AnalogSlider_AnalogSlider_1_K2Node_ComponentBoundEvent_1_OnFloatValueChangedEvent__DelegateSignature;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.ChangeSetting
// 0x0010 (0x0010 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_ChangeSetting final
{
public:
	double                                        Setting;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVolume_Value_ImplicitCast;             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_ChangeSetting;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.ExecuteUbergraph_UI_SoundSlider_AnalogSliderTest
// 0x0078 (0x0078 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_ExecuteUbergraph_UI_SoundSlider_AnalogSliderTest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_ComponentBoundEvent_Value;                  // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFocusEvent                            K2Node_Event_InFocusEvent_1;                       // 0x0010(0x0008)(NoDestructor)
	struct FFocusEvent                            K2Node_Event_InFocusEvent;                         // 0x0018(0x0008)(NoDestructor)
	TSubclassOf<class UCommonTextStyle>           CallFunc_GetCurrentTextStyleClass_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetSelected_ReturnValue_1;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_1;                   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetValue_ReturnValue_2;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CallDelegate_Value_ImplicitCast;            // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_CallDelegate_SliderValue_ImplicitCast;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_A_ImplicitCast;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast_1;          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_ExecuteUbergraph_UI_SoundSlider_AnalogSliderTest;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.GetDescription
// 0x0030 (0x0030 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_GetDescription final
{
public:
	class FText                                   Name_0;                                            // 0x0000(0x0018)(Parm, OutParm)
	class FText                                   Desc;                                              // 0x0018(0x0018)(Parm, OutParm)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_GetDescription;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.InitSetting
// 0x0010 (0x0010 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_InitSetting final
{
public:
	class UAudioSetting*                          Setting;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SetSliderValue_NewValue_ImplicitCast;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_InitSetting;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.IsDirty
// 0x0018 (0x0018 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_IsDirty final
{
public:
	bool                                          Result;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NearlyEqual_FloatFloat_A_ImplicitCast;    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_NearlyEqual_FloatFloat_B_ImplicitCast;    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_IsDirty;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.OnAddedToFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_OnAddedToFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_OnAddedToFocusPath;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.OnFocusReceived
// 0x01B0 (0x01B0 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_OnFocusReceived final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FFocusEvent                            InFocusEvent;                                      // 0x0038(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FEventReply                            ReturnValue;                                       // 0x0040(0x00B8)(Parm, OutParm, ReturnParm)
	struct FEventReply                            K2Node_MakeStruct_EventReply;                      // 0x00F8(0x00B8)()
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_OnFocusReceived;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_OnRemovedFromFocusPath;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_PreConstruct;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.RevertSetting
// 0x0008 (0x0008 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_RevertSetting final
{
public:
	double                                        CallFunc_SetSliderValue_NewValue_ImplicitCast;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_RevertSetting;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.SetSliderValue
// 0x0010 (0x0010 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_SetSliderValue final
{
public:
	double                                        NewValue;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetValue_InValue_ImplicitCast;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_SetSliderValue;

// Function UI_SoundSlider_AnalogSliderTest.UI_SoundSlider_AnalogSliderTest_C.UpdateVolumeSliderText
// 0x0040 (0x0040 - 0x0000)
struct UI_SoundSlider_AnalogSliderTest_C_UpdateVolumeSliderText final
{
public:
	float                                         CallFunc_GetValue_ReturnValue;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Round_ReturnValue;                        // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0020(0x0018)()
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UI_SoundSlider_AnalogSliderTest_C_UpdateVolumeSliderText;

}

