#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SkillTreeSlot

#include "Basic.hpp"

#include "Smuta_classes.hpp"
#include "E_SkillTree_UnitFilter_structs.hpp"
#include "E_SkillTree_Category_structs.hpp"
#include "Engine_structs.hpp"
#include "STR_SkillTree_InventoryItem_structs.hpp"
#include "UMG_structs.hpp"
#include "E_SkillTree_UnitType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SkillTreeSlot.UI_SkillTreeSlot_C
// 0x0170 (0x1710 - 0x15A0)
class UUI_SkillTreeSlot_C final : public USmutaCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x15A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                         filter_HB;                                         // 0x15A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon_BG;                                           // 0x15B0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon_selection;                                    // 0x15B8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 icon_Slash;                                        // 0x15C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 iconItem;                                          // 0x15C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_178;                                       // 0x15D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               SizeBox_Slot;                                      // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void(class UUI_SkillTreeSlot_C* Slot)> D_OnFocused;                     // 0x15E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UUI_SkillTreeSlot_C* Slot)> D_OnClicked;                     // 0x15F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	E_SkillTree_UnitType                          slotType;                                          // 0x1600(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1601[0x3];                                     // 0x1601(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         price;                                             // 0x1604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          unlocked;                                          // 0x1608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1609[0x7];                                     // 0x1609(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         Child_Slot_ID;                                     // 0x1610(0x0010)(Edit, BlueprintVisible)
	class FString                                 Slot_ID;                                           // 0x1620(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class UUI_Menu_SkillTree_C*                   Parent;                                            // 0x1630(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class FString>                         Child_Line_ID;                                     // 0x1638(0x0010)(Edit, BlueprintVisible)
	bool                                          startSlot;                                         // 0x1648(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1649[0x7];                                     // 0x1649(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_SkillTree_C*                        AC_Skill_Tree;                                     // 0x1650(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Available;                                         // 0x1658(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1659[0x7];                                     // 0x1659(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_SkillTree_Unit_Base_C*              Item;                                              // 0x1660(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FSTR_SkillTree_InventoryItem           SlotInfo;                                          // 0x1668(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class UUI_SkillTreeSlot_C*>            SlotsChild;                                        // 0x1698(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUI_SkillTreeLine_C*>            LinesChild;                                        // 0x16A8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                         SizeSlot;                                          // 0x16B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16BC[0x4];                                     // 0x16BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDA_SkillTree_Unit_Base_C*              needThisItemForSlot;                               // 0x16C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	E_SkillTree_Category                          Category;                                          // 0x16C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C9[0x7];                                     // 0x16C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<E_SkillTree_UnitFilter>                UnitFilters;                                       // 0x16D0(0x0010)(Edit, BlueprintVisible)
	bool                                          Debug;                                             // 0x16E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E1[0x3];                                     // 0x16E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemId;                                            // 0x16E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsQuestLocked;                                     // 0x16E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16E9[0x7];                                     // 0x16E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAC_SkillTree_C*                        AC_Skill_TreeRef;                                  // 0x16F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClearSlot;                                       // 0x16F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void Available_For_Purchase();
	void BP_OnClicked();
	void BP_OnDoubleClicked();
	void BP_OnSelected();
	void Construct();
	void Destruct();
	void EnabledChildForUnlockedSlot();
	void ExecuteUbergraph_UI_SkillTreeSlot(int32 EntryPoint);
	bool filteringForStone();
	void HideSelection();
	void Init();
	void InitChildArray();
	void InitDefaults();
	void initFilter();
	void initForInventory();
	void Install_Item(class UDA_SkillTree_Unit_Base_C* l_item);
	bool IsAvailableForPurchase();
	bool IsItemInstalled();
	void On_Clicked_Slot();
	void onFocused(bool focused);
	struct FEventReply OnMouseButtonDoubleClick(const struct FGeometry& InMyGeometry, const struct FPointerEvent& InMouseEvent);
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void PreConstruct(bool IsDesignTime);
	void ResetSlot();
	void SaveSlotInfo();
	void Set_Is_Unlocked();
	void SlotDebug(const class FString& InString);
	void UnistallItem();
	void Update();
	void UpdateLines();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_SkillTreeSlot_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_SkillTreeSlot_C")
	}
	static class UUI_SkillTreeSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SkillTreeSlot_C>();
	}
};
DUMPER7_ASSERTS_UUI_SkillTreeSlot_C;

}

