#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_StealthIndicator

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_StealthIndicator.UI_StealthIndicator_C
// 0x0040 (0x0300 - 0x02C0)
class UUI_StealthIndicator_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       A_Alarm;                                           // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Alarm_Shine;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AlarmProgress;                                     // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 EyeIcon;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	double                                        AlarmPercent;                                      // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F1[0x7];                                      // 0x02F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           HideSelfTimerHandle;                               // 0x02F8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void DelayedHide();
	void ExecuteUbergraph_UI_StealthIndicator(int32 EntryPoint);
	void HideSelf();
	void OnStealthWarning_Event(bool IsActive_0);
	void OnTagChangedWithASC_Event(class UAbilitySystemComponent* ASC, const struct FGameplayTag& UpdatedTag, bool Exists);
	void PreConstruct(bool IsDesignTime);
	void ResetAlarmAnimation();
	void ShowProgressBar(bool Show);
	void ShowShine(bool Show);
	void ShowStealthIndicator(bool Show);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void UpdateAlarmStateNew(double AlarmPercent_0);
	void UpdateIcon();
	void UpdateIconNew();
	void UpdateProgressBar();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("UI_StealthIndicator_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UI_StealthIndicator_C")
	}
	static class UUI_StealthIndicator_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_StealthIndicator_C>();
	}
};
DUMPER7_ASSERTS_UUI_StealthIndicator_C;

}

