#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UW_SpectatorUI

#include "Basic.hpp"

#include "InputCore_structs.hpp"


namespace SDK::Params
{

// Function UW_SpectatorUI.UW_SpectatorUI_C.ExecuteUbergraph_UW_SpectatorUI
// 0x0028 (0x0028 - 0x0000)
struct UW_SpectatorUI_C_ExecuteUbergraph_UW_SpectatorUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FKey                                   K2Node_InputKeyEvent_Key;                          // 0x0008(0x0018)(HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UW_SpectatorUI_C_ExecuteUbergraph_UW_SpectatorUI;

// Function UW_SpectatorUI.UW_SpectatorUI_C.InpActEvt_F_K2Node_InputKeyEvent_0
// 0x0018 (0x0018 - 0x0000)
struct UW_SpectatorUI_C_InpActEvt_F_K2Node_InputKeyEvent_0 final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_UW_SpectatorUI_C_InpActEvt_F_K2Node_InputKeyEvent_0;

}

