#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VillageNPCSpeakTable_S

#include "Basic.hpp"

#include "Smuta_structs.hpp"
#include "EPOIType_structs.hpp"


namespace SDK
{

// UserDefinedStruct VillageNPCSpeakTable_S.VillageNPCSpeakTable_S
// 0x0030 (0x0030 - 0x0000)
struct FVillageNPCSpeakTable_S final
{
public:
	class FName                                   LocationTag_20_7DA57F2342A7A44E349C22968C5AE2FC;   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsGreeting_17_8060EBC447BF3C5DE8131F8CCFD19C13;    // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPOIType                                      SelfWork_30_D4748C994E08F624993C0692D871A927;      // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFraction                                     SelfFraction_6_17BAE41848F10C7BE469198886AD599A;   // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelfGender_9_1FA05E044FFB5FCC1C3934839A1F1A5F;     // 0x000B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPOIType                                      TargetWork_32_9B98966B4010964A972485B517D2CED0;    // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFraction                                     TargetFraction_21_31A91B3848071E2AEE0729960CA66272; // 0x000D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          TargetGender_15_3E9E3AE94D2A8D27DD8E9097E59773E3;  // 0x000E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           Phrases_23_A598A38942A074E813DAFA9F47143541;       // 0x0010(0x0010)(Edit, BlueprintVisible)
	TArray<class UDA_NPCsDialogue_C*>             PossibleDialogues_27_899E5E994E706F241C5650AEC3186524; // 0x0020(0x0010)(Edit, BlueprintVisible)
};
DUMPER7_ASSERTS_FVillageNPCSpeakTable_S;

}

