#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_BaseMapMark

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Smuta_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_BaseMapMark.W_BaseMapMark_C
// 0x0030 (0x02F0 - 0x02C0)
class UW_BaseMapMark_C : public UBaseMapMarkWidget
{
public:
	class UObject*                                Related_Object;                                    // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UW_Map_Layer_C*                         OwnerLayer;                                        // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           Map_Tag;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedToBeScaled;                                    // 0x02D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D9[0x7];                                      // 0x02D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UW_BaseMapMark_C*>               Intersected_Markers;                               // 0x02E0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void DisableIntersectedOpacity();
	void EnableIntersectedOpacity(class UW_BaseMapMark_C* IntersectedMarker);
	void Init(class UObject* RelatedObject, class UW_Map_Layer_C* Layer, const struct FGameplayTag& MapTag);
	void IsIntersectedOpacityEnabled(bool* Result);
	void Update();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_BaseMapMark_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_BaseMapMark_C")
	}
	static class UW_BaseMapMark_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_BaseMapMark_C>();
	}
};
DUMPER7_ASSERTS_UW_BaseMapMark_C;

}

