#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_Map_Layer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_Map_Layer.W_Map_Layer_C
// 0x0110 (0x03D0 - 0x02C0)
class UW_Map_Layer_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ZoomInertiaPlus;                                   // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ZoomInertiaMinus;                                  // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Border_Image;                                      // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CP_ActorLayer;                                     // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CP_CursorLayer;                                    // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AMap_in_2D_C*                           RefMapIn2D;                                        // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          IsMiniMap;                                         // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2F9[0x7];                                      // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentIconScale;                                  // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CurrentZoomScale;                                  // 0x0308(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              BaseImageSize;                                     // 0x0310(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_WorldMapSubsystem_C*                _World_Map_Subsystem;                              // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<class UObject*, class UW_BaseMapMark_C*> CreatedMarkerWidgets;                              // 0x0328(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FGameplayTagQuery                      OpacityTagQuery;                                   // 0x0378(0x0048)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UW_BaseMapMark_C*>               OptimizedUpdateQueue;                              // 0x03C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void AddMarkerToUpdateQueue(class UW_BaseMapMark_C* MarkerWidget);
	void ClearMarkers();
	void Construct();
	void ConvertMapToLayer(const struct FVector2D& In, struct FVector2D* Out);
	void ConvertWorldSizeToMap(double WorldSize, double* MapSize);
	void Create_Marker_Widget(const struct FStr_MapMarker& Data, class UW_BaseMapMark_C** Widget);
	void Destruct();
	void ExecuteUbergraph_W_Map_Layer(int32 EntryPoint);
	void GetCursorMarkerWidget(class UW_BaseMapMark_C** MarkerWidget);
	void GetMarkersAtPosition(const struct FVector2D& position, double Radius, const struct FGameplayTagQuery& TagQuery, TArray<class UW_BaseMapMark_C*>* Markers);
	void GetMarkerSize(const struct FStr_MapMarker& marker, struct FVector2D* Size);
	void GetWidgetClassForMarker(const struct FStr_MapMarker& marker, class UClass** WidgetClass);
	void GetZOrderForMarker(const struct FStr_MapMarker& marker, int32* ZOrder);
	void HandleZoom(double ZoomScale, bool bIncreaseScale);
	void PreConstruct(bool IsDesignTime);
	void QueueUpdate();
	void RefreshMarkers();
	void RemoveMarker(const struct FStr_MapMarker& marker);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Marker(const struct FStr_MapMarker& marker, class UW_BaseMapMark_C** MarkerWidget);
	void UpdateMarkerOpacityOnIntersection(class UW_BaseMapMark_C* MarkerWidget);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_Map_Layer_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_Map_Layer_C")
	}
	static class UW_Map_Layer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_Map_Layer_C>();
	}
};
DUMPER7_ASSERTS_UW_Map_Layer_C;

}

