#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: W_MinimapCompass

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass W_MinimapCompass.W_MinimapCompass_C
// 0x0038 (0x02F8 - 0x02C0)
class UW_MinimapCompass_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Appearance;                                        // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HighlightBorder;                                   // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_Map_C*                               Map_Widget;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              ItemsSize;                                         // 0x02E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_W_MinimapCompass(int32 EntryPoint);
	void FilterMarkersByMinimapRadius(TArray<struct FStr_MapMarker>& InMarkers, TArray<struct FStr_MapMarker>* OutMarkers);
	void GetMarkerSize(const struct FStr_MapMarker& marker, double* Size);
	void HandleRegisteredOverlapArea(class AActor* NewAreaActor);
	void Init(class UW_Map_C* MapWidget);
	void InZone_Event();
	void OnInitialized();
	void OutZone_Event();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Update_Items_Location();
	void UpdateItemsCount();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("W_MinimapCompass_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"W_MinimapCompass_C")
	}
	static class UW_MinimapCompass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UW_MinimapCompass_C>();
	}
};
DUMPER7_ASSERTS_UW_MinimapCompass_C;

}

