#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DialogueSystem_Reply

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "EStatDialogueReplyNode_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_DialogueSystem_Reply.WB_DialogueSystem_Reply_C
// 0x0070 (0x15F0 - 0x1580)
class UWB_DialogueSystem_Reply_C final : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BG;                                                // 0x1588(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonTextBlock*                       ButtonText;                                        // 0x1590(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ButtonTypeicon;                                    // 0x1598(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAC_DialogueSystem_C*                   AC_DialogueSystem;                                 // 0x15A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x15A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_15AC[0x4];                                     // 0x15AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x15B0(0x0018)(Edit, BlueprintVisible)
	bool                                          Selected;                                          // 0x15C8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15C9[0x7];                                     // 0x15C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgContext*                            NewVar;                                            // 0x15D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowHint;                                          // 0x15D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Enable_Input;                                      // 0x15D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15DA[0x6];                                     // 0x15DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UInputAction*                           DefaultInputAction;                                // 0x15E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnClicked();
	void BP_OnFocusReceived();
	void BP_OnHovered();
	void BP_OnUnhovered();
	void Enable();
	void EnableButtons(bool Is_Enabled);
	void EnterFix();
	void ExecuteUbergraph_WB_DialogueSystem_Reply(int32 EntryPoint);
	class FText Get_ReplyText();
	void GetContext(class UDlgContext** Context);
	void GetOptionData(EStatDialogueReplyNode* TypeReply);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnFocusLost(const struct FFocusEvent& InFocusEvent);
	struct FEventReply OnFocusReceived(const struct FGeometry& MyGeometry, const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent);
	void OnMouseEnter(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnMouseLeave(const struct FPointerEvent& MouseEvent);
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void PreConstruct(bool IsDesignTime);
	void Refresh(class UDlgContext* Context);
	void SetReplyStyle();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_DialogueSystem_Reply_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_DialogueSystem_Reply_C")
	}
	static class UWB_DialogueSystem_Reply_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_DialogueSystem_Reply_C>();
	}
};
DUMPER7_ASSERTS_UWB_DialogueSystem_Reply_C;

}

