#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_FractionMembersCarousel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_FractionMembersCarousel.WB_FractionMembersCarousel_C
// 0x0088 (0x0358 - 0x02D0)
class UWB_FractionMembersCarousel_C final : public UItemsCarouselWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UButton*                                Button_NextMember;                                 // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Button_PreviousMember;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBox_FractionName;                              // 0x02E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBox_MemberDescription;                         // 0x02F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBox_MemberName;                                // 0x02F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 ViewInCodexButton;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_FractionMember_C*                   WB_FractionMember_Main;                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_FractionMember_C*                   WB_FractionMember_Next;                            // 0x0310(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_FractionMember_C*                   WB_FractionMember_Prev;                            // 0x0318(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          HasPrev;                                           // 0x0320(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasNext;                                           // 0x0321(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_322[0x6];                                      // 0x0322(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   NameNotOpened;                                     // 0x0328(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	class FText                                   DescriptionNotOpened;                              // 0x0340(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)

public:
	void BndEvt__WB_FractionMembersCarousel_Button_NextCharacter_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WB_FractionMembersCarousel_Button_PreviousCharacter_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__WB_FractionMembersCarousel_ViewInCodexButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_FractionMembersCarousel_ViewInCodexButton_K2Node_ComponentBoundEvent_3_OnActionPressed__DelegateSignature();
	void BP_OnRotation();
	void Clear();
	void Construct();
	void ExecuteUbergraph_WB_FractionMembersCarousel(int32 EntryPoint);
	void Initialize(TArray<class UCarouselItemData*>& New_Data);
	void UpdateData();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_FractionMembersCarousel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_FractionMembersCarousel_C")
	}
	static class UWB_FractionMembersCarousel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_FractionMembersCarousel_C>();
	}
};
DUMPER7_ASSERTS_UWB_FractionMembersCarousel_C;

}

