#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MenuPopup_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UI_PopUpBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_MenuPopup_Base.WB_MenuPopup_Base_C
// 0x0090 (0x04B0 - 0x0420)
class UWB_MenuPopup_Base_C : public UUI_PopUpBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WB_MenuPopup_Base_C;                // 0x0420(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_MenuActionButton_C*                 CancelButton;                                      // 0x0428(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 ConfirmButton;                                     // 0x0430(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             ContentTextBox;                                    // 0x0438(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             HeaderTextBox;                                     // 0x0440(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_320;                                         // 0x0448(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FText                                   ConfirmButtonText;                                 // 0x0450(0x0018)(Edit, BlueprintVisible)
	class FText                                   CancelButtonText;                                  // 0x0468(0x0018)(Edit, BlueprintVisible)
	class FText                                   ContentText;                                       // 0x0480(0x0018)(Edit, BlueprintVisible)
	class FText                                   HeaderText;                                        // 0x0498(0x0018)(Edit, BlueprintVisible)

public:
	void BndEvt__WB_MenuPopup_Base_CancelButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_MenuPopup_Base_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	bool BP_OnHandleBackAction();
	void ExecuteUbergraph_WB_MenuPopup_Base(int32 EntryPoint);
	void OnCancel();
	void OnConfirm();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_MenuPopup_Base_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_MenuPopup_Base_C")
	}
	static class UWB_MenuPopup_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_MenuPopup_Base_C>();
	}
};
DUMPER7_ASSERTS_UWB_MenuPopup_Base_C;

}

