#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Menu_Load

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UI_Menu_saveLoadBase_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Menu_Load.WB_Menu_Load_C
// 0x0060 (0x0640 - 0x05E0)
class UWB_Menu_Load_C final : public UUI_Menu_saveLoadBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_MenuActionButton_C*                 BackBTN;                                           // 0x05E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Background;                                        // 0x05F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 DeleteBTN;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_121;                                         // 0x0600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 LoadBTN;                                           // 0x0608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCommonHierarchicalScrollBox*           SaveGameScrollBox;                                 // 0x0610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_SaveCardBase_C*                     CurrentSaveCard;                                   // 0x0618(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUI_ContainerBase_C*                    HUD_Ref;                                           // 0x0620(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          IsLoading;                                         // 0x0628(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_629[0x3];                                      // 0x0629(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LastAddedSlotIndex;                                // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         LoadingBunchNumber;                                // 0x0630(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void AddBunchOfSaveSlots();
	void BndEvt__WB_Menu_Load_DeleteBTN_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Menu_Load_LoadBTN_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BndEvt__WB_Menu_Load_SaveGameScrollBox_K2Node_ComponentBoundEvent_0_OnUserScrolledEvent__DelegateSignature(float CurrentOffset);
	void BndEvt__WB_Menu_Save_BTN_Back_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void Construct();
	void CreateAndAddSaveCardWidget(const struct FSaveInfoStorageEntry& SaveEntry, int32 Slot_Index);
	void Deleted_Event();
	void ExecuteUbergraph_WB_Menu_Load(int32 EntryPoint);
	void GetCurrentSaveCard(class UWB_SaveCardBase_C** SaveCard);
	void OnComplete_C254EBBE49FE1B954AFD16B39245739C(const TArray<struct FSaveInfoStorageEntry>& SaveEntries_0);
	struct FEventReply OnPreviewMouseButtonDown(const struct FGeometry& MyGeometry, const struct FPointerEvent& MouseEvent);
	void OnSlotSelected(class UCommonButtonBase* Button, bool Selected);
	void PreConstruct(bool IsDesignTime);
	void RefreshSaveGames();
	void RefreshSaves();
	void SaveCardClicked(class UCommonButtonBase* Button);
	void SetSaveCardSelected(class UCommonButtonBase* SaveCard);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_Menu_Load_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_Menu_Load_C")
	}
	static class UWB_Menu_Load_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Menu_Load_C>();
	}
};
DUMPER7_ASSERTS_UWB_Menu_Load_C;

}

