#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_MenuPopup_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function WB_MenuPopup_Base.WB_MenuPopup_Base_C.BndEvt__WB_MenuPopup_Base_CancelButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_MenuPopup_Base_C_BndEvt__WB_MenuPopup_Base_CancelButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_MenuPopup_Base_C_BndEvt__WB_MenuPopup_Base_CancelButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature;

// Function WB_MenuPopup_Base.WB_MenuPopup_Base_C.BndEvt__WB_MenuPopup_Base_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WB_MenuPopup_Base_C_BndEvt__WB_MenuPopup_Base_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_MenuPopup_Base_C_BndEvt__WB_MenuPopup_Base_ConfirmButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature;

// Function WB_MenuPopup_Base.WB_MenuPopup_Base_C.BP_OnHandleBackAction
// 0x0001 (0x0001 - 0x0000)
struct WB_MenuPopup_Base_C_BP_OnHandleBackAction final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_MenuPopup_Base_C_BP_OnHandleBackAction;

// Function WB_MenuPopup_Base.WB_MenuPopup_Base_C.ExecuteUbergraph_WB_MenuPopup_Base
// 0x0020 (0x0020 - 0x0000)
struct WB_MenuPopup_Base_C_ExecuteUbergraph_WB_MenuPopup_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_MenuPopup_Base_C_ExecuteUbergraph_WB_MenuPopup_Base;

// Function WB_MenuPopup_Base.WB_MenuPopup_Base_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WB_MenuPopup_Base_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WB_MenuPopup_Base_C_PreConstruct;

}

