#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_QuestCardBaseNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_QuestCardBaseNew.WB_QuestCardBaseNew_C
// 0x0040 (0x15C0 - 0x1580)
class UWB_QuestCardBaseNew_C : public UCommonButtonBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1580(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UGenericQuest*                          QuestObject;                                       // 0x1588(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          IsActive;                                          // 0x1590(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1591[0x7];                                     // 0x1591(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnSelected;                      // 0x1598(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(class UCommonButtonBase* Button)> OnDeselected;                    // 0x15A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UInputAction*                           DefaultInputAction;                                // 0x15B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void BP_OnDeselected();
	void BP_OnHovered();
	void BP_OnSelected();
	void BP_OnUnhovered();
	void ExecuteUbergraph_WB_QuestCardBaseNew(int32 EntryPoint);
	ESlateVisibility Get_ActiveFlag_Visibility();
	void InitQuestCard(class UGenericQuest* QuestObject_0);
	void OnAddedToFocusPath(const struct FFocusEvent& InFocusEvent);
	void OnInitialized();
	void OnRemovedFromFocusPath(const struct FFocusEvent& InFocusEvent);
	void SetActiveStatus(bool Active);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_QuestCardBaseNew_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_QuestCardBaseNew_C")
	}
	static class UWB_QuestCardBaseNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_QuestCardBaseNew_C>();
	}
};
DUMPER7_ASSERTS_UWB_QuestCardBaseNew_C;

}

