#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_SaveCard

#include "Basic.hpp"

#include "WB_SaveCardBase_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_SaveCard.WB_SaveCard_C
// 0x00F0 (0x16D0 - 0x15E0)
class UWB_SaveCard_C final : public UWB_SaveCardBase_C
{
public:
	class UTextBlock*                             ActiveQuestName;                                   // 0x15D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             CompletionPercent;                                 // 0x15E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DateTime;                                          // 0x15E8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Difficulty;                                        // 0x15F0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         DifficultyBox;                                     // 0x15F8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             DifficultyLabel;                                   // 0x1600(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             LocationName;                                      // 0x1608(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             SaveType;                                          // 0x1610(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Screenshot;                                        // 0x1618(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TotalTime;                                         // 0x1620(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMap<class FName, class FText>                LevelNameMap;                                      // 0x1628(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, int32>                      LoadImageIndex;                                    // 0x1678(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void LoadGame();
	void SaveGame();
	void SetSaveInfo(const struct FSaveInfoStorageEntry& SaveInfoEntry);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_SaveCard_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_SaveCard_C")
	}
	static class UWB_SaveCard_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_SaveCard_C>();
	}
};
DUMPER7_ASSERTS_UWB_SaveCard_C;

}

