#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TutorialPopup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Smuta_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TutorialPopup.WB_TutorialPopup_C
// 0x0070 (0x04E8 - 0x0478)
class UWB_TutorialPopup_C final : public UTutorialPopupWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0478(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 BGImage;                                           // 0x0480(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               BorderSizeBox;                                     // 0x0488(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ContentImage;                                      // 0x0490(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         HintTextBlock;                                     // 0x0498(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MenuActionButton_C*                 UI_MenuActionButton;                               // 0x04A0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_TutorialTimerProgressBar_C*         WB_TutorialTimerProgressBar;                       // 0x04A8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UMediaPlayer*                           MediaPlayer;                                       // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UMediaSource*                           VideoSource;                                       // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              BGImageTexture;                                    // 0x04C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

public:
	void BndEvt__WB_TutorialPopup_UI_MenuActionButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature(class UCommonButtonBase* Button);
	void BP_OnActivated();
	void BP_OnDeactivated();
	void CloseHint();
	void ExecuteUbergraph_WB_TutorialPopup(int32 EntryPoint);
	void FillOut();
	class URichTextBlock* GetHintTextContainer();
	void OnVideoEndReached();
	void OnVideoStarted(const class FString& OpenedUrl);
	void PreConstruct(bool IsDesignTime);
	void SetImageContent(class UTutorialPopupHintImageContent* InContent);
	void SetInputMode(bool IsUI);
	void SetVideoContent(class UTutorialPopupHintVideoContent* InContent);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

	class UWidget* BP_GetDesiredFocusTarget() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_TutorialPopup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_TutorialPopup_C")
	}
	static class UWB_TutorialPopup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TutorialPopup_C>();
	}
};
DUMPER7_ASSERTS_UWB_TutorialPopup_C;

}

