#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_TagComboItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "E_TutorialTagCombiItemState_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_TagComboItem.WB_TagComboItem_C
// 0x0090 (0x0350 - 0x02C0)
class UWB_TagComboItem_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Fail;                                              // 0x02C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Success;                                           // 0x02D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 InputImage;                                        // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UncompletedInputImage;                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	E_TutorialTagCombiItemState                   State;                                             // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2E9[0x7];                                      // 0x02E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<E_TutorialTagCombiItemState, class UDataTable*> StateIconsMap;                              // 0x02F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                   InputActionName;                                   // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAnimPlaying;                                      // 0x0348(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_TagComboItem(int32 EntryPoint);
	void On_Animation_Finished();
	void Set_Input_Action_Name(class FName New_Name);
	void Set_State(E_TutorialTagCombiItemState NewState);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WB_TagComboItem_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WB_TagComboItem_C")
	}
	static class UWB_TagComboItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_TagComboItem_C>();
	}
};
DUMPER7_ASSERTS_UWB_TagComboItem_C;

}

