#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_WorldQuestMarkerBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WBP_WorldQuestMarkerBase.WBP_WorldQuestMarkerBase_C.ExecuteUbergraph_WBP_WorldQuestMarkerBase
// 0x0018 (0x0018 - 0x0000)
struct WBP_WorldQuestMarkerBase_C_ExecuteUbergraph_WBP_WorldQuestMarkerBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsTracking;                     // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0008(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_WorldQuestMarkerBase_C_ExecuteUbergraph_WBP_WorldQuestMarkerBase;

// Function WBP_WorldQuestMarkerBase.WBP_WorldQuestMarkerBase_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldQuestMarkerBase_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_WorldQuestMarkerBase_C_PreConstruct;

// Function WBP_WorldQuestMarkerBase.WBP_WorldQuestMarkerBase_C.UpdateIcon
// 0x0001 (0x0001 - 0x0000)
struct WBP_WorldQuestMarkerBase_C_UpdateIcon final
{
public:
	bool                                          IsTracking;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_WorldQuestMarkerBase_C_UpdateIcon;

}

