#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_DialogueStatus

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_DialogueStatus.WBP_DialogueStatus_C
// 0x0038 (0x02F8 - 0x02C0)
class UWBP_DialogueStatus_C final : public UUserWidget
{
public:
	class UImage*                                 DialogueStatusImage;                               // 0x02C0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        IconSwitcher;                                      // 0x02C8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_HUD_Hint_C*                         InteractWidgetHint;                                // 0x02D0(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             NPCRoleTextBlock;                                  // 0x02D8(0x0008)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, InstancedReference, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class ANPC_CH_C*                              OwnerNPC;                                          // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UDialogueStatusWidgetComponent*         DialogueStatusWidgetComponent;                     // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldShowInteract;                                // 0x02F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BindToPlayerTagChanged();
	void InitializeWidget(class UWidgetComponent* ParentWidgetComponent, class AActor* Owner);
	void OnDialogueEnded();
	void OnDialogueEndUpdated(bool NewDialogueEnd);
	void OnDialogueInteractionAvailable(class UInteractionWidgetComponent* WidgetComponent, class UInteractionWidget* Widget);
	void OnDialogueInteractionUnavailable();
	void OnDialogueStarted();
	void OnPlayerTagChanged(const struct FGameplayTag& UpdatedTag, bool Exists);
	void UpdateDialogueStatus();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_DialogueStatus_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_DialogueStatus_C")
	}
	static class UWBP_DialogueStatus_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_DialogueStatus_C>();
	}
};
DUMPER7_ASSERTS_UWBP_DialogueStatus_C;

}

