#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatProgressBar_Health

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_StatProgressBar_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "E_StatChangeType_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatProgressBar_Health.WBP_StatProgressBar_Health_C
// 0x0040 (0x0520 - 0x04E0)
class UWBP_StatProgressBar_Health_C final : public UWBP_StatProgressBar_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_StatProgressBar_Health_C;       // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBaseAbilitiesComponent*                AbilityComponent;                                  // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBaseAttributes*                        Base_Attributes;                                   // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Normal_Health_Color;                               // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Low_Health_Color;                                  // 0x0508(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHealed_With_Potion;                               // 0x0518(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Change_Progress(E_StatChangeType New_Stat_Change_Type, double Delta);
	void Config_Gap();
	void Construct();
	void EventReceived_1CC4B1C643990C9036EDB78A94240125(const struct FGameplayEventData& Payload);
	void ExecuteUbergraph_WBP_StatProgressBar_Health(int32 EntryPoint);
	void On_Abilities_Component_Loaded();
	void On_Heath_Effect_Delegate(const struct FGameplayModifierEvaluatedData& ModifierEvaluatedData, const struct FGameplayEffectSpec& EffectSpec);
	void OnDamageReceived(const float& Damage);
	void OnHealthRecieved(const float& Health);
	void OnMaxHealthChanged(const float& OldValue, const float& NewValue);
	void PreConstruct(bool IsDesignTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_StatProgressBar_Health_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_StatProgressBar_Health_C")
	}
	static class UWBP_StatProgressBar_Health_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatProgressBar_Health_C>();
	}
};
DUMPER7_ASSERTS_UWBP_StatProgressBar_Health_C;

}

