#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_StatProgressBar_Concentration

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "WBP_StatProgressBar_Base_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_StatProgressBar_Concentration.WBP_StatProgressBar_Concentration_C
// 0x0030 (0x0510 - 0x04E0)
class UWBP_StatProgressBar_Concentration_C final : public UWBP_StatProgressBar_Base_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_WBP_StatProgressBar_Concentration_C; // 0x04E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBaseAbilitiesComponent*                AbilityComponent;                                  // 0x04E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBattleStats*                           Battle_Stats;                                      // 0x04F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Glow_Color;                                        // 0x04F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Gap_Size;                                          // 0x0508(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Added_6B16E34545993577ACF5298716B4D757();
	void Construct();
	void CREATEDELEGATE_PROXYFUNCTION_0(const float& OldValue, const float& NewValue);
	void ExecuteUbergraph_WBP_StatProgressBar_Concentration(int32 EntryPoint);
	void On_Abilities_Component_Loaded();
	void On_Concentration_Change_Effect(const struct FGameplayModifierEvaluatedData& ModifierEvaluatedData, const struct FGameplayEffectSpec& EffectSpec);
	void On_Concentration_Changed(double OldValue, double NewValue);
	void On_Vigor_Change_Effect(const struct FGameplayModifierEvaluatedData& ModifierEvaluatedData, const struct FGameplayEffectSpec& EffectSpec);
	void PreConstruct(bool IsDesignTime);
	void Removed_3A210BD4433BFD7599EA828DCB930CB0();
	void Update_On_Concentration_Change_Effect(const struct FGameplayModifierEvaluatedData& ModifierEvaluatedData, const struct FGameplayEffectSpec& EffectSpec, bool bVigor);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_StatProgressBar_Concentration_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_StatProgressBar_Concentration_C")
	}
	static class UWBP_StatProgressBar_Concentration_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_StatProgressBar_Concentration_C>();
	}
};
DUMPER7_ASSERTS_UWBP_StatProgressBar_Concentration_C;

}

