#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: YnnkMetaFaceEnhancer

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "YnnkMetaFaceEnhancer_structs.hpp"
#include "YnnkVoiceLipsync_structs.hpp"


namespace SDK::Params
{

// Function YnnkMetaFaceEnhancer.AsyncAnimBuilder.IsWorking
// 0x0001 (0x0001 - 0x0000)
struct AsyncAnimBuilder_IsWorking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_AsyncAnimBuilder_IsWorking;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.BuildFacialAnimationData
// 0x0020 (0x0020 - 0x0000)
struct MFFunctionLibrary_BuildFacialAnimationData final
{
public:
	class UYnnkVoiceLipsyncData*                  LipsyncData;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateLipSync;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateFacialAnimation;                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FMHFacialAnimation& LipsyncAnimation, const struct FMHFacialAnimation& FacialAnimation)> CallbackEvent; // 0x000C(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_MFFunctionLibrary_BuildFacialAnimationData;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.CopyFacialFrameToClipboard
// 0x0070 (0x0070 - 0x0000)
struct MFFunctionLibrary_CopyFacialFrameToClipboard final
{
public:
	TMap<class FName, float>                      InData;                                            // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TArray<class FString>                         FilterCurves;                                      // 0x0050(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0060(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_CopyFacialFrameToClipboard;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.FacialAnimation_CurveValueAtTime
// 0x00D0 (0x00D0 - 0x0000)
struct MFFunctionLibrary_FacialAnimation_CurveValueAtTime final
{
public:
	struct FMHFacialAnimation                     Animation;                                         // 0x0000(0x00C0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FName                                   Curve;                                             // 0x00C0(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayTime;                                          // 0x00C8(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x00CC(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_FacialAnimation_CurveValueAtTime;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.FacialAnimation_GetDescription
// 0x00D0 (0x00D0 - 0x0000)
struct MFFunctionLibrary_FacialAnimation_GetDescription final
{
public:
	struct FMHFacialAnimation                     Animation;                                         // 0x0000(0x00C0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x00C0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_FacialAnimation_GetDescription;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.FacialAnimation_Initialize
// 0x0120 (0x0120 - 0x0000)
struct MFFunctionLibrary_FacialAnimation_Initialize final
{
public:
	struct FMHFacialAnimation                     Animation;                                         // 0x0000(0x00C0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FSimpleFloatCurve>   InAnimationData;                                   // 0x00C0(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         Intensity;                                         // 0x0110(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInFadeOnPause;                                    // 0x0114(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_115[0x3];                                      // 0x0115(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         InFadePauseDuration;                               // 0x0118(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFadeTime;                                        // 0x011C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_FacialAnimation_Initialize;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.FacialAnimation_Play
// 0x00C0 (0x00C0 - 0x0000)
struct MFFunctionLibrary_FacialAnimation_Play final
{
public:
	struct FMHFacialAnimation                     Animation;                                         // 0x0000(0x00C0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_FacialAnimation_Play;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.FacialAnimation_Stop
// 0x00C0 (0x00C0 - 0x0000)
struct MFFunctionLibrary_FacialAnimation_Stop final
{
public:
	struct FMHFacialAnimation                     Animation;                                         // 0x0000(0x00C0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_FacialAnimation_Stop;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.FacialAnimation_Tick
// 0x00D0 (0x00D0 - 0x0000)
struct MFFunctionLibrary_FacialAnimation_Tick final
{
public:
	struct FMHFacialAnimation                     Animation;                                         // 0x0000(0x00C0)(Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         PlayTime;                                          // 0x00C0(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C4[0x4];                                       // 0x00C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UYnnkLipsyncController*                 LipSyncController;                                 // 0x00C8(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_FacialAnimation_Tick;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.InitializeYnnkMetaFace
// 0x0010 (0x0010 - 0x0000)
struct MFFunctionLibrary_InitializeYnnkMetaFace final
{
public:
	class UObject*                                Parent;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNeuralProcessWrapper*                  ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_InitializeYnnkMetaFace;

// Function YnnkMetaFaceEnhancer.MFFunctionLibrary.MakeHeadRotatorFromAnimFrame
// 0x0078 (0x0078 - 0x0000)
struct MFFunctionLibrary_MakeHeadRotatorFromAnimFrame final
{
public:
	TMap<class FName, float>                      AnimationFrame;                                    // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	float                                         OffsetRoll;                                        // 0x0050(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetPitch;                                       // 0x0054(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         OffsetYaw;                                         // 0x0058(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               ReturnValue;                                       // 0x0060(0x0018)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_MFFunctionLibrary_MakeHeadRotatorFromAnimFrame;

// Function YnnkMetaFaceEnhancer.NeuralProcessWrapper.IsEmotionsModelReady
// 0x0001 (0x0001 - 0x0000)
struct NeuralProcessWrapper_IsEmotionsModelReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeuralProcessWrapper_IsEmotionsModelReady;

// Function YnnkMetaFaceEnhancer.NeuralProcessWrapper.IsLipsyncModelReady
// 0x0001 (0x0001 - 0x0000)
struct NeuralProcessWrapper_IsLipsyncModelReady final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeuralProcessWrapper_IsLipsyncModelReady;

// Function YnnkMetaFaceEnhancer.NeuralProcessWrapper.IsValid
// 0x0001 (0x0001 - 0x0000)
struct NeuralProcessWrapper_IsValid final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_NeuralProcessWrapper_IsValid;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.BuildFacialAnimationData
// 0x0010 (0x0010 - 0x0000)
struct YnnkMetaFaceController_BuildFacialAnimationData final
{
public:
	class UYnnkVoiceLipsyncData*                  LipsyncData;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateLipSync;                                    // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateFacialAnimation;                            // 0x0009(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x000A(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_B[0x5];                                        // 0x000B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_YnnkMetaFaceController_BuildFacialAnimationData;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.InitializeRemoteAnimationBuilder
// 0x0020 (0x0020 - 0x0000)
struct YnnkMetaFaceController_InitializeRemoteAnimationBuilder final
{
public:
	class UYnnkRemoteClient*                      RemoteConnectionClient;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 IPv4;                                              // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Port;                                              // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_YnnkMetaFaceController_InitializeRemoteAnimationBuilder;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.OnAsyncBuilder_AnimationCreated
// 0x00A0 (0x00A0 - 0x0000)
struct YnnkMetaFaceController_OnAsyncBuilder_AnimationCreated final
{
public:
	TMap<class FName, struct FSimpleFloatCurve>   LipsyncData;                                       // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	TMap<class FName, struct FSimpleFloatCurve>   FacialAnimationData;                               // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_OnAsyncBuilder_AnimationCreated;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.OnLipsyncController_SpeakingInterrupted
// 0x0008 (0x0008 - 0x0000)
struct YnnkMetaFaceController_OnLipsyncController_SpeakingInterrupted final
{
public:
	class UYnnkVoiceLipsyncData*                  PhraseAsset;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_OnLipsyncController_SpeakingInterrupted;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.OnLipsyncController_StartSpeaking
// 0x0008 (0x0008 - 0x0000)
struct YnnkMetaFaceController_OnLipsyncController_StartSpeaking final
{
public:
	class UYnnkVoiceLipsyncData*                  PhraseAsset;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_OnLipsyncController_StartSpeaking;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.OnRemoteClient_ResponseReceived
// 0x0028 (0x0028 - 0x0000)
struct YnnkMetaFaceController_OnRemoteClient_ResponseReceived final
{
public:
	int32                                         RequestID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Command;                                           // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 JsonPacket;                                        // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_OnRemoteClient_ResponseReceived;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.SetEyesMovementEnabled
// 0x0001 (0x0001 - 0x0000)
struct YnnkMetaFaceController_SetEyesMovementEnabled final
{
public:
	bool                                          bNewIsEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_SetEyesMovementEnabled;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.SetEyesTarget
// 0x0020 (0x0020 - 0x0000)
struct YnnkMetaFaceController_SetEyesTarget final
{
public:
	struct FVector                                TargetLocation;                                    // 0x0000(0x0018)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        TargetComponent;                                   // 0x0018(0x0008)(Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_SetEyesTarget;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.SetUseRemoteAnimationBuilder
// 0x0002 (0x0002 - 0x0000)
struct YnnkMetaFaceController_SetUseRemoteAnimationBuilder final
{
public:
	bool                                          bNewIsEnabled;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_SetUseRemoteAnimationBuilder;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.Speak
// 0x0008 (0x0008 - 0x0000)
struct YnnkMetaFaceController_Speak final
{
public:
	class UYnnkVoiceLipsyncData*                  VoiceLipsyncData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_Speak;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.SpeakEx
// 0x0018 (0x0018 - 0x0000)
struct YnnkMetaFaceController_SpeakEx final
{
public:
	class UYnnkVoiceLipsyncData*                  VoiceLipsyncData;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundWave*                             Sound;                                             // 0x0008(0x0008)(Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SoundOffset;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_YnnkMetaFaceController_SpeakEx;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.GetRemoteConnectionClient
// 0x0008 (0x0008 - 0x0000)
struct YnnkMetaFaceController_GetRemoteConnectionClient final
{
public:
	class UYnnkRemoteClient*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_GetRemoteConnectionClient;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.HasValidAnimation
// 0x0010 (0x0010 - 0x0000)
struct YnnkMetaFaceController_HasValidAnimation final
{
public:
	const class UYnnkVoiceLipsyncData*            LipsyncData;                                       // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLipsyncIsValid;                                   // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFacialAnimationIsValid;                           // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_YnnkMetaFaceController_HasValidAnimation;

// Function YnnkMetaFaceEnhancer.YnnkMetaFaceController.IsInitialized
// 0x0001 (0x0001 - 0x0000)
struct YnnkMetaFaceController_IsInitialized final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_YnnkMetaFaceController_IsInitialized;

}

