#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: YnnkMetaFaceEnhancer

#include "Basic.hpp"

#include "YnnkVoiceLipsync_structs.hpp"
#include "Engine_classes.hpp"
#include "YnnkMetaFaceEnhancer_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SimplePyTorch_structs.hpp"


namespace SDK
{

// Class YnnkMetaFaceEnhancer.AsyncAnimBuilder
// 0x0138 (0x0160 - 0x0028)
class UAsyncAnimBuilder final : public UObject
{
public:
	float                                         EmotionsIntensity;                                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisemeApplyAlpha;                                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LipsyncNeuralIntensity;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LipsyncSmoothness;                                 // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FacialAnimationSmoothness;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPoseAsset*                             ArKitCurvesPoseAsset;                              // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLipSyncToSkeletonCurves;                          // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFacialAnimationToSkeletonCurves;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBalanceSmileFrownCurves;                          // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4B[0xD];                                       // 0x004B(0x000D)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, struct FSimpleFloatCurve>   OutLipsyncData;                                    // 0x0058(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FSimpleFloatCurve>   OutFacialAnimationData;                            // 0x00A8(0x0050)(NativeAccessSpecifierPublic)
	class UYnnkVoiceLipsyncData*                  LipsyncData;                                       // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSaveGeneratedAnimationInLipsyncData;              // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UYnnkVoiceLipsyncData*>          ProcessingQueue;                                   // 0x0108(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_118[0x10];                                     // 0x0118(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         QueueSize;                                         // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGenerateLipsync;                                  // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bGenerateFacialAnimation;                          // 0x012D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FMHFacialAnimation& LipsyncAnimation, const struct FMHFacialAnimation& FacialAnimation)> CallbackEvent; // 0x0130(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsWorking;                                        // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bExecutionInterrupted;                             // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_142[0x16];                                     // 0x0142(0x0016)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bLipsyncReady;                                     // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFacialAnimationReady;                             // 0x0159(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInterruptLastRequest;                             // 0x015A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_15B[0x5];                                      // 0x015B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void OnAnimationFailed();
	void OnAnimationReady();
	void Stop();

	bool IsWorking() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AsyncAnimBuilder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AsyncAnimBuilder")
	}
	static class UAsyncAnimBuilder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAsyncAnimBuilder>();
	}
};
DUMPER7_ASSERTS_UAsyncAnimBuilder;

// Class YnnkMetaFaceEnhancer.MFFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UMFFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool BuildFacialAnimationData(class UYnnkVoiceLipsyncData*& LipsyncData, bool bCreateLipSync, bool bCreateFacialAnimation, const TDelegate<void(const struct FMHFacialAnimation& LipsyncAnimation, const struct FMHFacialAnimation& FacialAnimation)>& CallbackEvent);
	static class FString CopyFacialFrameToClipboard(const TMap<class FName, float>& InData, const TArray<class FString>& FilterCurves);
	static float FacialAnimation_CurveValueAtTime(struct FMHFacialAnimation& Animation, class FName Curve, float PlayTime);
	static class FString FacialAnimation_GetDescription(struct FMHFacialAnimation& Animation);
	static void FacialAnimation_Initialize(struct FMHFacialAnimation& Animation, const TMap<class FName, struct FSimpleFloatCurve>& InAnimationData, float Intensity, bool bInFadeOnPause, float InFadePauseDuration, float InFadeTime);
	static void FacialAnimation_Play(struct FMHFacialAnimation& Animation);
	static void FacialAnimation_Stop(struct FMHFacialAnimation& Animation);
	static void FacialAnimation_Tick(struct FMHFacialAnimation& Animation, float PlayTime, class UYnnkLipsyncController* LipSyncController);
	static class UNeuralProcessWrapper* InitializeYnnkMetaFace(class UObject* Parent);
	static struct FRotator MakeHeadRotatorFromAnimFrame(const TMap<class FName, float>& AnimationFrame, float OffsetRoll, float OffsetPitch, float OffsetYaw);
	static void PrepareYnnkMetaFaceModel();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("MFFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"MFFunctionLibrary")
	}
	static class UMFFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMFFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UMFFunctionLibrary;

// Class YnnkMetaFaceEnhancer.NeuralProcessWrapper
// 0x0280 (0x02A8 - 0x0028)
class UNeuralProcessWrapper final : public UObject
{
public:
	TArray<class FName>                           NN_EmotionsOutCurves;                              // 0x0028(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                           NN_LipsyncOutCurves;                               // 0x0038(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FSimpleTorchTensor                     EmotionsInData;                                    // 0x0048(0x0090)(Protected, NativeAccessSpecifierProtected)
	struct FSimpleTorchTensor                     EmotionsOutData;                                   // 0x00D8(0x0090)(Protected, NativeAccessSpecifierProtected)
	class USimpleTorchModule*                     EmotionsNeuralModel;                               // 0x0168(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEmotionsModelReady;                               // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSimpleTorchTensor                     LipsyncInData;                                     // 0x0178(0x0090)(Protected, NativeAccessSpecifierProtected)
	struct FSimpleTorchTensor                     LipsyncOutData;                                    // 0x0208(0x0090)(Protected, NativeAccessSpecifierProtected)
	class USimpleTorchModule*                     LipsyncNeuralModel;                                // 0x0298(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLipsyncModelReady;                                // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Initialize();

	bool IsEmotionsModelReady() const;
	bool IsLipsyncModelReady() const;
	bool IsValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("NeuralProcessWrapper")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"NeuralProcessWrapper")
	}
	static class UNeuralProcessWrapper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UNeuralProcessWrapper>();
	}
};
DUMPER7_ASSERTS_UNeuralProcessWrapper;

// Class YnnkMetaFaceEnhancer.YnnkMetaFaceController
// 0x03F8 (0x0498 - 0x00A0)
class UYnnkMetaFaceController final : public UActorComponent
{
public:
	class FName                                   HeadComponentName;                                 // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   BodyComponentName;                                 // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMFEyeControllerSetup                  EyeRightSetup;                                     // 0x00B0(0x002C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FMFEyeControllerSetup                  EyeLeftSetup;                                      // 0x00DC(0x002C)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         MaxEyeRotationRightLeft;                           // 0x0108(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxEyeRotationUpDown;                              // 0x010C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPoseAsset*                             ArKitCurvesPoseAsset;                              // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EmotionsIntensity;                                 // 0x0118(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisemeApplyAlpha;                                  // 0x011C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LipsyncNeuralIntensity;                            // 0x0120(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LipsyncSmoothness;                                 // 0x0124(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FacialAnimationSmoothness;                         // 0x0128(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBalanceSmileFrownCurves;                          // 0x012C(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAsyncAnimationBuilder;                            // 0x012D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12E[0x2];                                      // 0x012E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AllowedEyeRotationRightLeft;                       // 0x0130(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AllowedEyeRotationUpDown;                          // 0x0134(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyLipsyncToSpeak;                              // 0x0138(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bApplyFacialAnimationToSpeak;                      // 0x0139(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLipSyncToSkeletonCurves;                          // 0x013A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFacialAnimationToSkeletonCurves;                  // 0x013B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoBakeAnimation;                                // 0x013C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13D[0x3];                                      // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BakedYnnkToMetaFaceRatio;                          // 0x0140(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakedLipSyncIntensity;                             // 0x0144(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BakedFacialAnimationIntensity;                     // 0x0148(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseExtraAnimationFromLipsyncDataAsset;            // 0x014C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14D[0x3];                                      // 0x014D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EyeMovementSpeed;                                  // 0x0150(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDrawDebug;                                        // 0x0154(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLogDebug;                                         // 0x0155(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_156[0x2];                                      // 0x0156(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMHFacialAnimation                     CurrentLipsync;                                    // 0x0158(0x00C0)(BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMHFacialAnimation                     CurrentFaceAnim;                                   // 0x0218(0x00C0)(BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      CurrentEyesState;                                  // 0x02D8(0x0050)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<class FName, float>                      CurrentBakedFaceFrame;                             // 0x0328(0x0050)(BlueprintVisible, NativeAccessSpecifierPublic)
	float                                         PlayTime;                                          // 0x0378(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRemoteBuilder;                                 // 0x037C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEyesControlType                              EyesControllerType;                                // 0x037D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_37E[0x2];                                      // 0x037E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EyeRotation_Right;                                 // 0x0380(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              EyeRotation_Left;                                  // 0x0390(0x0010)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class UYnnkVoiceLipsyncData* LipsyncData, bool bResult)> OnAnimationBuildingComplete; // 0x03A0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UYnnkLipsyncController*                 LipSyncController;                                 // 0x03B0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 HeadMesh;                                          // 0x03B8(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                 BodyMesh;                                          // 0x03C0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UYnnkVoiceLipsyncData*                  ProcessedLipsyncData;                              // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UYnnkRemoteClient*                      RemoteClient;                                      // 0x03D0(0x0008)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class FName, struct FFacialAnimCollection> FaceAnimations;                                  // 0x03D8(0x0050)(Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_428[0x18];                                     // 0x0428(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                EyesTargetLocation;                                // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                        EyesTargetComponent;                               // 0x0458(0x0008)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EyesNextUpdateTime;                                // 0x0460(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_464[0x4];                                      // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              EyeRotation_Target;                                // 0x0468(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         EyesTargetAlpha;                                   // 0x0478(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_47C[0x4];                                      // 0x047C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FacialAnimationPauseDuration;                      // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_484[0x4];                                      // 0x0484(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           LipSyncARCurvesSet;                                // 0x0488(0x0010)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)

public:
	bool BuildFacialAnimationData(class UYnnkVoiceLipsyncData* LipsyncData, bool bCreateLipSync, bool bCreateFacialAnimation);
	void DisconnectFromRemoteBuilder();
	void FillEyeAnimationCurves();
	bool InitializeRemoteAnimationBuilder(class UYnnkRemoteClient** RemoteConnectionClient, const class FString& IPv4, int32 Port);
	void OnAsyncBuilder_AnimationCreated(const TMap<class FName, struct FSimpleFloatCurve>& LipsyncData, const TMap<class FName, struct FSimpleFloatCurve>& FacialAnimationData);
	void OnAsyncBuilder_RequestInterrupted();
	void OnLipsyncController_SpeakingInterrupted(class UYnnkVoiceLipsyncData* PhraseAsset);
	void OnLipsyncController_StartSpeaking(class UYnnkVoiceLipsyncData* PhraseAsset);
	void OnRemoteClient_ResponseReceived(int32 RequestID, const class FString& Command, const class FString& JsonPacket);
	void SetEyesMovementEnabled(bool bNewIsEnabled);
	void SetEyesTarget(const struct FVector& TargetLocation, class USceneComponent* TargetComponent);
	bool SetUseRemoteAnimationBuilder(bool bNewIsEnabled);
	void Speak(class UYnnkVoiceLipsyncData* VoiceLipsyncData);
	void SpeakEx(class UYnnkVoiceLipsyncData* VoiceLipsyncData, class USoundWave* Sound, float SoundOffset);

	class UYnnkRemoteClient* GetRemoteConnectionClient() const;
	void HasValidAnimation(const class UYnnkVoiceLipsyncData* LipsyncData, bool* bLipsyncIsValid, bool* bFacialAnimationIsValid) const;
	bool IsInitialized() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("YnnkMetaFaceController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"YnnkMetaFaceController")
	}
	static class UYnnkMetaFaceController* GetDefaultObj()
	{
		return GetDefaultObjImpl<UYnnkMetaFaceController>();
	}
};
DUMPER7_ASSERTS_UYnnkMetaFaceController;

// Class YnnkMetaFaceEnhancer.YnnkMetaFaceSettings
// 0x0070 (0x0098 - 0x0028)
class UYnnkMetaFaceSettings final : public UObject
{
public:
	float                                         EmotionsIntensity;                                 // 0x0028(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VisemeApplyAlpha;                                  // 0x002C(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LipsyncNeuralIntensity;                            // 0x0030(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LipsyncSmoothness;                                 // 0x0034(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FacialAnimationSmoothness;                         // 0x0038(0x0004)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<EYnnkViseme, struct FMetaFacePose>       LipsyncVisemesPreset;                              // 0x0040(0x0050)(Edit, Config, GlobalConfig, NativeAccessSpecifierPublic)
	bool                                          bBalanceSmileFrownCurves;                          // 0x0090(0x0001)(Edit, ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("YnnkMetaFaceSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"YnnkMetaFaceSettings")
	}
	static class UYnnkMetaFaceSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UYnnkMetaFaceSettings>();
	}
};
DUMPER7_ASSERTS_UYnnkMetaFaceSettings;

}

